{"title":"The Genesis Of Germs - Dr. Alan L. Gillen","uid":10386388,"size":50068726,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00287adde2a9991974e63ce39c169768894678db&amp;dn=The+Genesis+Of+Germs+-+Dr.+Alan+L.+Gillen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1403136077,"description":"As the world waits in fear, world health organizations race to develop a vaccine for the looming bird flu epidemic--a threat which has forced international, federal, and local governments to begin planning for a possible pandemic, and the widespread death and devastation which would follow. Will the world find an answer in time? Or will we see this threat ravage populations as others have before 1918 with influenza, in the late 18th century with yellow fever, or the horrific &quot;black &quot;death&quot; or bubonic plague in 1347 A.D.?\nAre these [viruses] examples of evolution? ...Did God make microbes by mistake? Are they accidents of evolution, out of the primordial soup? These timely questions are examined throughout this book. -from chapter 1\nIt seems that a new and more terrible disease is touted on the news almost daily. The spread of these scary diseases from avian flu to SARS to AIDS is a cause for concern and leads to questions, such as:\n-Where did all these germs come from?\n-How do they fit into a biblical world view?\n-What kind of function did these microbes have before the Fall?\n-Does antibiotic resistance in bacteria prove evolution?\n-How can something so small have such a huge, deadly impact on the world around us?\nProfessor Alan Gillen sheds light on these and many other questions in this revealing and detailed book. He shows how these constantly mutating diseases are proof for devolution rather than evolution and how all of these germs fit into a biblical world view. Dr. Gillen shows how germs are symptomatic of the literal Fall and Curse of creation as a result of man's sin, and the hope we have in the coming of Jesus Christ.\n\n\nAbout the author:\nDr. Alan L. Gillen is a biologist and zoologist with a doctorate in science education. He is an experienced biology instructor at both the high school and college levels. He has authored more than 25 papers and two books in biology, microbiology, zoology, anatomy and physiology, and medical issues. He has been active in bringing a biblical perspective in biology and medicine in the classroom and local churches for the last eight years. He is also a regular contributor to Creation Matters, a CRS newsletter. He is active in bringing a biblical perspective to biology and medicine in the classroom. Dr. Gillen is currently working on a college-level biology textbook with Dr. Chris Carmichael and Frank Sherwin. Dr. Gillen presently is a professor of biology at Liberty University. ","torrent":{"xt":"urn:btih:00287adde2a9991974e63ce39c169768894678db","amp;dn":"The+Genesis+Of+Germs+-+Dr.+Alan+L.+Gillen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00287adde2a9991974e63ce39c169768894678db","infoHashBuffer":{"type":"Buffer","data":[0,40,122,221,226,169,153,25,116,230,60,227,156,22,151,104,137,70,120,219]},"announce":[],"urlList":[]}}