{"title":"The Outlaw and his Wife (Berg-Ejvind och Hans Hustru, 1917)","uid":4004825,"size":1572768378,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0032f178f745d1dc9b569b4e6a80d2e8b40e203e&amp;dn=The+Outlaw+and+his+Wife+%28Berg-Ejvind+och+Hans+Hustru%2C+1917%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"soidemersol","files":1,"time":1201768346,"description":"Adapted from a play by Johann Sigurjonson, director Victor SjÃƒ?Ã‚Â¶strÃƒ?Ã‚Â¶m\\&amp;#039;s Berg-Ejvind och Hans Hhustru is considered one of the first major films of Swedish cinema. The 1918 silent drama stars Victor SjÃƒ?Ã‚Â¶strÃƒ?Ã‚Â¶m as Berg-Eyvind, a drifter who begins working on the farm of a widow named Halla (Edith Erastoff). The couple falls in love only to have it revealed that Berg-Eyvind is a thief on the run after stealing a ship. Together, the lovers escape into the mountains of Iceland where many criminals before them have sought refuge. Released in the United States under the title You and I, Berg-Ejvind och Hans Hhustru was restored in 1966.\n\nBeginning in the mid-1910s, actor and director Victor SjÃƒ?Ã‚Â¶strÃƒ?Ã‚Â¶m created a series of features that were landmarks of both Swedish and international cinema. Prominent among these was The Outlaw and His Wife. While at moments the film may appear to be a routine melodrama, at the time of its release the mature approach towards the characters\\&amp;#039; psychological states and the stunning location photography were groundbreaking. The locations, photographed by pioneer cameraman Julius Jaenzon, are striking not only for their beauty, but also the unique role they play in the characters\\&amp;#039; lives. The mountains dominate their existence, and ultimately, it is nature that has control over whether they live or die. Among the more stirring moments are Ejvind\\&amp;#039;s heartstopping fall from a cliff, the sequence where Bjorn\\&amp;#039;s posse catches up with the fugitives, and Halla and her child are forced to the edge of the cliff, and the climactic starvation sequence that concludes with a startling final shot. The acting is filled with histrionics, but does have its moments of subtlety and insight, and if The Outlaw and His Wife has not entirely aged gracefully, its importance to the development of filmmaking also remains evident.","torrent":{"xt":"urn:btih:0032f178f745d1dc9b569b4e6a80d2e8b40e203e","amp;dn":"The+Outlaw+and+his+Wife+%28Berg-Ejvind+och+Hans+Hustru%2C+1917%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0032f178f745d1dc9b569b4e6a80d2e8b40e203e","infoHashBuffer":{"type":"Buffer","data":[0,50,241,120,247,69,209,220,155,86,155,78,106,128,210,232,180,14,32,62]},"announce":[],"urlList":[]}}