{"title":"Minder S06  1985","uid":6376664,"size":3168844580,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0107053eee3ac96cd79c9962d144781dc5cae770&amp;dn=Minder+S06++1985&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"OLDLIMEY4","files":6,"time":1304882069,"description":"6th Series 1985\n\n059. Give Us This Day Arthur Daley\\'s Bread - 04-Sep-85\n\nEllis Dale\n\nArthur volunteers the services of a group of vagrants who had taken refuge in a church crypt to do some gardening under Terry supervision. 060. Life In The Fast Food Lane - 11-Sep-85\n\nJan Francis, David Daker\n\nA good deal on car phones provides and excellent opportunity for Arthur to do a deal with an old business colleague just out from prison. When the local plod get wind of the dodgy car phone signals and the attention of Chisholm, Terry is busy falling in love, and being stitched up from all sides.\n\nPoor old Terry gets a right old pasting half way through this episode with very little help from Arthur. This episode really shows the depths that Arthur will go to make a little earner even if it involves taking total advantage of Terry, though watch out for the twist in the tail in which everybody gets what they deserve. Television stations in the UK seem reluctant to repeat this episode in any re-runs and as yet we have not found out why!061. Return Of The Invincible Man - 18-Sep-85\n\nJohn Bluthal, Pat Roach\n\nArthur\\'s efforts to help Sully, a garment manufacturer, end up getting them both in the hospital and into trouble with Chisholm.\n\nA rare appearance here by the late Pat Roach who was more famous for his role as \\'Bomber\\' in the TV series \\'Auf Wiedersehen Pet\\'.062. Arthur is Dead, Long Live Arthur - 25-Sep-85\n\nPenny Morrell, Robert Austin\n\tArthur disguises himself as an alias and promptly checks into an out of the way hotel run by an amorous widow in order to avoid the Inland Revenue who claim Arthur owes them Ã‚Â£20,000 tax back payments.\n\nWho is this we see here? Is it really Mr Black? \n\nThis episode sees Arthur living in a fantasy world as he resorts to desperate measures to avoid the inland revenue. Not convinced at all by Arthur\\'s disappearance, Chisolm is hot on his trail and causing all sorts of problems at  the Winchester Club. Penny Morrell is George Cole\\'s real life \\'er indoors.063. From Fulham With Love - 02-Oct-85\n\nMichael Gothand, Rula Lenska\n\nComplications arise when a Russian seaman whom Arthur had made a deal with decides to defect to Great Britain.064. Waiting for Goddard - 9-Oct-85\n\nKenneth Cope, Ronald Fraser\n\nArthur and Terry\\'s friendship is threatened as Arthur gets to know an eccentric old man who he believes has inherited a fortune.\n\n065. Minder On The Orient Express (120 min) - 25-Dec-85  - Christmas Special 1985\n\nAmanda Pays, Adam Faith, Honor Blackman, Maurice Denham, Ralph Bates, Ronald Lacey\n\nTerry is fortunate to receive tickets for the Orient Express after he helps the daughter of the deceased Jack South, a villain from years back. Arthur, who is trying to avoid a court subpoena from Chisolm and Rycott due to his involvement with Brain \\'Brain\\' Damage, decides his best course of action is to tag along, much to the dislike of Terry. Chisolm meanwhile, has landed an observatory position with Interpol aka \\&quot;Interplod\\&quot;..\n\nMany fans consider this to be the point at which the series peaked - a classic British TV film with a host of star names. Both George Cole and Johnny Goodman (Executive in Charge of Production) have stated that this is \\'probably\\' their most favourite episode of the whole series, and certainly the most fun to make as it had such a diverse supporting cast.\nChristmas Special 1988\n\n066. An Officer and a Car Salesman - 26-Dec-88\n\nRichard Briers, Diana Quick, Simon Williams\n\nTerry has ended up in prison as a result of some dodgy videos that Arthur decided to store at his flat. Determined to have nothing more to do with Arthur, Terry gets a job with a paramilitary group that Arthur has been selling dodgy military goods to. This episode was a Christmas special and sees actor Patrick Malahide in his last appearance in the show as security guard \\&quot;Mr Chisolm\\&quot;.\n\t\n\n","torrent":{"xt":"urn:btih:0107053eee3ac96cd79c9962d144781dc5cae770","amp;dn":"Minder+S06++1985","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0107053eee3ac96cd79c9962d144781dc5cae770","infoHashBuffer":{"type":"Buffer","data":[1,7,5,62,238,58,201,108,215,156,153,98,209,68,120,29,197,202,231,112]},"announce":[],"urlList":[]}}