{"title":"Depeche Mode - Music For The Masses (Original UK Release) (1987)","uid":4192475,"size":381254395,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:01843eaabf05d0b50c066a9df39917a10183b57d&amp;dn=Depeche+Mode+-+Music+For+The+Masses+%28Original+UK+Release%29+%281987%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigsimon","files":22,"time":1211039056,"description":"Music : Pop : Lossless\n\n\n\n\n\nDepeche Mode - Music For The Masses (1987) (FLAC-EAC-CUE)\n\n\n\n\n\n\nDepeche Mode Biography From allmusic.com\n\n\n\nBiography by Jason Ankeny\n\nOriginally a product of Britain&amp;#039;s new romantic movement, Depeche Mode went on to become the quintessential electro-pop band of the 1980s. One of the first acts to establish a musical identity based completely around the use of synthesizers, Depeche Mode began their existence as a bouncy dance-pop outfit but gradually developed a darker, more dramatic sound that ultimately positioned them as one of the most successful alternative bands of their era.\n\nThe roots of Depeche Mode date to 1976, when Basildon, England-based keyboardists Vince Clarke and Andrew Fletcher first teamed to form the group No Romance in China. The band proved short-lived, and by 1979 Clarke had formed French Look, another duo featuring guitarist/keyboardist Martin Gore; Fletcher soon signed on, and the group rechristened itself Composition of Sound. Initially, Clarke handled vocal chores, but in 1980 singer David Gahan was brought in to complete the lineup; after one final name change to Depeche Mode, the quartet members jettisoned all instruments excluding their synthesizers, honing a slick, techno-based sound to showcase Clarke&amp;#039;s catchy melodies.\n\nAfter building a following on the London club scene, Depeche Mode debuted in 1980 with &quot;Photographic,&quot; a track included on the Some Bizarre Album label compilation. After signing to Mute Records, they issued &quot;Dreaming of Me&quot; in early 1981; while neither the single nor its follow-up, &quot;New Life,&quot; caused much of a stir, their third effort, &quot;Just Can&amp;#039;t Get Enough,&quot; became a Top Ten U.K. hit, and their 1981 debut LP, Speak and Spell, was also a success. Just as Depeche Mode appeared poised for a major commercial breakthrough, however, principal songwriter Clarke abruptly exited to form Yazoo with singer Alison Moyet, leaving the group&amp;#039;s future in grave doubt.\n\nAs Gore grabbed the band&amp;#039;s songwriting reins, the remaining trio recruited keyboardist Alan Wilder to fill the technological void created by Clarke&amp;#039;s departure; while 1982&amp;#039;s A Broken Frame deviated only slightly from Depeche Mode&amp;#039;s earlier work, Gore&amp;#039;s ominous songs grew more assured and sophisticated by the time of 1983&amp;#039;s Construction time Again. Some Great Reward, issued the following year, was their artistic and commercial breakthrough, as Gore&amp;#039;s dark, kinky preoccupations with spiritual doubt (&quot;Blasphemous Rumours&quot;) and psychosexual manipulation (&quot;Master and Servant&quot;) came to the fore; the egalitarian single &quot;People Are People&quot; was a major hit on both sides of the Atlantic and typified the music&amp;#039;s turn toward more industrial textures.\n\nReleased in 1986, the atmospheric Black Celebration continued the trend toward grim melancholy and further established the group as a major commercial force. After the superb single &quot;Strangelove,&quot; Depeche Mode issued 1987&amp;#039;s Music for the Masses; a subsequent sold-out tour yielded the 1989 double live set 101 as well as a concert film directed by the legendary D.A. Pennebaker. Still, despite an enormous fan base, the group was considered very much an underground cult phenomenon prior to the release of 1990&amp;#039;s Violator, a Top Ten smash that spawned the hits &quot;Enjoy the Silence,&quot; &quot;Policy of Truth,&quot; and &quot;Personal Jesus.&quot;\n\nWith the alternative music boom of the early &amp;#039;90s, Depeche Mode emerged as one of the world&amp;#039;s most successful acts, and their 1993 LP Songs of Faith &amp; Devotion entered the charts in the number one slot. However, at the peak of its success, the group began to unravel; first Wilder exited in 1995, and then Gahan was the subject of a failed suicide attempt. (He later entered a drug rehabilitation clinic to battle an addiction to heroin.) After a four-year layoff, Depeche Mode -- continuing on as a trio -- released 1997&amp;#039;s Ultra, which featured the hits &quot;Barrel of a Gun&quot; and &quot;It&amp;#039;s No Good.&quot; A year later, the band embarked on a tour in support of The Singles 86&gt;98 greatest-hits album. Depeche Mode played 64 shows in 18 countries for over a million fans. It also marked the end of a decade for the band. Each member took some considerable time off, and Depeche Mode would not regroup for another three years.\n\nExciter, the band&amp;#039;s follow-up to 1997&amp;#039;s Ultra, was released in 2001. Singles such as &quot;Dream On&quot; and &quot;I Feel Loved&quot; did moderately well. Two years later, Gahan issued his debut solo album, the dark and sultry Paper Monsters. Gore also followed suit by issuing his debut full-length, CounterfeitÃ‚Â². Each member did respective tours of the U.S. and Europe; however, it wouldn&amp;#039;t be long until Depeche Mode came back together. Playing the Angel became a Top Ten hit upon release in October 2005, produced by Ben Hillier (Doves, Blur, U2, Elbow). With the success of the &quot;Precious&quot; and &quot;John (The Revelator)&quot; singles, Playing the Angel topped the album charts in 18 countries and went multiple platinum and gold in 20 countries. Depeche Mode went to on play to 2.5 million fans worldwide, and the special-edition three-disc set Touring the Angel: Live in Milan (2006) captured the essence of one of the band&amp;#039;s greatest shows.\n\n\n\n\n\n\nCD Pressing Information\n\n\n\nLabel: Mute Records Ltd\nCatalog#: CD STUMM 47\nFormat: CD, Album\nCountry: UK\nReleased: 28 Sep 1987\nGenre: Electronic, Rock\nStyle: Industrial, Synth-pop\n\n\n\nCredits\n\n\nArtwork By [Design], Photography - Martyn Atkins, David Jones &amp; Mark Higenbottam @ T&amp;CP Assoc.\nEngineer - David Bascombe\nProducer - David Bascombe, Depeche Mode\nProducer [Additional &amp; Help] - Daniel Miller\nWritten-By - M.L. Gore\n\n\n\nNotes\n\n\nRecorded at Studio Guilliame Tell, Paris &amp; Konk, London.\nMixed at PUK Studios, Denmark.\nMastered by Nimbus.\n\n\n\n\n\nMusic For The Masses album review from allmusic.com\n\n\n\n\nReview by by Ned Raggett\n\nInitially the title must have sounded like an incredibly pretentious boast, except that Depeche Mode then went on to do a monstrous world tour, score even more hits in America and elsewhere than ever before, and pick up a large number of name checks from emerging house and techno artists on top of all that. As for the music the masses got this time around, the opening cut, &quot;Never Let Me Down Again,&quot; started things off wonderfully: a compressed guitar riff suddenly slamming into a huge-sounding percussion/keyboard/piano combination, anchored to a constantly repeated melodic hook, ever-building synth/orchestral parts at the song&amp;#039;s end, and one of David Gahan&amp;#039;s best vocals (though admittedly singing one of Martin Gore&amp;#039;s more pedestrian lyrics). It feels huge throughout, like they taped Depeche recording at the world&amp;#039;s largest arena show instead of in a studio. Other key singles &quot;Strangelove&quot; and the (literally) driving &quot;Behind the Wheel&quot; maintained the same blend of power and song skill, while some of the quieter numbers such as &quot;The Things You Said&quot; and &quot;I Want You Now&quot; showed musical and lyrical intimacy could easily co-exist with the big chart-busters. Add to that other winners like &quot;To Have and to Hold,&quot; with its Russian radio broadcast start and dramatic, downward spiral of music accompanied by Gahan&amp;#039;s subtly powerful take on a desperate Gore love lyric, and the weird, wonderful choral closer, &quot;Pimpf,&quot; and Depeche&amp;#039;s massive success becomes perfectly clear.\n\n\n\n\n\n\n\n\nTrack List\n\n\n\n\n\nDepeche Mode - Music For The Masses (1987)\n\n\n01. Never Let Me Down Again 04:48\n02. The Things You Said 04:02\n03. Strangelove 04:56\n04. Sacred 04:47\n05. Little 15 04:18\n06. Behind The Wheel 05:18\n07. I Want You Now 03:44\n08. To Have And To Hold 02:51\n09. Nothing 04:18\n10. Pimpf 05:25\n11. Agent Orange 05:05\n12. Never Let Me Down Again (Aggro Mix) 04:57\n13. To Have And To Hold (Spanish Taster) 02:36\n14. Pleasure Litle Treasure (Glitter Mix) 05:37\n\n\n\n\n\n\n\n\n\n\n\n\nENJOY ..........................................................................","torrent":{"xt":"urn:btih:01843eaabf05d0b50c066a9df39917a10183b57d","amp;dn":"Depeche+Mode+-+Music+For+The+Masses+%28Original+UK+Release%29+%281987%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01843eaabf05d0b50c066a9df39917a10183b57d","infoHashBuffer":{"type":"Buffer","data":[1,132,62,170,191,5,208,181,12,6,106,157,243,153,23,161,1,131,181,125]},"announce":[],"urlList":[]}}