{"title":"The 2000 Year Old Man - 1975 Animated Comedy Classic","uid":5529048,"size":263585799,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:01ab1175c25a7f0b2d3a19dd9671c9cb0977a416&amp;dn=The+2000+Year+Old+Man+-+1975+Animated+Comedy+Classic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rambam1776","files":-1,"time":1272875060,"description":"The 2000 Year Old Man - 1975 Animated Classic\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 1237kbps \nDuration.............: 24:19.206\nResolution...........: 624*468 \nFramerate............: 29.970 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 192 kbps CBR \nAudio Channels.......: 2 \nNO SUBTITLES\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0388667/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0388667/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/kamboaAcf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/kamboaAcf&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/2000_Year_Old_Man&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/2000_Year_Old_Man&lt;/a&gt;\n\n\n***NOTE*** - I will shortly be offering up a torrent complete with all FIVE recordings, this film, plus a one-off BBC special from 1983 that can't be found anywhere else. Who's your daddy?\n\n\nThe Animated Special\n\nOn January 11, 1975, there was a half-hour animated TV special, &quot;The 2000 Year Old Man,&quot; which incorporated some of the original recordings. This special has since been released on VHS videocassette and DVD. The musical introduction was Bach's Sinfonia to Cantata #29 performed on a Moog synthesizer by Mort Garson, in the style of Wendy Carlos' Switched-On Bach.\n\n\nThe 2000 Year Old Man was a persona in a comedy skit, created by Mel Brooks and Carl Reiner starting in 1961. The 2000 year old man's birthday was on October 16th 39 B.C (the year was never specified).\n\nMel Brooks played the oldest man in the world, interviewed by Carl Reiner in a series of comedy routines that appeared on television as well as being made into a collection of records. In a Jewish accent, Brooks would ad lib answers to topics such as the earliest known language (&quot;basic Rock&quot;), the creation of the Cross (&quot;it was easier to put together than the Star of David&quot;; &quot;to me it seemed...simple. I didn't know then it was eloquent!&quot;), and Joan of Arc (&quot;Know her? I went with her, dummy, I went with her!&quot;).\n\nThe inspiration for the skit was a tape-recorded exchange between Brooks and Reiner at a party. The tape recorder was brought into the mix shortly after the opening salvos as the two comics soon had the party audience in stitches. Back in 1961, when the duo began doing the skit on television, Brooks had just undergone painful surgery for gout. Because of his after-surgery discomfort, Brooks quipped, &quot;I feel like a 2000-year-old man,&quot; which led Reiner to begin questioning him about what it's like to be a 2000-year-old man and to describe history as Brooks saw it. Thus a classic skit was born.\n\nMel Brooks and Carl Reiner have released five comedy albums. The 2000 Year Old Man appeared on just one track for each of the first three albums, but took over the whole show for the last two.\n\n   1. 2000 Years with Carl Reiner and Mel Brooks (1961)\n   2. 2000 and One Years with Carl Reiner and Mel Brooks (1961)\n   3. Carl Reiner and Mel Brooks at the Cannes Film Festival (1962)\n   4. 2000 and Thirteen (1973)\n   5. The 2000 Year Old Man in the Year 2000 (1998)\n\nThe last in the series won the 1998 Grammy Award for Spoken word performance.\n\nAll five comedy albums were compiled and newly remastered on a 3-CD/1-DVD Box Set by Shout! Factory for the 50th anniversary. &quot;The 2000 Year Old Man: The Complete History&quot; DVD was released on November 24, 2009 and features an interview with Reiner and Brooks, the 1975 animated 2000 Year Old Man TV special, and vintage clips of the two appearing on The Ed Sullivan Show and The New Steve Allen Show.\n\nMany of the jokes (especially the caveman jokes) were eventually brought to the screen in Brooks' film History of the World, Part I.","torrent":{"xt":"urn:btih:01ab1175c25a7f0b2d3a19dd9671c9cb0977a416","amp;dn":"The+2000+Year+Old+Man+-+1975+Animated+Comedy+Classic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01ab1175c25a7f0b2d3a19dd9671c9cb0977a416","infoHashBuffer":{"type":"Buffer","data":[1,171,17,117,194,90,127,11,45,58,25,221,150,113,201,203,9,119,164,22]},"announce":[],"urlList":[]}}