{"title":"Apperio FEAST Test Training","uid":11818971,"size":27939816,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:02015a1449600117891698a3cc52f51fba3f8f9e&amp;dn=Apperio+FEAST+Test+Training&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kemi00c","files":1,"time":1429207809,"description":"Practice for Air Traffic Controller Selection.\n\nYou are invited to improve your skills necessary for a career in ATC. Our training app comprises thirteen training modules for test preparation.\n\nãƒ»General Intelligence Test - with questions similar to puzzles, in which is tested your cognitive attention\nãƒ»Logical Reasoning - involves letter sequences, number sequences and logical problems\nãƒ»Cube Folding - find the cube matching with the two dimensional net\nãƒ»Auditory Memory - listen carefully and extract the correct number\nãƒ»Big Numbers Perception - recognise the corresponding numbers\nãƒ»Coordination System Test - localise on screen all objects in order to estimate the distances, headings and rotations\nãƒ»Matching forms - match the central forms according to the given rules\nãƒ»Landing Aircraft - guide the aircraft to the ground respecting the priority\nãƒ»Orientation into Space - improve your ability in handing a compass points and degrees\nãƒ»Algebra - simple calculations that have to be solved without the help of a scratch or calculator\nãƒ»Rounding - this test do not require the exact solution but rather to make a quick estimation\nãƒ»Arithmetic Problems - improve your mental math calculation abilities without the help of a scratch or calculator\nãƒ»Physics Problems - velocity and speed always seems to be a major source of confusion\n\nIn order to help you raise your potential, we have designed the application so you can select the desired number of questions, from 20, to 40 and finally 60.\nOne particular test is Matching forms, which contains 150 questions.\n\nWhat is special about this app, is the Statistics section, which will help you keep track on the scores obtained for every test.\n\nPay attention to the News section in order to be updated with all the news that will appear regarding FEAST Test App and other ATC specific information.\n\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.apperio.feasttesttraining&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.apperio.feasttesttraining&lt;/a&gt;","torrent":{"xt":"urn:btih:02015a1449600117891698a3cc52f51fba3f8f9e","amp;dn":"Apperio+FEAST+Test+Training","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02015a1449600117891698a3cc52f51fba3f8f9e","infoHashBuffer":{"type":"Buffer","data":[2,1,90,20,73,96,1,23,137,22,152,163,204,82,245,31,186,63,143,158]},"announce":[],"urlList":[]}}