{"title":"MILFs Like It Black 3 (2011)","uid":6512599,"size":2200832000,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0229bb6fd87eb14a6aa31e87a9c4f9cb2cd12ac4&amp;dn=MILFs+Like+It+Black+3+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":3,"time":1309652380,"description":"MILFs Like It Black 3 (2011)\n &lt;a href=&quot;\nhttp://www.excaliburfilms.com/AdultDVD/3000793D3_MILFs_Like_It_Black_3_dvd.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.excaliburfilms.com/AdultDVD/3000793D3_MILFs_Like_It_Black_3_dvd.htm&lt;/a&gt;\n\nStudio  Mofos \nRelease Date  Jun 28, 2011 \nCategory  All Sex, Interracial, Older, MILF / Cougar \nStarring  Roxanne Hall, Raquel Devine, Kendra Secrets, Blake Rose, Kasey Grant, Mahina Zaltana \n\nSeason 1: Episodes 13-18\n\nLonely Moms Getting Pounded By Monster Black Cock!\n\n#1 Male Escort Agency For MILFS Who Love Black Cock!\n\nEpisode 13: Kendra Secrets - We got a nice surprise this week by the US Census Bureau when ...    Full Descriptionone of their reps came by to ask us a few questions. D was out and Bugsy had to step in and take care of the situation.\n\nEpisode 14: Blake Rose - We got a call for a 'gentlemanly' MLB escort. Unfortunately, we haven't had any one of those around here before so we called in an expert to help our boy Julius. Our MILF client didn't get much for manners, but did get a cock full.\n\nEpisode 15: Roxanne Hall - We pay a visit to this crazy ass MILF who just wants to whip our asses! Roxanne is one of those dominating bitches who likes to bark orders at homies! Julius will have to be the one to tame her down!\n\nEpisode 16: Kasey Grant - As it happened, we ran out of kinky shit for our clients. We decided to go to the sex shop today and stock up! Not only a good place for products, but as today proved, it's also good for clients.\n\nEpisode 17: Mahina Zaltana - Mahina, round two! That's right, this week DT aka Greedy takes a stab at her and brings it home! Well, maybe not the money but a banging resort at least. As always Greedy flipped and fucked that bitch six ways from Sunday.\n\nEpisode 18: Raquel Devine - You would not believe the clients that walk through our door sometimes. Well, this week we've got one real crazy MILF. Not only does she want to clean our house, but she wants to do it while stripping!\n","torrent":{"xt":"urn:btih:0229bb6fd87eb14a6aa31e87a9c4f9cb2cd12ac4","amp;dn":"MILFs+Like+It+Black+3+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0229bb6fd87eb14a6aa31e87a9c4f9cb2cd12ac4","infoHashBuffer":{"type":"Buffer","data":[2,41,187,111,216,126,177,74,106,163,30,135,169,196,249,203,44,209,42,196]},"announce":[],"urlList":[]}}