{"title":"My Fair Lady - 1964 (Full DVD-PAL)","uid":3707093,"size":7813441634,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0272403559b9c34b79a6fa33e032831be9c924c4&amp;dn=My+Fair+Lady+-+1964+%28Full+DVD-PAL%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"honda93","files":18,"time":1181150833,"description":"ORIGINAL TITLE: My Fair Lady \nYEAR: 1964   \n \nRUNNING TIME: 170 min. \nCOUNTRY: USA \nDIRECTOR: George Cukor \nSCREENWRITER: Alan Jay Lerner (Play: Bernard Shaw) \nCOMPOSER: Frederick Loewe \nCINEMATOGRAPHER: Harry Stradling \nCAST: Audrey Hepburn, Rex Harrison, Stanley Holloway, Wilfrid Hyde-White, Gladys Cooper, Jeremy Brett, Theodore Bikel \nSTUDIO/PRODUCER: Warner Bros. Producer: Jack L. Warner \nGENRE: Musical \n\nGloriously witty adaptation of the Broadway musical about Professor Henry Higgins, who takes a bet from Colonel Pickering that he can transform unrefined, dirty Cockney flower girl Eliza Doolittle into a lady, and fool everyone into thinking she really is one, too! He does, and thus young aristocrat Freddy Eynsford-Hill falls madly in love with her. But when Higgins takes all the credit and forgets to acknowledge her efforts, Eliza angrily leaves him for Freddy, and suddenly Higgins realizes he&amp;#039;s grown accustomed to her face and can&amp;#039;t really live without it. Written by Tommy Peter \n\nA chance meeting between two noted British linguists, Prof. Henry Higgins and Col. Hugh Pickering, leads to a wager that will test Higgins&amp;#039; skills. After they hear a cockney flower girl caterwaul in the street, Higgins proposes to transform the girl, Eliza Doolittle, into a refined Victorian lady with an aristocratic accent. After some hesitation Eliza agrees to become their test case. Written by alfiehitchie \n\nFull DVD9\n16:9 - PAL\nDDigital 5.1: English DD 2.0 English DD Mono German and spanish.\nSubs.: English, german, spanish, dutch, swedish, norwegian, danish, finnish, portuguese, hebrew, polish, greek, czech, turkish, hungarian, icelandic, croatian, french, italian.","torrent":{"xt":"urn:btih:0272403559b9c34b79a6fa33e032831be9c924c4","amp;dn":"My+Fair+Lady+-+1964+%28Full+DVD-PAL%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0272403559b9c34b79a6fa33e032831be9c924c4","infoHashBuffer":{"type":"Buffer","data":[2,114,64,53,89,185,195,75,121,166,250,51,224,50,131,27,233,201,36,196]},"announce":[],"urlList":[]}}