{"title":"TTC - Rome and the Barbarians","uid":3374812,"size":591294975,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:02b2a26f804e0db23960f94c04d505b739f5aaaf&amp;dn=TTC+-+Rome+and+the+Barbarians&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wildcatwillie","files":43,"time":1125012305,"description":"TTC - Rome and the Barbarians (new seed)\n\nFor those of you stuck at 87.4% or 87.5% in the other similar torrent download you can fix your current download by following the steps below:\n\n1. Download this torrent file and start the download. Be sure to save this new download to a new folder and not the old &quot;Rome and the Barbarians&quot; folder that is stuck. \n\n2. Let the new torrent download run for a few seconds. Then stop the download.\n\n3. Remove the torrent from the active download list. DO NOT DELETE the torrent or the data files.\n\n4. Open your old &quot;Rome and the Barbarians&quot; folder, and COPY just the following type files:\n\n    MP3\n    JPG\n    PDF\n\n5.  Paste the copied files from the old folder with the stuck torrent to the new torrent &quot;TTC - Rome and the Barbarians&quot; folder. Overwrite the files in the new folder.\n\n6. Reload the new &quot;TTC - Rome and the Barbarians&quot; torrent file to your bit torrent client program. The client program should now check all the copied files and will be ready to download when you connect.\n\nNOTE: Because the files stored in your old download cache won't be copied you'll lose about 10% of the download of the stuck torrent. You should start without problems at about 75% complete. \n\nI followed these steps and managed to complete the stuck download after waiting a week for someone to start seeding again. I managed to find a new active torrent of the same files (except for the text files). Not wanting to start all over I came up with the above proceedure and it worked for me.","torrent":{"xt":"urn:btih:02b2a26f804e0db23960f94c04d505b739f5aaaf","amp;dn":"TTC+-+Rome+and+the+Barbarians","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02b2a26f804e0db23960f94c04d505b739f5aaaf","infoHashBuffer":{"type":"Buffer","data":[2,178,162,111,128,78,13,178,57,96,249,76,4,213,5,183,57,245,170,175]},"announce":[],"urlList":[]}}