{"title":"JS 01.WHERE THE BODIES ARE BURIED.Chris Brookmyre.mb4","uid":8719064,"size":320739518,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0400998479a6821716a56f2821f97cdb7b20fdb4&amp;dn=JS+01.WHERE+THE+BODIES+ARE+BURIED.Chris+Brookmyre.mb4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BosuxRedsux","files":1,"time":1374385234,"description":"same size as original file,chapterized\n\nBook 1 in the Jasmine Sharp series, book 2 to follow in a day or 2\n\nDetective Catherine McLeod was always taught that in Glasgow, they don't do whodunit. They do score-settling. They do vendettas. They do petty revenge. They do can't-miss-whodunit. It's a lesson that has served her well, but Glasgow is also a dangerous place to make assumptions. Either way she looks at it, she recognises that the discovery of a dead drug-dealer in a back alley is merely a portent of further deaths to come. Elsewhere in the city, aspiring actress Jasmine Sharp is reluctantly - and incompetently - earning a crust working for her uncle Jim's private investigation business. When Jim goes missing, Jasmine has to take on the investigator mantle for real, and her only lead points to Glen Fallan, a gangland enforcer and professional assassin whose reputation is rendered only slightly less terrifying by having been dead for twenty years. Cautiously tracing an accomplished killer's footsteps, Jasmine stumbles into a web of corruption and decades-hidden secrets that could tear apart an entire police force - if she can stay alive long enough to tell the tale. ","torrent":{"xt":"urn:btih:0400998479a6821716a56f2821f97cdb7b20fdb4","amp;dn":"JS+01.WHERE+THE+BODIES+ARE+BURIED.Chris+Brookmyre.mb4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0400998479a6821716a56f2821f97cdb7b20fdb4","infoHashBuffer":{"type":"Buffer","data":[4,0,153,132,121,166,130,23,22,165,111,40,33,249,124,219,123,32,253,180]},"announce":[],"urlList":[]}}