{"title":"Robert McCammon - The Wolf's Hour - Unb","uid":4717275,"size":353452435,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:04baed0ed1956ad7a283b3de971dc3d4e49473ab&amp;dn=Robert+McCammon+-+The+Wolf%5C%27s+Hour+-+Unb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"RamJamSam","files":18,"time":1234345925,"description":"Robert McCammon - The Wolf's Hour - Unb\nRead by: Ted Stoddard\nRuntime: 24 Hours and 32 Minutes\n\n\n\n\n\nIntroduction\n\nIn 1989 I won the Bram Stoker Award for best Horror Novel, Robert was \nnominated for Best Novel also that same year, Yes I won and Robert didn't\nbut having read Robert's incredible book The Wolf's Hour, maybe they \nshould have just awarded a tie? \n(Dan Simmons)\n\n\nAbout the Book:\n\nAnd then the clouds were coming after him, about to engulf him. He ran, \nbut he couldn't run fast enough. Faster. Faster. The storm roaring on his \nheels. Faster. His heart, pounding. A banshee scream in his ears. \nFaster.... And a change exploded in him. Dark hairs burst from his hands \nand arms. He felt his spine contort, bowing his shoulders. \nHis hands---no longer hands---touched the earth. He ran faster, his body \nwhipsawing, and he began to rip from his clothes....&quot; \n\nIt is 1944. A message from Paris warns Allied Intelligence of something \nbig in the works---something which might have serious implications for \nD-Day. The only way to get more information from the agent in \nParis---now closely watched by the Gestapo---is to send in a personal \ncourier. \n\nRussian ÃƒÂ©migrÃƒÂ© Michael Gallatin is picked for the job. In retirement as \na secret agent since a grisly episode in North Africa, Gallatin is \nparachuted into occupied France, on a mission which will take him to the \nfestering heart of the Third Reich on the scent of doomsday. \n\nAs a master spy, Gallatin has proved he can take on formidable foes---and \nkill them. As a passionate lover, he attracts beautiful women. But there \nis one extra factor which makes Michael Gallatin a unique special agent---he is a werewolf, able to change form almost at will, able to assume the body of a wolf and its capacity to kill with savage, snarling fury. \n\nIn the madness of war, Gallatin hunts his prey---ready to out-think his \nopponents with his finely-tuned brain. Or tear their throats out with his finely-honed teeth.... \n\nThe Wolf's Hour is a novel by Robert McCammon---master of horror \nfiction---which breaks the mold of the werewolf novel. It is a \nremarkable tale of pulse-pounding excitement and a fascinating, complex, \nand compelling portrayal of the werewolf as noble warrior and \nconflict-torn being. \n\n\n\n\n\nGooD SeeDinG!\n\n","torrent":{"xt":"urn:btih:04baed0ed1956ad7a283b3de971dc3d4e49473ab","amp;dn":"Robert+McCammon+-+The+Wolf%5C%27s+Hour+-+Unb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04baed0ed1956ad7a283b3de971dc3d4e49473ab","infoHashBuffer":{"type":"Buffer","data":[4,186,237,14,209,149,106,215,162,131,179,222,151,29,195,212,228,148,115,171]},"announce":[],"urlList":[]}}