{"title":"Max Strom -  Breathe","uid":14886870,"size":522115495,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:05390d1b569e8e384f86ac3458ae49679d048334&amp;dn=Max+Strom+-++Breathe&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"acer47x","files":2,"time":1465741044,"description":"Breath penetrates, breath invigorates, and breath heals.\r\n\r\nIntroducing the highly anticipated DVD, Learn to Breathe, to Heal Yourself and Your Relationships, from internationally renowned yoga teacher, Max Strom.\r\nIn this DVD you will learn and integrate breathing exercises and gentle movement, the effect of these can lead to profound inner calm, enhanced energy, \r\nand mental clarity. Other benefits may include an increased ability to give up addictions, such as smoking. Once people have experienced the power of \r\ntheir own breath, they understand why it is called life force.\r\n\r\nMax Strom is known for inspiring and impacting the lives of his students and has become one of the most revered and\r\nrespected Yoga Teachers in the US and abroad. Founder of Sacred Movements, Center for Yoga and Healing in Los Angeles, \r\nhe now travels worldwide teaching and lecturing on breathing, yoga, and personal transformation.\r\n\r\nThis home practice DVD takes the student through Max's signature Learn to Breathe workshop. It is extremely practical and easy to understand\r\nand requires no background in yoga to receive the full benefits. Max speaks on how the breath affects us in the context of our mind, our body, \r\nand especially our emotions. Several simple but meaningful exercises are offered with clear and safe directions.\r\n\r\n&quot;This practice is for everyone; every nationality, gender, religion and age, even those in wheelchairs. \r\nThis DVD is for anyone who wants to improve the quality of their health, vitality, and relationships.&quot; - Max Strom","torrent":{"xt":"urn:btih:05390d1b569e8e384f86ac3458ae49679d048334","amp;dn":"Max+Strom+-++Breathe","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05390d1b569e8e384f86ac3458ae49679d048334","infoHashBuffer":{"type":"Buffer","data":[5,57,13,27,86,158,142,56,79,134,172,52,88,174,73,103,157,4,131,52]},"announce":[],"urlList":[]}}