{"title":"ceo - Wonderland (2014) [FLAC]","uid":9570010,"size":236912721,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:054e1ef0d5f36b5e27e94f948a1357ed12a84027&amp;dn=ceo+-+Wonderland+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1391611906,"description":"\n  ceo - Wonderland (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative Dance, Indie Electronic\n  Source: WEB\n  Codec: FLAC\n  Bitrate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Whorehouse \n  02 Harikiri \n  03 Mirage \n  04 In a Bubble on a Stream \n  05 Wonderland \n  06 Juju \n  07 Ultrakaos \n  08 OMG  \n\n  Wonderland, the second album from ceo, Eric Berglund of the Tough Alliance's solo project, represents no forward progress from 2011's excellent White Magic and heralds no great changes to the sound or outlook. Which is fine, because nothing needed to be changed. At all. The lushly beautiful, inventive, and rich arrangements were pretty much perfect before and remain as such. The odd samples that buttress, and sometimes gleefully puncture, the sound are out in full force. Berglund's melodies still reach for the heavens, arrive there, and then stretch out for a long stay. Basically, Wonderland is like White Magic II with a little tightening here and slightly more precision there to make it hit even harder. Some of this focus might be due to the presence of co-producer Dan Lissvik, formerly of fellow Swedes Studio, or maybe it's the songs. \n\n  Berglund's melodies are just a bit hookier this time, the swooping synths just a little brighter, and the overall effect a tiny touch shinier and slick. Even though his lyrical concerns are just as unique as on White Magic -- check out first single &quot;Whorehouse&quot; -- and there's a undercurrent of sugary creepiness that runs just below the surface of many of the songs, there's no doubt the entire album would sound great pumping out of the speakers in a high-end clothing retailer. It wouldn't offend anyone and the sounds are warm and enveloping enough that you'd want to stay and shop until the album was over. Wonderland sets and maintains a slowly unfolding, thoroughly involving mood that's easy to fall into thanks to the combination of honey-dipped melodies, Berglund's open-hearted vocals, twinkling synths, and gently rumbling beats. With Tough Alliance, Berglund helped to invent this sound; with ceo he's perfecting it and this is his best work yet. Whether you're shopping, working, falling in love, or drifting along aimlessly, it's a perfect soundtrack for a warm daydream full of light and wonder.","torrent":{"xt":"urn:btih:054e1ef0d5f36b5e27e94f948a1357ed12a84027","amp;dn":"ceo+-+Wonderland+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"054e1ef0d5f36b5e27e94f948a1357ed12a84027","infoHashBuffer":{"type":"Buffer","data":[5,78,30,240,213,243,107,94,39,233,79,148,138,19,87,237,18,168,64,39]},"announce":[],"urlList":[]}}