{"title":"[TSSeduction] Vaniity , Beretta and Tyler Woods (20.11.13) 720p","uid":9226202,"size":1408319477,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:05791002e8f1d5d72330f608b00f0ae638bc2fe5&amp;dn=%5BTSSeduction%5D+Vaniity+%2C+Beretta+and+Tyler+Woods+%2820.11.13%29+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1385010948,"description":"A Classic Three's Company Mix-up Porn\nBeretta is in the middle of her FuckingMachines shoot when her jealous boyfriend bursts on to set. Everyone is ready to punch this guy out of the building but Beretta manages to calm everyone down and get her man, quietly off set. She makes him wait in the set next door until she is done.\nThe only problem is the now pissed off boyfriend is fuming. When Vaniity walks in and mistakes him for her scene partner, he plays along thinking he might as well get his cock sucked a little since his girlfriend will not listen to him and quit porn.\nSmall problem with this horny logic. Vaniity thinks he is her scene partner which means an ass fucking for him with her big cock. Wha?\n\nBeretta walks in at the perfect moment to see her man loving a little head from Vaniity and she gets the rope.\n\nNow Tyler is tied to the bed and his girlfriend is pissed and the hot stranger lady is rubbing her throbbing cock between his ass cheeks looking from the tight virgin hole to fuck. So tight his hole, his man pussy is just puckered shut until Vaniity slips her cock deep inside him and works him open.\n\nBeretta is LOVING this moment, she crushes him into the mattress and lets Vaniity fuck her pussy and ass while he lays there listening and feeling nothing but the weight of humiliation on his back..\n\nVaniity drills both of them until she cums in their mouths. But the best fucking happens after Beretta has jerked his cock free of his load while Vaniity gently fucks his ass - but wait for it - when he pops - she rams him so fast and hard she's a blur of fucking and Beretta tightens her grip on his cock for total sensory overload of a worn out ass and post-cum cock. Epic fucking and a great pairing of hot, sexy people who like to fuck every which way to Sunday. This is another top quality feature shoot from the greatest TS site on the web.\n\nDuration: 00:38:35\nVideo: AVC (AVC) 1280x720 29.97fps 4731kbps\nAudio: AAC (AAC LC) 128 kb/s 44.1KHz (2 chnls)\n\nScreens:\n======== &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=02852824283758814789.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=02852824283758814789.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=35792019953871703392.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=35792019953871703392.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:05791002e8f1d5d72330f608b00f0ae638bc2fe5","amp;dn":"%5BTSSeduction%5D+Vaniity+%2C+Beretta+and+Tyler+Woods+%2820.11.13%29+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05791002e8f1d5d72330f608b00f0ae638bc2fe5","infoHashBuffer":{"type":"Buffer","data":[5,121,16,2,232,241,213,215,35,48,246,8,176,15,10,230,56,188,47,229]},"announce":[],"urlList":[]}}