{"title":"SHAREGO EBOOK  Harry Potter - The Tales Of Beedle The Bard","uid":4700116,"size":7684114,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05e244bc849a65e6e38aadd6e716a3b260e14766&amp;dn=SHAREGO+EBOOK++Harry+Potter+-+The+Tales+Of+Beedle+The+Bard&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dodgerblue","files":2,"time":1233690160,"description":"SHAREGO EBOOK  Harry Potter - The Tales Of Beedle The Bard\nHarry Potter - The Tales Of Beedle The Bard\nIn December 2007, J.K. Rowling unveiled The Tales of Beedle the Bard, a very special book of five fairy tales illustrated by the bard herself, embellished with silver ornaments and mounted moonstones. Amazon was fortunate to come into possession of one of the original copies, and it was our privilege to share images and reviews of this incredible artifact. Now J.K. Rowling is giving millions of Harry Potter fans worldwide cause for celebration with a new edition of The Tales of Beedle the Bard, available December 4, 2008.\n\n&quot;The Tales Of Beedle The Bard&quot; is a collection of stories written for young wizards and witches.\n1. The Wizard and the Hopping Pot\n2. The Fountain of Fair Fortune\n3. The Warlock's Hairy Heart\n4. Babbitty Rabbitty and Her Cackling Stump\n5. The Tale of the Three Brothers\n\nOffering the trademark wit and imagination familiar to Rowling's legions of readers--as well as Aesop's wisdom and the occasional darkness of the Brothers Grimm--each of these five tales reveals a lesson befitting children and parents alike: the strength gained with a trusted friendship, the redemptive power of love, and the true magic that exists in the hearts of all of us. Rowling's new introduction also comments on the personal lessons she has taken from the Tales, noting that the characters in Beedle's collection &quot;take their fates into their own hands, rather than taking a prolonged nap or waiting for someone to return a lost shoe,&quot; and &quot;that magic causes as much trouble as it cures.&quot;\n\nBut the true jewel of this new edition is the enlightening and comprehensive commentary (including extensive footnotes!) by Professor Albus Percival Wulfric Brian Dumbledore, who brings his unique wizard's-eye perspective to the collection. Discovered &quot;among the many papers which Dumbledore left in his will to the Hogwarts Archives,&quot; the venerable wizard's ruminations on the Tales allow today's readers to place them in the context of 16th century Muggle society, even allowing that &quot;Beedle was somewhat out of step with his times in preaching a message of brotherly love for Muggles&quot; during the era of witch hunts that would eventually drive the wizarding community into self-imposed exile. In fact, versions of the same stories told in wizarding households would shock many for their uncharitable treatment of their Muggle characters.\n\nProfessor Dumbledore also includes fascinating historical backstory, including tidbits such as the history and pursuit of magic wands, a brief comment on the Dark Arts and its practitioners, and the struggles with censorship that eventually led &quot;a certain Beatrix Bloxam&quot; to cleanse the Tales of &quot;much of the darker themes that she found distasteful,&quot; forever altering the meaning of the stories for their Muggle audience. Dumbledore also allows us a glimpse of his personal relationship to the Tales, remarking that it was through &quot;Babbity Rabbity and Her Cackling Stump&quot; that &quot;many of us [wizards] first discovered that magic could not bring back the dead.&quot;\n\nBoth a wise and delightful addition to the Harry Potter canon, this new translation of The Tales of Beedle the Bard is all that fans could hope for and more--and an essential volume for the libraries of Muggles, wizards, and witches, both young and old.\n[img]http://1337x.org/torrentimg-11591.png[/img]","torrent":{"xt":"urn:btih:05e244bc849a65e6e38aadd6e716a3b260e14766","amp;dn":"SHAREGO+EBOOK++Harry+Potter+-+The+Tales+Of+Beedle+The+Bard","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05e244bc849a65e6e38aadd6e716a3b260e14766","infoHashBuffer":{"type":"Buffer","data":[5,226,68,188,132,154,101,230,227,138,173,214,231,22,163,178,96,225,71,102]},"announce":[],"urlList":[]}}