{"title":"Cassandra Clare - Città del fuoco celeste [Pdf","uid":12772828,"size":3836933,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:06854d83b9cf1f2d9623b5e1f5b96547ef49e134&amp;dn=Cassandra+Clare+-+Citt%26agrave%3B+del+fuoco+celeste+%5BPdf+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vitolanz","files":1,"time":1447701249,"description":"Cassandra Clare - Shadowhunters - Città del fuoco celeste [Pdf - Ita][TNTVillage]\r\n--------------------------------------------------------------------------------\r\n\r\n.: Dettagli :.\r\n\r\nAutore: Cassandra Clare\r\nTitolo: Città del fuoco celeste \r\nAnno: 2014\r\nLingua: Italiana\r\nGenere: Romanzo\r\nDimensione del file: 3,65MB\r\nFormato del file: PDF \r\n--------------------------------------------------------------------------------\r\n\r\n.: Trama :.\r\n\r\nErchomai, ha detto Sebastian. Sto arrivando. E ancora una volta sul mondo degli Shadowhunters cala l’oscurità. Mentre tutto intorno a loro cade a pezzi, Clary, Jace e Simon devono unirsi con tutti quelli che stanno dalla stessa parte, per combattere il più grande pericolo che la società dei Nephilim abbia mai affrontato: Sebastian, il fratello di Clary. Il traditore, colui che ha scelto il male. Nulla, in questo mondo, può sconfiggerlo, e i tre, uniti da un legame profondo e indissolubile, sono costretti a cercare un altro mondo dove l’estremo scontro abbia una speranza di vittoria. Il mondo dei demoni. Ma il prezzo da pagare sarà altissimo. Molte vite saranno perdute per sempre, e l’amore sarà sacrificato per un bene più grande: scongiurare la distruzione definitiva di un mondo che non sarà mai più lo stesso. Perché la fine degli Shadowhunters è anche il loro inizio\r\n--------------------------------------------------------------------------------\r\n\r\n.: Biografia dell'autore :.\r\n\r\nCassandra Clare, nome d'arte di Judith Rumelt (Teheran, 27 luglio 1973), è una scrittrice statunitense, autrice di romanzi fantasy, nota per i libri che raccontano le avventure degli Shadowhunters, cacciatori di demoni.\r\nNata a Teheran (Iran) da genitori statunitensi trascorse la maggior parte della propria infanzia viaggiando per il mondo con la sua famiglia, inclusa una gita da bambina attraverso l'Himalaya, dove passò un mese praticamente vivendo nello zaino del padre. Visse in Francia, Inghilterra e Svizzera prima dei dieci anni. Stabilitasi negli USA, a Los Angeles, completò qui gli studi presso la Windward School e lavorò come giornalista dividendosi tra la California e New York in vari giornali e tabloid di spettacolo come &quot;The Hollywood Reporter&quot;.\r\nNel 2004, Cassandra Clare comincia a lavorare al primo libro della saga Shadowhunters, Shadowhunters - Città di ossa (City of Bones), ispirato dal paesaggio urbano di Manhattan. In America viene pubblicato da Simon &amp; Schuster nel 2007 e nello stesso anno dalla Mondadori in Italia. Shadowhunters - Città di ossa, un fantasy contemporaneo rotante attorno ai personaggi Clary Fray, Jace Wayland e Simon Lewis, diventa un New York Times bestseller appena uscito. Shadowhunters - Città di cenere e Shadowhunters - Città di vetro completarono la trilogia. Il quarto libro, Shadowhunters - Città degli angeli caduti, è stato pubblicato il 5 aprile 2011 e segna l'inizio del secondo ciclo degli Shadowhunters, che include altri due libri dal titolo Shadowhunters - Città delle anime perdute e Shadowhunters - Città del fuoco celeste.\r\nNel 2009 la Clare annuncia una nuova serie di preludio chiamata Shadowhunters - Le origini (The Infernal Devices), posta nello stesso universo di Shadowhunters, ma nell'epoca vittoriana. Questa serie è formata da tre libri: L'angelo (Clockwork Angel), pubblicato negli USA il 31 agosto 2010 e in Italia il 7 giugno 2011; Il principe (Clockwork Prince), pubblicato negli USA il 6 dicembre 2011 e in Italia il 5 giugno 2012, e La principessa (Clockwork Princess), pubblicato negli USA il 19 marzo 2013 e in Italia 23 luglio 2013 .[3]\r\nEntrambe le serie sono state tradotte in numerose lingue, tra cui tedesco, francese, spagnolo, portoghese, polacco, ceco, finlandese, danese, catalano e turco. La Costantin Film ha inoltre acquistato i diritti d'autore di tutti i libri pubblicati: il primo film Shadowhunters - Città di ossa, diretto da Harald Zwart, è uscito nell'agosto 2013, con protagonisti Lily Collins nel ruolo di Clary Fray, Jamie Campbell Bower nel ruolo di Jace Wayland e Jonathan Rhys-Meyers nel ruolo Valentine Morgenstern. La casa di produzione aveva in cantiere dei sequel, ma lo scarso successo ottenuto dal primo film ne ha bloccato la produzione; il tutto è ripartito a ottobre 2014, quando la Constantin Film ha annunciato la trasposizione dei romanzi in una serie televisiva, intitolata Shadowhunters - The Mortal Instruments, che inizierà a essere prodotta a giugno 2015 e sarà trasmessa dall'emittente ABC a partire da gennaio 2016","torrent":{"xt":"urn:btih:06854d83b9cf1f2d9623b5e1f5b96547ef49e134","amp;dn":"Cassandra+Clare+-+Citt%26agrave%3B+del+fuoco+celeste+%5BPdf+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06854d83b9cf1f2d9623b5e1f5b96547ef49e134","infoHashBuffer":{"type":"Buffer","data":[6,133,77,131,185,207,31,45,150,35,181,225,245,185,101,71,239,73,225,52]},"announce":[],"urlList":[]}}