{"title":"Frankenstein (Toei, 1981), [H264 - Ita Jap Ac3] DVDrip","uid":13157590,"size":1947541683,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:06883df7f47f5f11a17016465410818aec0af3b8&amp;dn=+Frankenstein+%28Toei%2C+1981%29%2C+%5BH264+-+Ita+Jap+Ac3%5D+DVDrip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"foll01","files":1,"time":1452116999,"description":"TRAMA\r\n\r\nSvizzera, fine del Diciannovesimo Secolo. Il dottor Victor Frankenstein, con la complicità del suo assistente Zuckel, crea un essere mostruoso composto di pezzi di cadaveri dissotterrati dai cimiteri, e gli dà vita servendosi di una sofisticata apparecchiatura che sfrutta l'energia elettrica dei fulmini. Il mostro, tuttavia, dopo essere stato svegliato, ha una reazione molto violenta, e Victor, spaventato, incarica Zuckel di uccidere la creatura. L'assistente del dottore viene ferito a un occhio dal mostro, ma riesce a farlo precipitare da una rupe a colpi di pistola. Supponendo che il mostro sia morto, Victor torna dalla moglie Elizabeth e dalla figlia Emily, senza tuttavia rivelar loro nulla degli esperimenti che lo hanno condotto a dar vita alla creatura. Nel frattempo un ispettore di polizia di nome Bellbeau indaga su alcuni misteriosi omicidi , e Victor viene ricattato dal suo ex assistente che, desideroso di vendetta nei suoi confronti per aver rischiato la vita ed essere stato ferito dall'essere, gli chiede una grande quantità di soldi in cambio del suo silenzio sugli esperimenti che lo hanno portato alla creazione del mostro. Nei giorni a venire si susseguono fatti sempre più misteriosi, e Victor diventa sempre più paranoico, sino ad avere incubi terrificanti sulla sua creatura, che ormai considera l'incarnazione del Male puro. L'essere è difatti sopravvissuto alla caduta, si è recato nel paese dove vivevano il dottore e la sua famiglia, rubando del cibo e degli abiti, uccidendo alcuni paesani e spiando Victor e la sua famiglia. Nel frattempo Zuckel, imbattutosi nel mostro, viene da lui brutalmente ucciso sotto gli occhi di Victor che, recatosi sul posto per incontrare il suo ex-assistente, ha ormai la conferma che la sua creatura è sopravvissuta alla caduta nel burrone adiacente al laboratorio in cui le diedero vita. La figlia di Victor, Emily, passa gran parte del suo tempo con il nonno, un uomo cieco e molto saggio, che ha sempre avvertito il figlio Victor della pericolosità dei suoi esperimenti. I due avranno modo di conoscere il mostro, dopo che esso salva Emily uccidendo un feroce orso che la stava per attaccare. Il mostro trova poi rifugio nella capanna del nonno, e il vecchio ed Emily instaureranno un rapporto di amicizia con l'essere: perché in realtà, il mostro non è affatto malvagio, ma profondamente solo e desideroso di essere amato, e l'unico motivo del perché aveva compiuto degli omicidi era per difendersi da coloro che volevano fargli del male. Emily e il nonno gli daranno il nome di Franken (poiché il mostro non faceva che ripetere insistentemente il nome del suo creatore). Intenzionato a far sparire qualsiasi prova dei suoi esperimenti, Victor si mette a caccia del mostro per ucciderlo, senza immaginare che suo padre e sua figlia, ormai amici del mostro, passano del tempo con lui giocando, insegnandogli a cucinare e perfino la preghiera e la conoscenza di Dio. Giorni dopo la polizia, intenzionata a stanare Franken, appicca un incendio nei boschi, e purtroppo la madre di Emily rimane uccisa, senza che Franken, impegnato a salvare la vita al nonno di Emily e stordito dai fumi del legno bruciato, riesca a fare nulla per aiutarla. Phillip, un giovanotto amico di Emily, spaventato dal mostro e convinto che abbia ucciso la donna, lo affronta armato di pistola, ma viene accidentalmente ucciso da Franken che, cercando di difendersi, lo colpisce mandandolo a sbattere contro un muro. Emily, sconvolta, e convinta che Franken sia malvagio e abbia ucciso di proposito sua madre e il suo amico, accusa Franken di essere solo un mostro, raccoglie la pistola e gli spara, trapassando da una parte all'altra il palmo della sua mano sinistra. Ferito ancora una volta nel fisico e nei sentimenti, Franken si ritrova di nuovo a vagare da solo per il villaggio. Egli cerca rifugio in una chiesa, dove, ricordando le lezioni fattegli da Emily su Dio e la preghiera, si inginocchia davanti al crocifisso e, osservando come Cristo abbia le mani trafitte come la sua, scoppia in lacrime e prega Dio. In quel momento Victor, convinto che la sua creazione abbia ucciso sua moglie irrompe nella chiesa e tenta di sparargli con il suo fucile, ma Franken riesce a sfuggirgli. Nel frattempo il nonno di Emily rivela alla nipotina che Franken è una creazione di suo padre, e riesce a convincerla che Franken non è un essere cattivo, non ha ucciso sua madre, e che era riuscito ad impedire almeno a lui di perire tra le fiamme dell'incendio, così come non aveva intenzione di uccidere Phillip, e la bambina, pentita, decide di andarlo a cercare. Intanto, sulle montagne, l'ispettore Bellbeau e la sua forza di polizia hanno accerchiato Franken e, coadiuvati da Victor, hanno aperto il fuoco su di lui, ferendolo gravemente. Emily viene in suo soccorso abbracciandolo e chiedendogli perdono per avergli fatto del male, e per la prima volta, Franken pronuncia il suo nome correttamente (fino ad all'ora la aveva sempre chiamata &quot;Emilu&quot;). Stanco di una vita che non ha mai voluto, di essere inseguito, cacciato e considerato un pericolo, Franken si suicida gettandosi da un burrone, non prima di aver detto addio alla piccola Emily. Victor, reso folle da tutto il terrore che ha causato, comprendendo di aver rovinato la vita a sua figlia e di come Franken fosse una creatura innocente e da lui condannata ad un'esistenza infernale, si suicida sparandosi al petto, e chiedendo perdono al mostro e a sua figlia. Al termine del film, l' ispettore Bellbeau, rattristato da quella straziante vicenda, porge i suoi omaggi a Franken, visitando la tomba che Emily ha preparato per lui.\r\n[Fonte Wikipedia] \r\n\r\nRELEASE ORIGINAL FOR MORE INFO\r\n \nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=483501","torrent":{"xt":"urn:btih:06883df7f47f5f11a17016465410818aec0af3b8","amp;dn":"+Frankenstein+%28Toei%2C+1981%29%2C+%5BH264+-+Ita+Jap+Ac3%5D+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06883df7f47f5f11a17016465410818aec0af3b8","infoHashBuffer":{"type":"Buffer","data":[6,136,61,247,244,127,95,17,161,112,22,70,84,16,129,138,236,10,243,184]},"announce":[],"urlList":[]}}