{"title":"Obsession Submission Part 1 Radical Islam's War Against T","uid":3642328,"size":800921868,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0745ccc6d08b6b7a73219705f1459c28a89ed420&amp;dn=Obsession+Submission+Part+1+Radical+Islam%5C%27s+War+Against+T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mike18xx","files":289,"time":1174297111,"description":"* Obsession - Radical Islam&amp;#039;s War Against The West, long version (2005, 60min) - Documentary film exploring the roots and ambitions of radical Islam, with particular attention paid to the parallels with Nazism comparing propaganda techniques and the indoctrination of children. Much footage from Arab media of mullahs preaching genocide, archives of the association of Adolf Hitler and the Grand Mufti, and interviews with former jihadists and a former SS camp commander, among much other stuff.\n\nXviD DVDrip in original screen-width; this is the &quot;long version&quot; (60 minutes, greatly abbreviated 12min and 30min versions exist); quality is virtually lossless given the less than &quot;feature length&quot; of the source, as well as the fact that most of the film consists of photography, television footage and interviews -- it could have been compressed to a much smaller size, but I wanted to create the best quality CD-rom sized version.\n\n* Submission, Part 1 [2004 xvid english, dutch sub, Theo van Gogh, Ayaan Hirsi Ali] - The frequently-banned provocative short film exposing the plight of women under Sharia, and which resulted in the murder of its director and a fatwa issued against the writer (who is a member of the Dutch parliament), and later led to the infamous &quot;Mohammed cartoon riots&quot; amid other agitations to curtail free-speech in Europe and elsewhere. 720 width XVID; English and some Arabic, with Dutch subtitles.\n\n* PDF etext Politically Incorrect Guide to Islam and the Crusades - Robert Spencer.\n\n* Assorted extras, articles, websites, and a link to VLC media player.\n\n* .torrent file was created with a large number of public trackers and with very tiny block sizes to enable easier trading by persons using modems, and to thwart &quot;cheating&quot; bittorrent clients (BitComet, et al).\n &lt;a href=&quot;\nhttp://hodja.wordpress.com/files/2006/04/poster.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://hodja.wordpress.com/files/2006/04/poster.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://images.barnesandnoble.com/images/10220000/10225384.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://images.barnesandnoble.com/images/10220000/10225384.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:0745ccc6d08b6b7a73219705f1459c28a89ed420","amp;dn":"Obsession+Submission+Part+1+Radical+Islam%5C%27s+War+Against+T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0745ccc6d08b6b7a73219705f1459c28a89ed420","infoHashBuffer":{"type":"Buffer","data":[7,69,204,198,208,139,107,122,115,33,151,5,241,69,156,40,168,158,212,32]},"announce":[],"urlList":[]}}