{"title":"Abraham Joshua Heschel - God in Search of Man (pdf)","uid":9250267,"size":4760691,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:078fb8bfc9fcbfcbff9a722fc0059d5e91b55fc9&amp;dn=Abraham+Joshua+Heschel+-+God+in+Search+of+Man+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1385451917,"description":"Abraham Joshua Heschel - God in Search of Man: A Philosophy of Judaism (Harper, 1955). 437 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\ndescription:\n\n\nGod in Search of Man: A Philosophy of Judaism is among Abraham Joshua Heschel's most comprehensive studies of the Jewish religion. It is a work of impeccable scholarship conveyed with absolute clarity, in a spirit of utmost reverence and compassion. &quot;Religion is an answer to man's ultimate questions,&quot; Heschel declares on the book's first page. Religion that forgets its roots in humanity's lived experience, religion that inadequately addresses the earthly realities of life, Heschel says, is false religion. And yet, Heschel asserts that religion is not a vehicle by which humanity draws closer to God; it is always God who reaches out to humanity through religion. &quot;Judaism is God's quest for man. The Bible is a record of God's approach to His people. More statements are found in the Bible about God's love for Israel than about Israel's love for God.&quot;\n\nGod in Search of Man is almost as exhausting as it is exhaustive. Detailed analyses of &quot;Awe,&quot; &quot;Wonder,&quot; and &quot;Glory&quot; stand alongside discourses on religion and time, the nature of prophesy, and the problem of evil. Heschel's encyclopedic knowledge of and omnivorous interest in the nature of Judaism is, for most readers, more productively taken in small doses than swallowed whole. The book's table of contents, however, will get a considerable workout over the years, as readers return again and again to find Heschel's opinions about various aspects of spiritual life.\n\n----\n\nMore Heschel:\n &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/8517171&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/8517171&lt;/a&gt;\n &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/8249918&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/8249918&lt;/a&gt;","torrent":{"xt":"urn:btih:078fb8bfc9fcbfcbff9a722fc0059d5e91b55fc9","amp;dn":"Abraham+Joshua+Heschel+-+God+in+Search+of+Man+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"078fb8bfc9fcbfcbff9a722fc0059d5e91b55fc9","infoHashBuffer":{"type":"Buffer","data":[7,143,184,191,201,252,191,203,255,154,114,47,192,5,157,94,145,181,95,201]},"announce":[],"urlList":[]}}