{"title":"Life at the Zoo -  Behind the Scenes with the Animal Doctors","uid":4729812,"size":4572838,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:07f7fb0d80a3c0572991381bf6708a7304f174b6&amp;dn=Life+at+the+Zoo+-++Behind+the+Scenes+with+the+Animal+Doctors&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iornix","files":-1,"time":1234917750,"description":"Since the early days of traveling menageries and staged attractions that included animal acts, balloon ascents, and pyrotechnic displays, zoos have come a long way. The Mnagerie du Jardin des Plantes in Paris, founded in 1793, didn't offer its great apes lessons in parenting or perform dental surgery on leopards. Certainly the introduction of veterinary care in the nineteenth century -- and its gradual integration into the twentieth -- has had much to do with this. Today, we expect more of zoos as animal welfare concerns have escalated along with steady advances in science, medicine, and technology. &quot;Life at the Zoo&quot; is an eminent zoo veterinarian's personal account of the challenges presented by the evolution of zoos and the expectations of their visitors. Based on fifteen years of work at the world-famous San Diego Zoo, this charming book reveals the hazards and rewards of running a modern zoo.\n\nZoos exist outside of the &quot;natural&quot; order in which the worlds of humans and myriad exotic animals would rarely, if ever, collide. But this unlikely encounter is precisely why today's zoos remain the sites of much humor, confusion, and, occasionally, danger. This book abounds with insights on wildlife (foulmouthed parrots, gum-chewing chimps, stinky flamingoes), human behavior (the fierce competition for zookeeper jobs, the well-worn shtick of tour guides), and the casualties -- both animal and human -- of ignorance and carelessness. Phillip Robinson shows how animal exhibits are developedand how illnesses are detected and describes the perils of working around dangerous creatures. From escaping the affections of a leopard that thought he was a lap cat to training a gorilla to hold her newborn baby gently (instead of scrubbing the floor with it) and from operating on an anesthetized elephant (&quot;I had the insecure sensation of working under a large dump truck with a wobbly support jack&quot;) to figuring out why a zoo's polar bears were turning green in color, &quot;Life at the Zoo&quot; tells irresistible stories about zoo animals and zoo people.\n\nLife at the Zoo: Behind the Scenes with the Animal Doctors\nBy Phillip T. Robinson\nEdition: illustrated\nPublished by Columbia University Press, 2007\nISBN 0231132492, 9780231132497\n293 pages","torrent":{"xt":"urn:btih:07f7fb0d80a3c0572991381bf6708a7304f174b6","amp;dn":"Life+at+the+Zoo+-++Behind+the+Scenes+with+the+Animal+Doctors","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07f7fb0d80a3c0572991381bf6708a7304f174b6","infoHashBuffer":{"type":"Buffer","data":[7,247,251,13,128,163,192,87,41,145,56,27,246,112,138,115,4,241,116,182]},"announce":[],"urlList":[]}}