{"title":"The Two Eyes of the Earth - Art and Ritual of Kingship between R","uid":8419796,"size":7209965,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:082b0e9fc831f7ff6147b8719e0f0a717c3f895c&amp;dn=The+Two+Eyes+of+the+Earth+-+Art+and+Ritual+of+Kingship+between+R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1367155872,"description":"The Two Eyes of the Earth: Art and Ritual of Kingship between Rome and Sasanian Iran By Matthew P. Canepa\n2009 | 456 Pages | ISBN: 0520257278 | PDF | 7 MB\n\nThis pioneering study examines a pivotal period in the history of Europe and the Near East. Spanning the ancient and medieval worlds, it investigates the shared ideal of sacred kingship that emerged in the late Roman and Persian empires. This shared ideal, while often generating conflict during the four centuries of the empires' coexistence (224-642), also drove exchange, especially the means and methods Roman and Persian sovereigns used to project their notions of universal rule: elaborate systems of ritual and their cultures' visual, architectural, and urban environments. Matthew Canepa explores the artistic, ritual, and ideological interactions between Rome and the Iranian world under the Sasanian dynasty, the last great Persian dynasty before Islam. He analyzes how these two hostile systems of sacred universal sovereignty not only coexisted, but fostered cross-cultural exchange and communication despite their undying rivalry. Bridging the traditional divide between classical and Iranian history, this book brings to life the dazzling courts of two global powers that deeply affected the cultures of medieval Europe, Byzantium, Islam, South Asia, and China.","torrent":{"xt":"urn:btih:082b0e9fc831f7ff6147b8719e0f0a717c3f895c","amp;dn":"The+Two+Eyes+of+the+Earth+-+Art+and+Ritual+of+Kingship+between+R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"082b0e9fc831f7ff6147b8719e0f0a717c3f895c","infoHashBuffer":{"type":"Buffer","data":[8,43,14,159,200,49,247,255,97,71,184,113,158,15,10,113,124,63,137,92]},"announce":[],"urlList":[]}}