{"title":"Uit het polygoon filmarchief (Dutch) TBS B-SAM","uid":6915798,"size":3982327427,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:082e645d649cd6b9f4ff8675c8f2d26d4bc9a789&amp;dn=Uit+het+polygoon+filmarchief+%28Dutch%29+TBS+B-SAM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mad_Parrot","files":-1,"time":1325023278,"description":"\n\n\n\n\nUit het polygoon beeldarchief  \n\n\n\nBeschrijving:\n\n30 losse filmpjes uit het Polygoon archief, die van WMV bestanden zijn omgezet naar dvd bestanden.  \nDe kwaliteit van de WMV filmpjes was bijzonder hoog, zodat ook voor de DVD fraaie filmpjes het resultaat zijn.\nDaarna met TMPGenc DVD Author de boel van een menu boompje voorzien, zodat het makkelijk bladeren is.\n\nOverwegend zwart/wit beelden en sommige filmpjes zijn niet van geluid voorzien.\n\nOp deze DVD:\n\nTreinen:\n\n01 Koffie op het station. Dat waren nog eens tijden... Dit zou ik nu wel eens op het CS willen zien.\n02 Centraal Station Amsterdam. Het mooiste station van Nederland.\n03 Laatste houten rijtuigen. Een afscheidsrit t.b.v. de NVBS. De trein werd getrokken door een 3700.\n04 Laatste stoomtrein Eindhoven - Maastricht. Mooie beelden.\n05 Opening van het Amstelstation en Station Muiderpoort in Amsterdam. Dat stemmetje....\n06 Renovatie electrische treinstellen. Het gaat hier om het mat. '54.\n07 Het Spoorboekje. Uiteraard uit het computerloze tijdperk.\n08 Spoorwegen 1. Beelden van de voortschrijdende electrificering van het spoorwegnet. Mooie beelden van ik dacht mat. '36.\n09 Spoorwegen 2. De terugkeer van materieel na de 2e wereldoorlog. Triest...\n\n\n\nPost:\n\n10 Eindejaarsdrukte bij de post. En druk was het!\n11 Introductie van het postcode systeem. Het einde voor alle nacht sorteerders...\n12 Een vroeger postkantoor in Den Haag. Zo was het vroeger. Mooie beelden van Post, Telefonie en Telegrafie in oude tijden.\n\nKoningshuis:\n\n13 Onze Prinsesjes. Beelden van de terugkeer na het eind van WW II.\n14 Beatrix 18 jaar. Verjaardagsbeelden.\n\nDiversen:\n\n15 Zeppelin in Nederland. Mooie beelden van zo'n zilveren sigaar in de lucht.\n16 Zonder benzine door Haarlem. Oorlogsbeelden van een houtgestookte cabrio en een auto op stadsgas.\n17 Amsterdam - Den Haag. Beelden van de oude A4, toen het nog geen A4 heette.\n18 Autoloze zondag. Lege straten en een zielige pompbediende.\n19 Televisie zendmast. De eerste mast voor de experimentele uitzendingen.\n20 Blokkade Greenpeace. In de vorige eeuw al aktief.\n21 007 in Amsterdam. Beelden van de Amsterdamse opnames voor de film Diamonds are forever.\n22 Drukte in Amsterdam. Toen al een gekkenhuis.\n23 Grijpstra &amp; de Gier. Wederom filmopnames in Amsterdam.\n24 Haarlem 1913-1919. Sfeerbeelden van het oude Haarlem.\n25 Jongeren in Uilenstede. Studentenflats in Amsterdam/Amstelveen.\n26 Live in Utrecht en Rotterdam. Met recht voor de oudere jongere!\n27 Auto Pedagogie. Veilig verkeer door de KNAC. Als dat nu werd gedaan, dan zou het een bloedbad worden ben ik bang.\n28 Rij-examen in Den Haag. Een jubilerend CBR.\n29 Technische School. Een opening door Prins Claus.\n30 De Wegenwacht. Op de motor met zijspan.\n\n\n\n\n\nSpotinformatie \n\nCategorie     : Beeld \nFormaat       : DVD5 \nBron          : Retail\nMenu          : Ja (custom)\nAudio         : Nederlands\nExtra's       : Nee\nOndertitels   : Noppes\nCover &amp; label : Foto's tbv cover mee gepost\nGenre         : Documentaires\n\n\n\n\n\n\n\n\n\n\n\n\n\nVerrast???? \n\n\nKom eens kijken bij \n\n\n\n\nwww.black-sam.org\n","torrent":{"xt":"urn:btih:082e645d649cd6b9f4ff8675c8f2d26d4bc9a789","amp;dn":"Uit+het+polygoon+filmarchief+%28Dutch%29+TBS+B-SAM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"082e645d649cd6b9f4ff8675c8f2d26d4bc9a789","infoHashBuffer":{"type":"Buffer","data":[8,46,100,93,100,156,214,185,244,255,134,117,200,242,210,109,75,201,167,137]},"announce":[],"urlList":[]}}