{"title":"The Coral - Roots &amp; Echoes [2007]","uid":5723096,"size":299049419,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:08580771ee977400373da811943ceeca7eaf6050&amp;dn=The+Coral+-+Roots+%26+Echoes+%5B2007%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":13,"time":1280356475,"description":"Music : Indie : Lossless\nRoots &amp; Echoes\nFrom Wikipedia, the free encyclopedia\n\nRoots &amp; Echoes\n\nStudio album by The Coral\nReleased\tAugust 6, 2007\nRecorded\t2006 - 2007\nGenre\tIndie rock, Indie pop, Neo-Psychedelia\nLength\t42:29\nLabel\tDeltasonic\nProducer\tIan Broudie, Craig Silvey\n\nRoots &amp; Echoes is the fourth full-length studio album by English indie rock band The Coral. It was released on August 6, 2007, and debuted in the UK Albums Chart at #8, the lowest entry in that chart for the band. It subsequently dropped out of the top 20 in its second week and had fallen out of the top 50 by its third week in the chart. The band did not subsequently tour for the album very much, appearing at Glastonbury and supporting the Arctic Monkeys on a few dates around Ireland and the UK.\nUnlike the band's first four albums, Roots &amp; Echoes has yet to be released in the United States, only available there as an import or via digital download.\n\nReview by Stewart Mason (AMG)\nIt's hard to remember now in retrospect, but in the summer of 2002, the Coral were going to be the saviors of the British indie music scene: their debut album was hyped to the skies, and their terrific lead single &quot;Dreaming of You&quot; was rightly praised as probably the best single to come out of Liverpool since &quot;There She Goes&quot; by the La's. But with the ascension of Franz Ferdinand, Arctic Monkeys, and the whole neo-Brit-pop scene, the Coral's amalgam of '60s freakbeat and '80s post-punk didn't fit in the zeitgeist of the time, and so even though their albums have remained consistently fine, they've generally been ignored by most folks outside of a devoted cult. Roots &amp; Echoes, though it's easily the Coral's best album since 2003's Magic and Medicine, isn't going to change that. As the exceedingly old-fashioned cover art suggests, Roots &amp; Echoes takes as its starting point the era immediately preceding the psychedelic explosion, circa 1966, when folk-rock and sunshine pop were melding into a new sound, AM radio-friendly but moving outside of the strict confines of the format. Echoes of cult faves like the Beau Brummels, the Cyrkle, and the first side of Love's Da Capo flitter through these songs, which are filled with ringing guitars and colored with strings, flutes, bongos, and other ear-candy touches. James Skelly's sweet-toned vocals are a perfect accompaniment to the melodic sweep of the songs, but if there's a fault to be found, it's that there's no single song here as immediately arresting as prior Coral gems like &quot;Dreaming of You&quot; or &quot;In the Morning.&quot; The semi-orchestral closer &quot;Music at Night&quot; comes very close, however, sounding like a great lost Lee Hazlewood production for some un-remembered Reprise Records act. The Coral may not be the Next Big Thing anymore, but they're still making better records than many of the bands that have taken over that title in the intervening five years. Rating: 4/5","torrent":{"xt":"urn:btih:08580771ee977400373da811943ceeca7eaf6050","amp;dn":"The+Coral+-+Roots+%26+Echoes+%5B2007%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08580771ee977400373da811943ceeca7eaf6050","infoHashBuffer":{"type":"Buffer","data":[8,88,7,113,238,151,116,0,55,61,168,17,148,60,238,202,126,175,96,80]},"announce":[],"urlList":[]}}