{"title":"japanese inspired knits","uid":9619676,"size":36595449,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:09e7dd1f22145d3618d32de316dc0b5220b365d8&amp;dn=japanese+inspired+knits&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rajachris","files":-1,"time":1392482270,"description":"Japanese Inspired Knits (Marianne Isager Collection)\n\nInspired by the seasonal festivals and traditions of Japan, this blend of traditional Scandinavian knitting with distinctive Japanese influences explores the beautiful design elements steeped in folk customs. Created especially for women, these patterns are true to the Japanese ideals of high-quality design and materials. Twelve sweaters, oriented around the months of the year, are each knitted using nearly a dozen different techniques. With project names like &quot;Sake and Soba,&quot; &quot;Summer in Tokyo,&quot; &quot;Rice Fields,&quot; &quot;Flower Buds,&quot; and &quot;Stone Garden,&quot; knitters will have plenty of inspiration. In addition to standard knit and purl combinations, the patterns feature double knitting, domino knitting, shadow knitting, lace, cables, entrelac, intarsia, and stranded two-color knitting. All techniques are described in detail with clear text and illustrations, and an illustrated glossary at the end of the book provides technical instruction needed for any project. Also included are Japanese ideographs that relate to themes that inspired the projects, a Japanese calendar, plus lush travel photography of Japan that will inspire any knitter.","torrent":{"xt":"urn:btih:09e7dd1f22145d3618d32de316dc0b5220b365d8","amp;dn":"japanese+inspired+knits","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09e7dd1f22145d3618d32de316dc0b5220b365d8","infoHashBuffer":{"type":"Buffer","data":[9,231,221,31,34,20,93,54,24,211,45,227,22,220,11,82,32,179,101,216]},"announce":[],"urlList":[]}}