{"title":"The Age (21 nov 2013).epub","uid":9225436,"size":4144801,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0bf882ce43fdf1ab97eea26355d1487eb7edcb88&amp;dn=The+Age+%2821+nov+2013%29.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sidmal","files":-1,"time":1385004069,"description":"The Age is a daily newspaper which has been published in Melbourne, Australia, since 1854. Owned and published by Fairfax Media, The Age primarily serves Victoria but is also available for purchase in Tasmania, the Australian Capital Territory and border regions of South Australia and southern New South Wales. It is delivered in both hardcopy and online formats. The newspaper shares many articles with other Fairfax Media metropolitan daily newspapers, such as The Sydney Morning Herald.\n\nThe Age was founded by three Melbourne businessmen, the brothers John Cooke and Henry Cooke, who had arrived from New Zealand in the 1840s, and Walter Powell. The first edition appeared on 17 October 1854.\n\nAs of June 2011, The Age had an average weekday circulation of 190,600, increasing to 275,000 on Saturdays (in a city of 4 million). The Sunday Age had a circulation of 225,400.[3] The paper advertised that its Monday-to-Friday readership averaged 668,000, increasing to 857,000 on Saturdays and 695,000 for The Sunday Age.[3]\n\nThe management board announced on 18 June 2012 that during the following three years 1,900 positions were expected to be terminated from Fairfax Media, including many from The Age, that the broadsheet format would be changed to a tabloid (Berliner)[which?] format and that the online version would no longer have free access after the introduction of a paywall to protect content with an expectation of increased revenue\n","torrent":{"xt":"urn:btih:0bf882ce43fdf1ab97eea26355d1487eb7edcb88","amp;dn":"The+Age+%2821+nov+2013%29.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bf882ce43fdf1ab97eea26355d1487eb7edcb88","infoHashBuffer":{"type":"Buffer","data":[11,248,130,206,67,253,241,171,151,238,162,99,85,209,72,126,183,237,203,136]},"announce":[],"urlList":[]}}