{"title":"Stossel.2013.08.15.[Police State].Fox Business.CF.avi","uid":8820179,"size":356600702,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0d2424447c80b4f46adf5e76dfac09a1c265c7af&amp;dn=Stossel.2013.08.15.%5BPolice+State%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1376684819,"description":"----------\n\nSTOSSEL - [Police State] - Fox Business Network\n2013, August 15, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\n\nAmerica is not a police state. But:\n\nSWAT Raids: There are an estimated 150 SWAT raids in America every day. &quot;Rise of the Warrior Cop&quot; author, Radley Balko, says America's police have been militarized. Ohio Sheriff Russ Martin disagrees. He says its useful specialization.\n\nBoston Bombing: After the Boston marathon bombing, police virtually shut down Boston. James Carafano of the Heritage Foundation says local officials and police were right to make that decision. Jim Harper of the Cato Institute says the shut down went too far.\n\nPolice Ticket Quotas: Police officers in Auburn, Alabama were told they must write 100 tickets every month. But the department denied that it had ticket quotas. Officer Justin Hanner was fired after he secretly recorded his boss giving the 100 ticket command.\n\nMandatory Minimum Jail Sentences: Greg Newburn, Families against Mandatory Minimum's director in Florida, says one-size-fits-all jail sentences are expensive and cruel. The Obama administration finally agrees. Karen Garrison's sons were locked up for more than a decade because of mandatory minimums.\n\nPrying Eyes: Julian Sanchez covers technology and privacy at the Cato Institute. He says cops can turn your phone into a listening device without even touching it.\n\nCivil Forfeiture: Increasingly in America, police use something called &quot;civil forfeiture law&quot; to take people's property even if they haven't been convicted. This gives police an incentive to make accusations in order to get stuff. Tulsa Oklahoma police officers drive around in this Cadillac Escalade:\n\nMoney the police confiscate keeps growing:\n\nGovernment always grows. Even in stupid ways. During the Occupy Wall Street protests, barricades were placed around a sculpture of the Wall Street bull and police officers were stationed there. Even though the protesters have been gone for almost two years, the police are still there, and the barricades remain, forcing pedestrians to walk in the street, next to cars. The neighborhood association has asked the police to remove the barricaded for more than a year. No response. When we asked, we also got no response.","torrent":{"xt":"urn:btih:0d2424447c80b4f46adf5e76dfac09a1c265c7af","amp;dn":"Stossel.2013.08.15.%5BPolice+State%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d2424447c80b4f46adf5e76dfac09a1c265c7af","infoHashBuffer":{"type":"Buffer","data":[13,36,36,68,124,128,180,244,106,223,94,118,223,172,9,161,194,101,199,175]},"announce":[],"urlList":[]}}