{"title":"Learning Cascading - Michael Covert","uid":11977947,"size":2855985,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0d636f47fea9414ebb081ce6f0ad0e63d6537515&amp;dn=Learning+Cascading+-+Michael+Covert&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1433096165,"description":"Build reliable, robust, and high-performance big data applications using the Cascading application development efficiently\n\nAbout This Book\n\nUnderstand how Cascading fits into the big data landscape and hides the complexity of MapReduce to enable the development of streamlined, maintainable, and concise applications\nDevelop a real-life Cascading application that can be easily customized for your specific needs\nLearn basic and advanced features of Cascading through a practical, hands-on approach with step-by-step instructions and code samples\nWho This Book Is For\n\nThis book is intended for software developers, system architects and analysts, big data project managers, and data scientists who wish to deploy big data solutions using the Cascading framework. You must have a basic understanding of the big data paradigm and should be familiar with Java development techniques.\n\nIn Detail\n\nCascading is open source software that is used to create and execute complex data processing workflows on big data clusters. The book starts by explaining how Cascading relates to core big data technologies such as Hadoop MapReduce. Having instilled an understanding of the technology, the book provides a comprehensive introduction to the Cascading paradigm and its components using code examples. You will not only learn more advanced Cascading features, you will also write code to utilize them. Furthermore, you will gain in-depth knowledge of how to efficiently optimize a Cascading application. To deepen your knowledge and experience with Cascading, you will work through a real-life case study using Natural Language Processing to perform text analysis and search on large volumes of unstructured text. Throughout the book, you will receive expert advice on how to use the portions of the product that are undocumented or have limited documentation. By the end of the book, you will be able to build practical Cascading applications","torrent":{"xt":"urn:btih:0d636f47fea9414ebb081ce6f0ad0e63d6537515","amp;dn":"Learning+Cascading+-+Michael+Covert","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d636f47fea9414ebb081ce6f0ad0e63d6537515","infoHashBuffer":{"type":"Buffer","data":[13,99,111,71,254,169,65,78,187,8,28,230,240,173,14,99,214,83,117,21]},"announce":[],"urlList":[]}}