{"title":"La.Mia.Migliore.Nemica.2009.iTALiA.DVDRip.XviD-Republic[volpebia","uid":4904666,"size":733956096,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0d91f97c99be1174568ad187e8eff298af35b8ef&amp;dn=La.Mia.Migliore.Nemica.2009.iTALiA.DVDRip.XviD-Republic%5Bvolpebia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Volpebianca","files":1,"time":1242829728,"description":":::Scheda del film:::\nTitolo: Bride Wars - La mia migliore nemica\nTitolo originale: Bride Wars\nNazionalitÃƒÂ : USA\nAnno: 2009\nGenere: Commedia\nRegia: Gary Winick\nData di uscita: 20 Febbraio 2009 (cinema)\nCast: Kate Hudson, Anne Hathaway, Candice Bergen, Bryan Greenberg, Steve Howey, Kristen Johnston, Chris Pratt, Casey Wilson, June Diane Raphael, Jason Mulcahy\n\n:::Trama:::\n\nLiv (Kate Hudson) ed Emma (Anne Hathaway) sono amiche del cuore e fin dall'infanzia hanno pianificato nei minimi dettagli i rispettivi matrimoni. In cima all'elenco delle &quot;cose indispensabili&quot;: celebrare la cerimonia in quello che a New York rappresenta il non plus ultra del lusso e della raffinatezza - il Plaza Hotel. E ora, a ventisei anni, entrambe sono sul punto di sposarsi, di realizzare il loro sogno e di vivere per sempre felici e contente. O forse no... Quando un errore crea una sovrapposizione di date - il giorno del matrimonio ÃƒÂ¨ lo stesso per entrambe! Liv, Emma e la loro amicizia di una vita vengono messe a dura prova. Liv, che ÃƒÂ¨ un avvocato di successo ed ÃƒÂ¨ abituata a ottenere ciÃƒÂ² che vuole, inclusi il lavoro perfetto e l'uomo perfetto, non si accontenterÃƒÂ  di niente di meno del matrimonio perfetto che ha sognato per anni. Emma, un'insegnante che si ÃƒÂ¨ sempre presa cura degli altri, ma non altrettanto di se stessa, scopre in sÃƒÂ© un lato alla Godzilla, crudele e vendicativo, che inizia a manifestarsi quando il suo sogno nuziale ÃƒÂ¨ in pericolo. E cosÃƒÂ¬, le due migliori amiche, che avrebbero fatto qualsiasi cosa l'una per l'altra, si trovano coinvolte in una guerra senza esclusione di colpi e senza prigionieri, che rischia di trasformarsi in un conflitto totale.\n\nQualitÃƒÂ  audio e video Ottima da DVD.","torrent":{"xt":"urn:btih:0d91f97c99be1174568ad187e8eff298af35b8ef","amp;dn":"La.Mia.Migliore.Nemica.2009.iTALiA.DVDRip.XviD-Republic%5Bvolpebia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d91f97c99be1174568ad187e8eff298af35b8ef","infoHashBuffer":{"type":"Buffer","data":[13,145,249,124,153,190,17,116,86,138,209,135,232,239,242,152,175,53,184,239]},"announce":[],"urlList":[]}}