{"title":"Depeche Mode - Playing the Angel [24 bit FLAC] vinyl","uid":8104410,"size":1130248756,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0e67069237dcb0d58b8a4d46ed9897bfae66e951&amp;dn=Depeche+Mode+-+Playing+the+Angel+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1360048273,"description":"Released: 2005\nGenre: Pop/Rock\nStyle: Synthpop\nCodec: FLAC\nBit Rate: ~ 3,000 kpbs\nBits Per Sample: 24\nSample Rate: 96,000 Hz\n\n01. A Pain That I'm Used To\n02. John the Revelator\n03. Suffer Well\n04. The Sinner in Me\n05. Precious\n06. Macro\n07. I Want It All\n08. Nothing's Impossible\n09. Introspectre\n10. Damaged People\n11. Lilian\n12. The Darkest Star\n\n  When Ultra was declared the best Depeche Mode album since Violator, those who said so must have forgotten about Songs of Faith and Devotion. When Exciter was declared the best Depeche Mode album since Violator, those who said so must have also forgotten about Songs of Faith and Devotion, in addition to having found a roundabout way of saying that it was merely better than Ultra. There's no doubt this time: Playing the Angel is both the band's best album since Violator and, more significantly, an album that is near Violator in stature. The biggest clue dropped by the band prior to its release was a quote from Dave Gahan, who said that being in Depeche Mode is better than it has been in 15 years. \n\n  Some quick math reveals that Gahan was hinting at the Violator era, a time when the band's creativity and popularity peaked synchronously. It also turns out that this is a time as good as any other to be paying attention to the band. Playing the Angel lacks Songs of Faith and Devotion's end-to-end chest-beating, Ultra's grinding murk, and Exciter's desiccated patches. It takes the best qualities from those releases, combines them with a few subtle allusions to Violator - tiptoeing the border that separates retread from reinvention - and makes for a highly concentrated set of songs that all but demand to be heard in one uninterrupted shot. Gahan, still riding the confidence he gained as a songwriter from Paper Monsters, his 2003 solo debut, contributes three songs co-written with band associates Christian Eigner and Andrew Phillpott. \n\n  Though none of them vie to be the album's centerpiece, it's apparent that the move wasn't a concession of desperation on anyone's part. The friendly competition seems to have kicked chief songwriter Martin Gore into high gear; he's in top form. Musically, a lot of analog gear was used, and it's apparent that the arrangements and extra sounds were less fussed over than they have been in the recent past. You get the sense that everything fell into place, as opposed to being forced or aimlessly manipulated. Despite the favoring of older gear, there's no other year in which any of the songs could've been made. Like the best Depeche Mode, almost everything on the album will make an initial wowing impact while remaining layered enough in subtle details to surprise and thrill with repeated listens. It is not the kind of album a 25-year-old band is supposed to make.","torrent":{"xt":"urn:btih:0e67069237dcb0d58b8a4d46ed9897bfae66e951","amp;dn":"Depeche+Mode+-+Playing+the+Angel+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e67069237dcb0d58b8a4d46ed9897bfae66e951","infoHashBuffer":{"type":"Buffer","data":[14,103,6,146,55,220,176,213,139,138,77,70,237,152,151,191,174,102,233,81]},"announce":[],"urlList":[]}}