{"title":"Deconverted: A Journey from Religion to Reason - Seth Andrews","uid":14012377,"size":1671494,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0e718c0597cc325bdb2f6cdaf08ec207121669a0&amp;dn=Deconverted%3A+A+Journey+from+Religion+to+Reason+-+Seth+Andrews&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twp6045","files":4,"time":1458840292,"description":"&quot;And then Noah loaded the dinosaurs onto the ark.&quot;\r\n\r\nAssertions like these seem comical until you realize that many Christian parents aren't kidding when they teach them to their children as facts. Every day, impressionable young minds are conditioned to blindly accept wild biblical tales of floating zoos, talking shrubbery, 900-year-old humans, the undead, curses, levitation, demon/human hybrids and men who obtain super-human strength from the length of their hair. Allegiance to these teachings is expected, often demanded. Curiosity is muted. Doubt is frowned upon as a sin. And for those who dare to raise a dissenting hand, the threat of Hell looms ominously. A former religious radio host raised in the cradle of Christianity, Seth Andrews battled his own doubts for many years. His attempts to reconcile faith and the facts led him to a conclusion previously unthinkable, and this once-true believer ultimately became the founder of one of the most popular atheist communities on the internet.\r\n\r\nA Christian of 30 years and former religious broadcaster, Seth Andrews ultimately found himself dissatisfied with the explanations and doctrines of scripture and the church. His search for answers let him to reject, completely, Christianity and all other religions, and Seth now hosts one of the largest online atheist communities in the world, The Thinking Atheist.\r\n\r\nHis &quot;everyman&quot; approach and skills as a broadcaster and video producer have brought, literally, millions into the conversation regarding religious beliefs and the benefits/damage they do in the name of their respective deities, especially in regard to the indoctrination of children.\r\n\r\nThe Thinking Atheist is on YouTube,Twitter and BlogTalkRadio.\r\n\r\nThis book is one of the best deconversion stories I've read. And its summary of atheistic thought at the end is very helpful","torrent":{"xt":"urn:btih:0e718c0597cc325bdb2f6cdaf08ec207121669a0","amp;dn":"Deconverted%3A+A+Journey+from+Religion+to+Reason+-+Seth+Andrews","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e718c0597cc325bdb2f6cdaf08ec207121669a0","infoHashBuffer":{"type":"Buffer","data":[14,113,140,5,151,204,50,91,219,47,108,218,240,142,194,7,18,22,105,160]},"announce":[],"urlList":[]}}