{"title":"Harry Potter and the Sorcerer's Stone (PDF, AZW, ePUB, RTF) 1997","uid":7727065,"size":6315220,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:103b87891100add5210e58601af1dadf3ac2c033&amp;dn=Harry+Potter+and+the+Sorcerer%27s+Stone+%28PDF%2C+AZW%2C+ePUB%2C+RTF%29+1997&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AshUtpal","files":12,"time":1350240748,"description":"---------------------------------------------------------------------------------\nHP1 - Harry Potter and the Sorcerer's Stone - J.K. Rowling (PDF, AZW, ePUB, RTF) [UJ]\n---------------------------------------------------------------------------------\n\nLanguage: English\n\nFormat: PDF/AZW/ePUB/RTF\n\nHarry Potter and the Sorcerer's Stone is the first novel in the Harry Potter series written by J. K. Rowling and featuring Harry Potter, a young wizard. It describes how Harry discovers he is a wizard, makes close friends and a few enemies at the Hogwarts School of Witchcraft and Wizardry, and with the help of his friends thwarts an attempted comeback by the evil wizard Lord Voldemort, who killed Harry's parents when Harry was one year old.\n\nThe book, which is J.K. Rowling's debut novel, was published on 26 June 1997 by Bloomsbury in London. In 1998 Scholastic Corporation published an edition for the United States market under the title Harry Potter and the Sorcerer's Stone. The novel won most of the UK book awards that were judged by children, and other awards in the US. The book reached the top of the New York Times list of best-selling fiction in August 1999, and stayed near the top of that list for much of 1999 and 2000. It has been translated into several other languages and has been made into a feature-length film of the same name.\n\nMost reviews were very favourable, commenting on Rowling's imagination, humour, simple, direct style and clever plot construction, although a few complained that the final chapters seemed rushed. The writing has been compared to that of Jane Austen, one of Rowling's favourite authors, of Roald Dahl, whose works dominated children's stories before the appearance of Harry Potter, and of the Ancient Greek story-teller Homer. While some commentators thought the book looked backwards to Victorian and Edwardian boarding school stories, others thought it placed the genre firmly in the modern world by featuring contemporary ethical and social issues.\n\nHarry Potter and the Sorcerer's Stone, along with the rest of the Harry Potter series, has been attacked by several religious groups and banned in some countries because of accusations that the novels promote witchcraft; however, some Christian commentators have written that the book exemplifies important Christian viewpoints, including the power of self-sacrifice and the ways in which people's decisions shape their personalities. Educators regard Harry Potter and the Sorcerer's Stone and its sequels as an important aid in improving literacy because of the books' popularity. The series has also been used as a source of object lessons in educational techniques, sociological analysis and marketing.\n\n---------------------------------------------------------------------\nBy Utpal &amp; Jayant\n---------------------------------------------------------------------\n\nCovers:          \n        &lt;a href=&quot;\nhttp://imageshack.us/a/img577/4567/sstonejkrowling2001uj.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imageshack.us/a/img577/4567/sstonejkrowling2001uj.jpg&lt;/a&gt;\n\n\nUploader:                    &lt;a href=&quot;\nhttp://img402.imageshack.us/img402/4747/uploadera.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img402.imageshack.us/img402/4747/uploadera.jpg&lt;/a&gt;\n\n                    &lt;a href=&quot;\nhttp://thepiratebay.se/user/AshUtpal&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/AshUtpal&lt;/a&gt;","torrent":{"xt":"urn:btih:103b87891100add5210e58601af1dadf3ac2c033","amp;dn":"Harry+Potter+and+the+Sorcerer%27s+Stone+%28PDF%2C+AZW%2C+ePUB%2C+RTF%29+1997","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"103b87891100add5210e58601af1dadf3ac2c033","infoHashBuffer":{"type":"Buffer","data":[16,59,135,137,17,0,173,213,33,14,88,96,26,241,218,223,58,194,192,51]},"announce":[],"urlList":[]}}