{"title":"Wham! - The Final (1986) [EAC-FLAC] [RePoPo]","uid":4846294,"size":487758205,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1075145bb0546790124fcaa4cb9f7c47f57ca9da&amp;dn=Wham%21+-+The+Final+%281986%29+%5BEAC-FLAC%5D+%5BRePoPo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"repopo","files":-1,"time":1239700529,"description":"*******************************************************************************\n                 Wham! - The Final (1986) [EAC-FLAC] [RePoPo]\n*******************************************************************************\n\n01. Wham Rap! (Enjoy What You Do)  06:41\n02. Young Guns (Go For It)  05:11\n03. Bad Boys  03:19\n04. Club Tropicana  04:28\n05. Wake Me Up Before You Go Go  03:50\n06. Careless Whisper  05:03\n07. Freedom  05:20\n08. Last Christmas (Pudding Mix)  06:45\n09. Everything She Wants  06:29\n10. I'm Your Man  04:03\n11. A Different Corner  03:58\n12. Battlestations  05:30\n13. Where Did Your Heart Go?  05:42\n14. The Edge Of Heaven  04:34\n\n-------------------------------------------------------------------------------\nAlbum review by Iain Moffat (http://thequietus.com/articles/00486-wham)\n\nYou know what not enough greatest hits albums start with? Politicised UK hip-hop \ntracks from 1982, that's what. Yet here we find 'Wham! Rap (Enjoy What You Do)' \ntelling the three million unemployed not to give up on the life they want while \nthe backing singers butchly chirp &quot;D.H.S.S.!&quot;. Has there been a band - pop or \notherwise - since that have gone for such an enticingly bizarre opening gambit? \nAlright, probably, but not exactly on an everyday basis, which is part of what \nmakes The Final something of a prince among its peers. To new listeners, it's \nbound to be full of genuinely unaccountable surprises. For those who were fans \nat the time, it's a marvellous vindication. And for those for whom Wham! were \nthe enemy in the 1980s, it shows them unexpectedly ripe for reassessment...\n\nNot that they actually were seen as the enemy in the early days. In fact, the \nNME wouldn't be this excited about pop rap again until the resistance-\nanihilating emergence of Betty Boo almost a decade later, and the attraction is \npretty clear even now. Subsequent singles would move the band further into the \nwhite-boy soul territory that the likes of 'No Parlez' and the early Style \nCouncil singles would occupy to tremendous commercial and critical effect, and \ntheir penchant for teenage kicks coupled with a sharp observational edge \n(consider, for instance, 'Young Guns (Go For It)''s reference to &quot;sleepless \nnights on an HP bed&quot;) rang far truer than the fantastical farces then peddled by \nthe rest of the New Pop brigade. Plus, they had a keen ear for the iconic moment \n(the dropped-out instrumentation at the &quot;caution pays&quot; point of 'Young Guns' \nstill delights, while Dee C Lee's cartoon purr on 'Bad Boys' is a hoot, and that \nsingle's &quot;wooh!wooh!&quot;s were clearly custom-built for their ubiquity), and, while \n'Club Tropicana' was roundly criticised as being too Thatcherite, hindsight \nrenders it an interesting snapshot of a culture in flux. 'Y Viva Espana', eleven \nyears earlier regarded holidays as impossilby exotic, while 'Girls And Boys', \neleven years later, would paint them as blase bacchanalia, whereas, for Wham!, \nthere was fun to be had in the world becoming available to all.\n\nAnd didn't the world just welcome them for it? Neil Tennant's often spoken of \nthe Pet Shop Boys having an imperial phase in '87/'88, but, really, it had \nnothing on the one illustrated here, since, frankly, few do. 'Wake Me Up Before \nYou Go Go', 'Careless Whisper', 'Freedom', 'Last Christmas' (included here in \nits &quot;Pudding Mix&quot;, which is essentially the familiar version with an \ninexplicable hula intro) and 'Everything She Wants' all reached number two or \nabove in under eight months, and all remain key elements of the pop canon. It's \ninteresting, hearing them back-to-back, to note that all five are driven by real \nor imagined infidelity (fascinatingly, in later years George Michael's 'Spinning \nThe Wheel' would be effectively the horrific moment at which his 'Wake Me Up...' \nself actually wakes), which makes it all the more intriguing that they were so \nutterly embraced, and also that there's some startlingly audacious songwriting \ngoing on at this stage. 'Last Christmas' in particular demands a staggering \namount of conviction to sidestep the risk of cheese overload, yet George manages \nto perform lines like &quot;'Happy Christmas' / I wrapped it up and sent it / With a \nnote saying I loved you / I meant it&quot; (awful written down, obviously) \nunbeatably. And anyone that can tackle the Doris Day and guilty feet lyrics that \nwell as well has to be applauded for sheer chutzpah even if the tunes themselves \nwere lacking, which their enduring populist winningness would indicate is very \nfar indeed from the case.\n\nOf course, like everyone else involved in Band Aid (with the notable exception \nof U2), their momentum would dissolve immediately thereafter, and reinventing \nthemselves in 1985 as the All-New, All-Different SexWham! really didn't help. \nAfter all, 'I'm Your Man' might still work on some terms, and can thankfully \nblot out all memory of the Alfie Moon version when listened to now, but the \ntruth is that, for reasons that are rather clearer now, George couldn't really \ndo sex all that well at that point (in retrospect, this makes 'Fastlove and \n'Outside' even greater achievements), but by then their work was pretty much \ndone anyway. He sounds far more at home in balladeering mode on 'A Different \nCorner', which cemented his Terribly Serious reputation in spite of the fact \nthat the shuttlecocks-in-shorts era really wasn't that distant a memory by then, \nand 'The Final Single', all of which appears here bar the re-done 'Wham! Rap', \nis a decent enough coda to the pair's career: 'The Edge Of Heaven' is, by their \nown standards, marginally by-numbers, although 'Battlestations', with its \nremarkable breathiness and oddly Soft Cell-reaclling synthesised brass, is this \nalbum's real curio, and the cover of Was (Not Was)'s 'Where Did Your Heart Go' \nproves to be a soaring fusion of their soulful roots and the grown-up pop \ninstincts that George was keen to hone.\n\nAnd then there was no more, and, in fairness, there really doesn't need to be. \nAfterwards, Andrew Ridgeley tried an ill-advised solo album before realising he \ncould retire cheerfully to the south coast and live as Mr One Of Bananarama, \nwhile George, occasional troubles notwithstanding, put the whole of music \nroyalty in his rolodex, met the man of his dreams, and carried on selling \nkajillions of records, which must count as happy endings all round. Even after \n22 years, the Wham! story remains an incredibly useful one for new bands, given \nthat they managed to never outstay their welcome, never squander an ounce of \ngoodwill, and never descend into acrimony, and, as an accompanying textbook to \njust what pop can do in the right hands, The Final still feels like a sizeable \nsuccess today.\n\n-------------------------------------------------------------------------------\n\nExact Audio Copy V0.99 prebeta 4 from 23. January 2008\n\nEAC extraction logfile from 14. April 2009, 9:05\n\nWham! / The Final\n\nUsed drive  : HL-DT-STDVD-RAM GSA-H55N   Adapter: 3  ID: 1\n\nRead mode               : Secure\nUtilize accurate stream : Yes\nDefeat audio cache      : No\nMake use of C2 pointers : No\n\nRead offset correction                      : 102\nOverread into Lead-In and Lead-Out          : No\nFill up missing offset samples with silence : Yes\nDelete leading and trailing silent blocks   : No\nNull samples used in CRC calculations       : No\nUsed interface                              : Native Win32 interface for Win NT \n&amp; 2000\nGap handling                                : Not detected, thus appended to \nprevious track\n\nUsed output format              : User Defined Encoder\nSelected bitrate                : 1024 kBit/s\nQuality                         : High\nAdd ID3 tag                     : Yes\nCommand line compressor         : F:Archivos de programaExact Audio \nCopyFLACFLAC.EXE\nAdditional command line options : -6 -V -T &quot;ARTIST=%a&quot; -T &quot;TITLE=%t&quot; -T \n&quot;ALBUM=%g&quot; -T &quot;DATE=%y&quot; -T &quot;TRACKNUMBER=%n&quot; -T &quot;GENRE=%m&quot; -T &quot;COMMENT=%e&quot; %s -o \n%d\n\n\nTOC of the extracted CD\n\n     Track |   Start  |  Length  | Start sector | End sector \n    ---------------------------------------------------------\n        1  |  0:00.00 |  6:41.72 |         0    |    30146   \n        2  |  6:41.72 |  5:11.50 |     30147    |    53521   \n        3  | 11:53.47 |  3:19.55 |     53522    |    68501   \n        4  | 15:13.27 |  4:28.33 |     68502    |    88634   \n        5  | 19:41.60 |  3:50.50 |     88635    |   105934   \n        6  | 23:32.35 |  5:03.17 |    105935    |   128676   \n        7  | 28:35.52 |  5:20.10 |    128677    |   152686   \n        8  | 33:55.62 |  6:45.63 |    152687    |   183124   \n        9  | 40:41.50 |  6:29.55 |    183125    |   212354   \n       10  | 47:11.30 |  4:03.55 |    212355    |   230634   \n       11  | 51:15.10 |  3:58.20 |    230635    |   248504   \n       12  | 55:13.30 |  5:30.35 |    248505    |   273289   \n       13  | 60:43.65 |  5:42.50 |    273290    |   298989   \n       14  | 66:26.40 |  4:34.65 |    298990    |   319604   \n\n-------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:1075145bb0546790124fcaa4cb9f7c47f57ca9da","amp;dn":"Wham%21+-+The+Final+%281986%29+%5BEAC-FLAC%5D+%5BRePoPo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1075145bb0546790124fcaa4cb9f7c47f57ca9da","infoHashBuffer":{"type":"Buffer","data":[16,117,20,91,176,84,103,144,18,79,202,164,203,159,124,71,245,124,169,218]},"announce":[],"urlList":[]}}