{"title":"Modernising Money.epub","uid":10159317,"size":3227579,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10917d097164de135dd1a1bfdf78c0528b50dc89&amp;dn=Modernising+Money.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ponleu18","files":1,"time":1400225337,"description":"Modernising Money: Why Our Monetary System is Broken, and How We Fix It By Andrew Jackson &amp; Ben Dyson from Positive Money (2013, 336 pages)\n\n------------------------\nThe book explains, in more detail than ever before, exactly how the monetary system can be fixed. The product of three years of research and development, these proposals offer one of the few hopes of escaping from our current dysfunctional monetary system. It is detailed but accessible to non-economists.\n\n------------------------\nAt the heart of the ongoing economic crisis is the fact that governments across the world have given the power to create money to the private corporations that we know as banks. Today, over 97% of all of the money used by people and businesses is created by banks when they make loans. This way of creating money has led to economic instability and a financial crisis. It has produced the highest-ever levels of personal and government debt, made houses unaffordable, and driven the short-termism which is destroying the businesses, and ecosystems, on which we depend.\n\nBut it doesn't have to be like this. The way money is created can be changed. Modernising Money shows how a UK law implemented in 1844 can be updated and combined with reform proposals from the Great Depression, to provide the UK with a stable monetary and banking system, much lower levels of personal and national debt, and a thriving economy.\n\nDetailed, but accessible to non-economists, Modernising Money is written for anybody who wants to know how to create an economy that serves people, businesses, society and the environment. ","torrent":{"xt":"urn:btih:10917d097164de135dd1a1bfdf78c0528b50dc89","amp;dn":"Modernising+Money.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10917d097164de135dd1a1bfdf78c0528b50dc89","infoHashBuffer":{"type":"Buffer","data":[16,145,125,9,113,100,222,19,93,209,161,191,223,120,192,82,139,80,220,137]},"announce":[],"urlList":[]}}