{"title":"Ebook: Access to Knowledge: in the age of intellectual property","uid":5934548,"size":6751699,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1147515c6bd8927d7ff683d23b812060464059b4&amp;dn=Ebook%3A+Access+to+Knowledge%3A+in+the+age+of+intellectual+property&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"freehist2","files":1,"time":1288901996,"description":"The end of the twentieth century saw an explosive intrusion of intellectual property law into everyday life. Expansive copyright laws have been used to attack new forms of sharing and remixing facilitated by the Internet. International laws extending the patent rights of pharmaceutical companies have threatened the lives of millions of people around the world living with HIV/AIDS. For decades, governments have tightened the grip of intellectual property law at the bidding of information industries. Recently, a multitude of groups around the world have emerged to challenge this wave of enclosure with a new counterpolitics of ÃƒÂ¢access to knowledgeÃƒÂ¢ or ÃƒÂ¢A2K.ÃƒÂ¢ They include software programmers who take to the streets to attack software patents, AIDS activists who fight for generic medicines in poor countries, subsistence farmers who defend their right to food security and seeds, and college students who have created a new ÃƒÂ¢free cultureÃƒÂ¢ movement to defend the digital commons. In this volume, GaÃƒÆ’Ã‚Â«lle Krikorian and Amy Kapczynski have created the first anthology of the A2K movement, mapping this emerging field of activism as a series of historical moments, strategies, and concepts. Intellectual property law has become not only a site of new forms of transnational activism, but also a locus for profound new debates and struggles over politics, economics, and freedom. This collection vividly brings these debates into view and makes the terms of intellectual property law legible in their political implications around the world.\n\n\n\nThis work is published subject to a Creative Commons by-nc-nd\n\nlicense, with the exception that the term ÃƒÂ¢AdaptationsÃƒÂ¢ in\n\nParagraph 1(a) of such license shall be deemed not to include\n\ntranslations from the English original into other languages. Such translations may therefore be created and disseminated\n\nsubject to the other terms of such license","torrent":{"xt":"urn:btih:1147515c6bd8927d7ff683d23b812060464059b4","amp;dn":"Ebook%3A+Access+to+Knowledge%3A+in+the+age+of+intellectual+property","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1147515c6bd8927d7ff683d23b812060464059b4","infoHashBuffer":{"type":"Buffer","data":[17,71,81,92,107,216,146,125,127,246,131,210,59,129,32,96,70,64,89,180]},"announce":[],"urlList":[]}}