{"title":"Covenant - Northern Light[FLAC - LOSSLESS]","uid":4270553,"size":405504005,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1154f0447254c03b92ff2ec152f2e596e9429df3&amp;dn=Covenant+-+Northern+Light%5BFLAC+-+LOSSLESS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"99AM","files":15,"time":1214918948,"description":"Music : Industrial : Lossless\nFLAC files + CUE sheet + Covers\nRelease date: October 8, 2002\n\n\nTrack Listing\n1.Monochrome\n2.Call the Ships to Port\n3.Bullet\n4.Invisible &amp; Silent\n5.Prometheus\n6.We Stand Alone\n7.Rising Sun\n8.Winter Comes\n9.We Want Revolution\n10.Scared\n11.Atlas\n\n\nI love the way Covenant challenge their listeners with every new album. The gentlemen Joakim, Eskil and Clas constantly try to find new ways to express themselves. However, they always maintain that inimitable Covenant sound. That sound is very much evident on ?Northern Light?, but now with much more maturity and emotion. In these times of copycat future pop and EBM bands it feels good to hear music that has been given some thought out and made with care.\nThe album begins with the beeping and bopping ?Monochrome?, which gives a hint of what is to come. Lush strings and Eskil?s voice makes this a good number indeed. The album then moves briskly along with the first single ?Call the Ships to Port?, destined to bring havoc on dance floors the world over for many years. ?Bullet? comes next, and it is the upcoming single complete with a totally awesome video. This is brilliant electronic pop.\n?Invisible and Silent? is a warm and cosy slow track, with fantastic strings, choral arrangements and an infectious melody that sees Eskil working with his voice more than ever. Truly marvellous. My favourite from the gig at the Arvika Festival in July, ?We Stand Alone? is a dramatic and riveting experience, also headed for the clubs, but works good at home too. ?Winter Comes? is yet another slow and emotional masterpiece with many weird sounds and quirky beats.\nI could go on listing every track here, but instead I?ll mention the highlights. Every track has the finesse and exquisite attention to detail that we have come to expect from these perfectionists, and the song writing is better than ever. Kudos to the producer Jakob Hellner for bringing out the best in the band.\nEven the packaging oozes quality, with great images and concept.\nSo a perfect ten then? Well, I feel the album drags a bit towards the end, namely the last two songs.\nBut this is indeed one of the best albumsof the year. Perhaps in many years.\n\n(Review by JOHAN CARLSSON from Release Music Magazine)\n\n\nEnjoy!","torrent":{"xt":"urn:btih:1154f0447254c03b92ff2ec152f2e596e9429df3","amp;dn":"Covenant+-+Northern+Light%5BFLAC+-+LOSSLESS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1154f0447254c03b92ff2ec152f2e596e9429df3","infoHashBuffer":{"type":"Buffer","data":[17,84,240,68,114,84,192,59,146,255,46,193,82,242,229,150,233,66,157,243]},"announce":[],"urlList":[]}}