{"title":"Dungeon Corp - DOCR - Mar 08, 2016 - Daisy Marie","uid":13928407,"size":331773474,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:1192ddfb505e05ac3d2165166458dde1faebab5d&amp;dn=Dungeon+Corp+-+DOCR+-+Mar+08%2C+2016+-+Daisy+Marie&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":307,"time":1458401876,"description":"&quot;Daisy, Dungeon Whore&quot; \r\nDungeon of Cum : Redux\r\n\r\nMp4 480p + Pics \r\n\r\nReno is back, and can you blame him? Anyone who vists the Dungeon comes back as soon as they can. Reno requests a beautiful Latina slave and we get him Daisy Marie. Daisy is about as hot as they come. She is young, she is playboy beautiful, she is sexually deviant and her pussy is like velvet. We tie her up and leave her gagged on the sofa for him. In the first scene alone, he induldges in Daisy's helplessness for almost a half hour. She sucks, he fucks. And when Reno fucks, he pounds through his partners hips. He fucks her in every possible position, then he unties her legs and she rides his cock, then he ties her up again and leaves her bound and broken on the floor. In the next scene, Daisy is spread eagle on a bed. Reno uses a vibrator to get her off, then he jumps on top and fucks her from a squatting position as he holds the vibrator on her clit at the same time. A very impressive feat which sends Daisy through screams and orgasms. Then he unties one foot and fucks her some more. In the last scene, Daisy is tied and bent over. Reno pounds Daisy from behind. He un-gags her and fish-hooks her mouth as he continues to slam her. Then he moves around front and jacks his cock faster than any mortal man is capable. He drops a thick and gooey load on Daisy's face and crams the rest in her mouth. He leaves her cum-covered, pleasure-crazed and wilted. This one is HOT!\r\n\r\nScreens\r\n         \nhttp://www.dungeoncorp.com/updates16/DRE/DAI_032007/index.php\r\n\r\n Uploaded by Merzedes and Shallow2\r\n\r\n 20 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\n Just keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\n Also, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\n Any Questions ?? Read our FAQ!!\r\n         \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n         \nhttp://s16.postimg.org/rxyfm...llow2_FAQ_The_Pirate_Bay.jpg\r\n\r\n Cheers :-)","torrent":{"xt":"urn:btih:1192ddfb505e05ac3d2165166458dde1faebab5d","amp;dn":"Dungeon+Corp+-+DOCR+-+Mar+08%2C+2016+-+Daisy+Marie","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1192ddfb505e05ac3d2165166458dde1faebab5d","infoHashBuffer":{"type":"Buffer","data":[17,146,221,251,80,94,5,172,61,33,101,22,100,88,221,225,250,235,171,93]},"announce":[],"urlList":[]}}