{"title":"Calexico...Feast of Wire(2003)[FLAC]","uid":5823959,"size":391872812,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:11b5fe0ff20c0bd5e329057c7207b88199357a12&amp;dn=Calexico...Feast+of+Wire%282003%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":27,"time":1284187869,"description":"1 Sunken Waltz  2:27 \n2 Quattro (World Drifts In)  4:37 \n3 Stucco  0:20 \n4 Black Heart  4:48 \n5 Pepita  2:36 \n6 Not Even Stevie Nicks...  2:43 \n7 Close Behind  2:51 \n8 Woven Birds  3:47 \n9 The Book and the Canal  1:44 \n10 Attack El Robot! Attack!  3:16 \n11 Across the Wire  3:26 \n12 Dub Latina  2:19 \n13 GÃƒÂ¼ero Canelo  2:57 \n14 Whipping the Horse's Eyes  1:24 \n15 Crumble  3:54 \n16 No Doze  4:21 \n32 Corona   3:18 \n33 Si Tu Disais   3:25 \n34 Fallin' Rain   5:14 \n\nFeast of Wire is a surprisingly good album. So much of Calexico's music after The Black Light is expendable and I did not have high hopes for this album to be as solid as it is. The group takes a more alternative approach to their music on this album. Feast of Wire does emphasis the tejano tracks that persisted throughout their previous albums and the group shows improvement in songwriting and in performance. Although I am still not nuts about the vocals, they have improved.\n\nThis album contains a whopping nineteen tracks of various length. &quot;Sunken Waltz&quot; is a nice opening song with accordion that sets the tone for the rest of the album. I also enjoy &quot;Quattro (World Drifts In),&quot; &quot;Close Behind,&quot; &quot;Woven Birds, and &quot;Across the Wire.&quot; The diversity of songs on this album is greater than any of their previous releases. There are a few peppy, fun songs on Feast of Wire that break up the monotony of the slow, sad bastard songs that Calexico seems to enjoy playing. The tracks themselves include many instruments and incorporate interesting rhythmic passages. Overall, this album has a very relaxed feel to it but still manages to keep moving. I could have done without the short songs (under two minutes) and consequently would have enjoyed fewer tracks. As stated before, I am do not enjoy the vocals of Calexico, but they have improved for this release.\n\nThis is Calexico's finest effort on pretty much every musical front since The Black Light. One of my complaints about earlier Calexico was that they tried to do too much on one album. Although the group does touch a little jazz on this album, they do not stray too much from alternative country/tejano/americana that most of the tracks follow. Up to this release, the only two Calexico albums I can recommend are The Black Light and Feast of Wire. Oh, and Calexico, thank you for finally producing an album on the same level as The Black Light. What took so long?\n\ncd ripped by dBpoweramp\n\nplease seed","torrent":{"xt":"urn:btih:11b5fe0ff20c0bd5e329057c7207b88199357a12","amp;dn":"Calexico...Feast+of+Wire%282003%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11b5fe0ff20c0bd5e329057c7207b88199357a12","infoHashBuffer":{"type":"Buffer","data":[17,181,254,15,242,12,11,213,227,41,5,124,114,7,184,129,153,53,122,18]},"announce":[],"urlList":[]}}