{"title":"The Spanish Table by Steve Winston","uid":10085848,"size":8922150,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12439a6c0f73d8ead1cffcabf8729059f78f9865&amp;dn=The+Spanish+Table+by+Steve+Winston&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":1,"time":1399089961,"description":"\nThe Spanish Table: Traditional Recipes and Wine Pairings from Spain and Portugal by Steve Winston \n\n\nIN RESPONSE TO THE REQUESTS of his patrons, Steve Winson has created a cookbook full of tasty recipes for those specialty cooking utensils unique to Spain and Portugal-paella pans, cazuelas, cataplanas, and ollas. In a cheery and informative way, he provides the history and culture of the pans and how to use them. \n\nHe also offers an excellent section on Iberian wines and ideas for hosting fun tasting parties.\nSo, when in the mood for something a bit exotic, this book makes it easy for home cooks to try their hand at a traditional seafood paella, or Clams Medeira, or Black Olive-Fig Tapenade served with a fine Pedro Ximenex sherry. It's a trip to the Old Country without leaving the kitchen.\n\nIberian/Spanish cuisine is currently &quot;in fashion,&quot; with several top chefs garnering recent media attention.\n\nIn 1995, Steve Winston opened his first The Spanish Table store in Seattle, and over the years has added shops in Berkeley, Santa Fe, and Mill Valley, California. His small chain specializes in selling cookware, foods, and wines unique to the Iberian Peninsula. Winston is a true Iberianophile and is an expert on wines from that region.\n\nGenre: Non-Fiction, Cookery","torrent":{"xt":"urn:btih:12439a6c0f73d8ead1cffcabf8729059f78f9865","amp;dn":"The+Spanish+Table+by+Steve+Winston","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12439a6c0f73d8ead1cffcabf8729059f78f9865","infoHashBuffer":{"type":"Buffer","data":[18,67,154,108,15,115,216,234,209,207,252,171,248,114,144,89,247,143,152,101]},"announce":[],"urlList":[]}}