{"title":"OfficeSuite Pro 6 + (PDF &amp; HD) v6.5.1010","uid":8042451,"size":16629859,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:1295c6d6f7272f1cc72a671407d624c36b398aa6&amp;dn=OfficeSuite+Pro+6+%2B+%28PDF+%26amp%3B+HD%29+v6.5.1010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".Waledac.","files":2,"time":1358666837,"description":"Just Install the .apk file on your android phone\n\n\nOver 5 million sold!\n\nView, Edit, Print and Share your office documents on the go!\n\nMade by MobiSystems, OfficeSuite Pro allows you to view, create, edit, print and share Word, Excel and PowerPoint files on the go. One can also open attachments and see PDF files on an Android based phone or tablet with our feature-rich mobile office solution.\n\nOfficeSuite Pro includes a File Browser and integration with Sharing Service Leaders: Box, DropBox, Google Drive, SkyDrive and SugarSync - to give users a multitude of options on how to manage files and attachments.\n\nOfficeSuite Pro is a leading-edge office productivity application that has been chosen to be pre-loaded onto over 50 million (and counting) devices worldwide by such prestigious manufacturers like Sony Ericsson, Alcatel, FoxConn, Archos, Pandigital, Polaroid, Olivetti, Coby and a host of other major players in the Android Mobile Device market.\n\n*** Now offering Microsoft Office Font Compatibility Pack (sold separately) *Note - OfficeSuite Pro comes with a base pack of ready-to-use fonts. Purchasing the Microsoft Office Font Compatibility Pack is optional and it ensures that you have the licensed versions for complete font compatibility.\n\nOfficeSuite Pro 6.5 New Features:\n* Print - ability to print documents with Google Cloud Print or previously installed third party print solution\n* Convert to PDF - convert your text documents to PDF files\n* Spell-check- ability to check and correct the spelling of text documents (based on Google ICS spell-check)\n* New supported formats - opening of XLSM, PPTM, PPSM and DOCM formats\n* Thumbnail preview in Slideshow mode\n* Animated Slideshow -support for animated slideshows\n* Embedded images (in Excel module)\n* Embedded charts (charts appear directly on the Excel spreadsheet)\n* Extended cloud support - now compatible with Microsoft SkyDrive\n* Widget for recent files -view the last opened files at a glance with the OfficeSuite Recent files widget\n* WiFi Direct support\n\nOfficeSuite Pro consists of several software modules that share the same look and feel, and allow you to view, create and modify office documents on the go:\n* Intuitive Toolbars for the following:\n* File browser\n* Text document module\n* Spreadsheet module\n* Presentation module\n* PDF Reader\n* Email reader\n\nFile Formats Supported:\n* Text format - DOC and DOCX, DOCM, RTF, TXT, LOG\n* Spreadsheet - XLS, XLSX, XLSM and CSV\n* Presentation - PPT, PPTX, PPS, PPSX, PPTM and PPSM\n* Other formats - PDF, EML, ZIP\n\nView Attachments and Share Documents:\n* Easily open most email attachments\n* Works with Outlook EML files\n* Share documents via Email or Bluetooth\n* Use with a primary sharing service such as Box, Dropbox, Google Drive, SkyDrive or SugarSync for efficient file handling\n\nOfficeSuite Pro is the only Android OS mobile office application that allows opening of password protected documents\n\nLanguages Supported:\nEnglish, French, Italian, German, Spanish, Japanese, Chinese Traditional, Chinese Simplified, Swedish, Russian and Korean.","torrent":{"xt":"urn:btih:1295c6d6f7272f1cc72a671407d624c36b398aa6","amp;dn":"OfficeSuite+Pro+6+%2B+%28PDF+%26amp%3B+HD%29+v6.5.1010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1295c6d6f7272f1cc72a671407d624c36b398aa6","infoHashBuffer":{"type":"Buffer","data":[18,149,198,214,247,39,47,28,199,42,103,20,7,214,36,195,107,57,138,166]},"announce":[],"urlList":[]}}