{"title":"The Story of the Scrolls The miraculous discovery and true signi","uid":9364952,"size":3164006,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14c06e5e3b94110ed4514bd29a157597adde9492&amp;dn=The+Story+of+the+Scrolls+The+miraculous+discovery+and+true+signi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":5,"time":1387394596,"description":" From the world's leading Dead Sea Scrolls scholar, Geza Vermes' The Story of the Scrolls: The Miraculous Discovery and True Significance of the Dead Sea Scrolls is an ideal introduction to understanding these ancient documents. The discovery of the Dead Sea Scrolls in Qumran, between 1947 and 1956, was one of the greatest archaeological finds of all time. Written in Hebrew, Aramaic and Greek, and hidden in caves by an ancient Jewish sect, these mysterious manuscripts revolutionized our understanding of the Bible, of Judaism and the early Christian world. Geza Vermes's English translations brought these extraordinary documents to thousands, and his life has been inextricably interwoven with the scrolls for over sixty years. In The Story of the Scrolls, Vermes relates the controversial story of their discovery and publication around the world, revealing cover-ups, blunders and academic in-fighting, but also the passion and dedication of many of those involved. He shares what he has learned about the scrolls and, evaluating passages from them, gives his views on their true significance and what they can teach us, as well as those areas where scholarly consensus has not yet been reached. 'The world's leading Gospel scholar' \nThe Times 'Vermes has the rare gift of wearing his immense scholarship lightly' \nDavid Goldberg, Independent Geza Vermes is director of the Forum for Qumran Research at the Oxford Centre for Hebrew and Jewish Studies. His books, published by Penguin, include The Complete Dead Sea Scrolls in English and The Changing Faces of Jesus as well as the 'Jesus' trilogy: Nativity, Passion and Resurrection.","torrent":{"xt":"urn:btih:14c06e5e3b94110ed4514bd29a157597adde9492","amp;dn":"The+Story+of+the+Scrolls+The+miraculous+discovery+and+true+signi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14c06e5e3b94110ed4514bd29a157597adde9492","infoHashBuffer":{"type":"Buffer","data":[20,192,110,94,59,148,17,14,212,81,75,210,154,21,117,151,173,222,148,146]},"announce":[],"urlList":[]}}