{"title":"Silver Apples - 1968 - ST/Contact [Flac]","uid":11939031,"size":507760555,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:15f56eb6467dcbfbe4847810eab0ed2ddaad4767&amp;dn=Silver+Apples+-+1968+-+ST%2FContact+%5BFlac%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"celsoinc","files":21,"time":1431932226,"description":"Product Description\nBoth albums from the groundbreaking electronic music duo, previously available only on expensive German imports! You will find it hard to believe this stuff came out in 1968, but it did and charted, too.  .\n\nOft-sampled electronic pop pioneers the Silver Apples released two exceptionally influential, off-kilter records in 1968 and '69, then apparently vanished. The group was formed in New York City in the psychedelic heyday of 1967 by drummer Danny Taylor and protosynth player Simeon, who quaintly named his hand-built instrument the Simeon. Taylor was a powerhouse of polyphony and his looping, loping playing is the engine that drives the Apples' experimental music, characterized by snippets of found sound, weird and warbly high-pitched singing, stray banjos, and--most importantly--the battering, buzzing, bleeping beauty of the Simeon synth. The two albums are a bizarre, sincere mixture of avant-garde sensibilities, pop melodies, folk-psyche song structures, overwrought poetry, and hefty percussion. It is difficult-to-describe, signature music that ranks high alongside the most forward-thinking avant-prog. The group got back together in the mid-'90s, spurred on by the enthusiasm that many acts showed for their music (the group has been name-checked and more by Spacemen 3, Low, and Stereolab). But as is often the case, the reunion records just don't quite cut it--this one CD has everything you need. Lazy electronic musicians are encouraged to sample the heck out of this band; you won't be the first. --Mike McGonigal","torrent":{"xt":"urn:btih:15f56eb6467dcbfbe4847810eab0ed2ddaad4767","amp;dn":"Silver+Apples+-+1968+-+ST%2FContact+%5BFlac%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15f56eb6467dcbfbe4847810eab0ed2ddaad4767","infoHashBuffer":{"type":"Buffer","data":[21,245,110,182,70,125,203,251,228,132,120,16,234,176,237,45,218,173,71,103]},"announce":[],"urlList":[]}}