{"title":"Bill Kirchen - Tombstone Every Mile","uid":9104347,"size":57551974,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:161de28f66d0179d5d131dfd9b760a5213b7e3da&amp;dn=Bill+Kirchen+-+Tombstone+Every+Mile&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Noshock","files":-1,"time":1382830849,"description":"This first Black Top release by honky tonker Bill Kirchen is an Americana roots-music vault of valuables. With plenty of traditional C&amp;W riffs underscored by the brilliant pedal steel of one-time Ernest Tubb steel player Buddy Charleton and the powerful piano of Mitch Collins, this project is more than mere buried treasure that contemporary radio overlooked. Kirchen, a living legend of sorts, takes a very broad stance and combines the best elements of C&amp;W, hillbilly, blues, rockabilly, and honky tonk music to come up with cuts like &quot;Bottle Baby Boogie,&quot; a rip-it-up rockabilly tune that shows off Kirchen's guitar master skills, and &quot;All Tore Up,&quot; another rocker. The Farrell-Preston song &quot;Fool on a Stool&quot; is given an outstanding retooling with plenty of steel that is true to the tenants of C&amp;W music. Covering Johnny Horton's hit &quot;One Woman Man&quot; is a brave move that comes off convincingly and sounding as honest as the original. Teaming up with bassman Jeff Sari and wife Louise Kirchen, this triple threat not only displays Bill Kirchen's songwriting skills, but a spectacular piece of music in &quot;Secrets of Love.&quot; Also noteworthy is &quot;Think It Over,&quot; a Donley-Meaux tune that is haunting in the hands of a master. With a nod to friend Nick Lowe, Kirchen adds the beautiful harmony vocals of Louise to his own multi-faceted vocal style on Lowe's &quot;Without Love,&quot; to come up with a moment that leaves time standing still. A mighty accomplishment in musical terms. This disc is only an indication of what the future holds for one of the few solid survivors of the country-rock phenomenon of the 1970s. With all his talent on display here, it is easy to understand why Kirchen has survived, even in the face of the '90s pop-bubblegum-country cookie-cutter mentality. \n\n\nReview by Jana Pendragon","torrent":{"xt":"urn:btih:161de28f66d0179d5d131dfd9b760a5213b7e3da","amp;dn":"Bill+Kirchen+-+Tombstone+Every+Mile","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"161de28f66d0179d5d131dfd9b760a5213b7e3da","infoHashBuffer":{"type":"Buffer","data":[22,29,226,143,102,208,23,157,93,19,29,253,155,118,10,82,19,183,227,218]},"announce":[],"urlList":[]}}