{"title":"Winstep Xtreme 11.6 Multilingual","uid":6532566,"size":37971141,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1679245771df1f3f98206bd2d6548db156f5f834&amp;dn=Winstep+Xtreme+11.6+Multilingual&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1310397483,"description":"Winstep Xtreme 11.6 Multilingual\n\n\nAmong Windows 7's features, the taskbar overhaul is probably the feature in Microsoft's upcoming OS that has aroused the most interest. Well, you won't have to wait for Windows 7 anymore - Winstep Xtreme has just been released, and brings with it the most interesting and useful features of the new Windows 7 &quot;Superbar&quot; into the XP and Vista world! Winstep Xtreme is a superb collection of utilities and desktop enhancements that will change the way you work with Windows forever! Want your computer to look like NeXT, KDE, a Mac or something from a William Gibson novel? Then download Winstep Xtreme and expand your horizons! Winstep Xtreme features the following applications...\n\n\nFeatures:\nNextSTART:\nAn incredibly powerful replacement for the Windows Start Menu, System tray and Taskbar. It is, of course, fully skinnable, with a wide range of themes supplied with the package and many hundreds more available online. NextSTART is also far more than just a pretty face - offering fully configurable menus that can 'float' anywhere on the desktop and which may be called up with a simple mouse button press, a hotkey combination or simply by 'bumping' the edge of the screen with the mouse pointer. NextSTART also offers built-in file browsing and task management, supports full drag-and drop both to and from the menus and includes many other amazing features - including full theme integration with other Winstep Xtreme applications.\nWorkShelf:\nA skinnable multi-page tabbed desktop replacement, quick program launcher and document organization tool. Can be used as a simple 'dock' positioned anywhere on your screen, or can alternatively be resized to almost full screen size - offering a quick and efficient way of launching applications, accessing recent documents, managing your internet connections and much more!\nNeXuS:\nA multi-level dock system, NeXuS sits front and center, providing super fast access to your most frequently used applications. Flexible options allow it to dock or float anywhere on the screen, providing a myriad number of &quot;On Demand&quot; possibilities. From it's generous use of situational context sensitive menus to it's advanced Drag-n-Drop support, NeXuS is not only easy to use - it's a joy!\nModules:\nWinstep Xtreme features useful &quot;Modules&quot; such as a Talking Digital/Analog Clock that synchronizes your time with time servers on the internet, a Recycler, a CPU Meter, an Email Checker, a Weather Module, a Net and RAM Meters, a 'fortune cookie' reader and more forthcoming... Modules can be displayed 'in-shelf' among other objects, inside NeXuS docks, in the NextSTART Startbar or as free-form/free floating objects on your desktop!\nWinstep Start Menu Organizer Pro:\nThe Winstep Start Menu Organizer is an application designed to help you organize and clean your Windows Start Menu. Over time, as more and more applications get installed, the Start Menu can get so cluttered that you end up spending a lot of time simply trying to find the program you want to run. This is where the Winstep Start Menu Organizer comes in: it allows you to quickly group your Start Menu shortcuts into a specific set of categories (eg Utilities, Internet, Office, etc...) thus making finding what you are looking for a lot easier and much, much, faster!\nFontBrowser:\nHave you ever needed to preview a range of fonts at various point sizes? FontBrowser is the simplest method - inspired by the font panel from the NeXTSTEP OS, FontBrowser is one of those utilities that will make you wonder how you ever managed without it!\n\n\nNextSTART, WorkShelf and NeXuS are far more than just three related applications - they are designed to integrate seamlessly with one another - change the theme in one application and the other applications will automatically change to match. Likewise WorkShelf and NeXuS can use the current NextSTART theme to skin their context menus. NextSTART menus can also be launched from docks or from the shelf. In addition, a vast number of superb themes are available online in this archive sites.\n\nOS : XP/2000/Vista/Win 7\nLanguage : Multilingual\n\n","torrent":{"xt":"urn:btih:1679245771df1f3f98206bd2d6548db156f5f834","amp;dn":"Winstep+Xtreme+11.6+Multilingual","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1679245771df1f3f98206bd2d6548db156f5f834","infoHashBuffer":{"type":"Buffer","data":[22,121,36,87,113,223,31,63,152,32,107,210,214,84,141,177,86,245,248,52]},"announce":[],"urlList":[]}}