{"title":"Memoirs - Dr. Peter S. Ruckman","uid":11773655,"size":357120,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:17977b83add81213e7f6ad8f1bb6b79e9f307700&amp;dn=Memoirs+-+Dr.+Peter+S.+Ruckman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427179565,"description":"This book is an anecdotal, autobiographical account of a Bible-believing Baptist preacher in the latter half of the Twentieth Century. Like John Wesley, Dr. Ruckman could truly say his parish was the world; having ministered in nearly every State in the Union, Canada, Austria, Germany, Romania, the Ukraine, the Philippines, and India. His congregations ranged from one person in a hospital bed up to 4,000. In this work, Dr. Ruckman relates his accounts of personal, one-on-one soulwinning as well as his experiences in street and local church evangelism. He also covers his joys and struggles in the pastorate in a frank, straightforward manner. It is an entertaining read, and you will be surprised as to how much insight you will have learned concerning the ministry. A must-read for any young man who feels the Lord?s calling on his life for full-time service.\n\n\nAbout the author:\nDr. Peter S. Ruckman received his Bachelor of Arts degree from the University of Alabama and finished his formal education with six years of training at Bob Jones University (four full years and two accelerated summer sessions), completing requirements for the Master of Arts and Doctor of Philosophy degree.\nReading at a rate of seven hundred words per minute, Dr. Ruckman had managed to read about 6,500 books before receiving his doctorate, and he still reads an average of a book each day.\nDr. Ruckman stands for the absolute authority of the Authorized Version and offers no apology to any recognized scholar anywhere for his stand. In addition to preaching the gospel and teaching the Bible, Dr. Ruckman has produced a comprehensive collection of apologetic and polemic literature and resources supporting the authority of the Authorized Version of the Holy scriptures","torrent":{"xt":"urn:btih:17977b83add81213e7f6ad8f1bb6b79e9f307700","amp;dn":"Memoirs+-+Dr.+Peter+S.+Ruckman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17977b83add81213e7f6ad8f1bb6b79e9f307700","infoHashBuffer":{"type":"Buffer","data":[23,151,123,131,173,216,18,19,231,246,173,143,27,182,183,158,159,48,119,0]},"announce":[],"urlList":[]}}