{"title":"[Synth / Electronic] Razormaid &quot;i8&quot; (Razormaid remixes)","uid":3555036,"size":88235577,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:17d5158b6a5d671506d921fa3e7c4eb96184d63e&amp;dn=%5BSynth+%2F+Electronic%5D+Razormaid+%5C%22i8%5C%22+%28Razormaid+remixes%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xenu dot net","files":12,"time":1163193023,"description":"** Dedicated to papakeno *** Papakeno, your uploads at http://thepiratebay.se/user/papakeno are great...Thank you! \n\n\nRazormaid! (a.k.a. Razormaid Productions) was started in the mid 80&amp;#039;s by Joseph Watt and Art Maharg in San Francisco, California as a music service for working club DJs. Their objective was to offer something other than just the regular versions that everyone had in their record bins. They created their own special versions of songs by editing and sometimes remixing the hottest club tunes being played (or about to be played) around the world. Their re-edited tracks set them apart from every other DJ service at the time and the music that they chose was some of the most cutting edge stuff available.  Existing next to the other services (Disconet, Hot Tracks, Ultimix, and DMC), Razormaid was soon praised for their innovative sleeve designs and interesting choice of songs. It was unusual for an American company to keep in touch with the European dance music scene, as well as actually asking permission from record companies to remix the tracks of their signed artists.\n\nRazormaid has released remixes of tracks by several well-known dance artists, including Depeche Mode, New Order, Erasure, Madonna, Pet Shop Boys, Front 242, Nitzer Ebb, Cabaret Voltaire, Yello, Telex, Eurythmics, Human League, Dead or Alive, Gary Numan, Kraftwerk, Underworld and Orbital. They also have the distinction of being the first remix service to have their remixes featured on 12&quot; releases by the major labels. Razormaid created 1000 copies of each issue in vinyl through the 80s and early 90s, before becoming the first CD-only DJ service in the world. Since then, they perfected a &amp;#039;burn-to-order&amp;#039; model where they create custom CDs for their members.\n\nRazormaid hit the peak of their popularity in the late 80&amp;#039;s and early 90&amp;#039;s. During that time, some Razormaid issues were selling at local record shops for as much as $200 US. Some DJs were known to play the Razormaid version over the regular extended club mix of a song because Razormaid would edit together all of the different vocal and dub mixes together in a way that drove dance floors crazy and kept DJs smiling. Sometimes the Razormaid tunes would sound better than their regular release counterparts.\n\n\n   \tRazormaid &quot;i8&quot; (Razormaid remixes)\n\n\nDNA: La Serenissima\nInga Humpe: Riding Into Blue\nDance Robots: Das Modell\nThe Shamen: Make It Mine\nArt Academy: The Banker\nMark Of Kane: The Latest Idea\nDepeche Mode: World In My Eyes\nHard Corps: Metal &amp; Flesh\nUpfront: Dim All The Lights\nKeith LeBlanc: Tasteless Cuts\nBigod 20: I-Q (dance remix)\n\n\n\nEncoded with lame 3.97 -V4 --vbr-new (~170 kbit/s) and should be close to perceptual transparency.\n\n\nKids, always remember Xenu is your friend.\n\nwww.xenu.net\n\n","torrent":{"xt":"urn:btih:17d5158b6a5d671506d921fa3e7c4eb96184d63e","amp;dn":"%5BSynth+%2F+Electronic%5D+Razormaid+%5C%22i8%5C%22+%28Razormaid+remixes%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17d5158b6a5d671506d921fa3e7c4eb96184d63e","infoHashBuffer":{"type":"Buffer","data":[23,213,21,139,106,93,103,21,6,217,33,250,62,124,78,185,97,132,214,62]},"announce":[],"urlList":[]}}