{"title":"[PDF] [2007] Space and the 'March of Mind' Literature and the ","uid":6400732,"size":1012695,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:185621edab52896e752d9c8a6a624680db600e90&amp;dn=%5BPDF%5D+%5B2007%5D+Space+and+the+%5C%27March+of+Mind%5C%27+Literature+and+the+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"lyndavilla","files":2,"time":1305654987,"description":"DOWNLOAD MORE EBOOKS, MAGAZINES, &amp; PDFS:\n &lt;a href=&quot;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&lt;/a&gt;\n\nBOOK INFO:\n\nThis book is about the idea of space in the first half of the nineteenth century. It uses contemporary poetry, essays, and fiction as well as scientific papers, textbooks, and journalism to give a new account of nineteenth-century literature's relationship with science. In particular it brings the physical sciences--physics and chemistry--more accessibly and fully into the arena of literary criticism than has been the case until now.\n\nWriters whose work is discussed in this book include many who will be familiar to a literary audience (including Wordsworth, Coleridge, and Hazlitt), some well-known in the history of science (including Faraday, Herschel, and Whewell), and a raft of lesser-known figures. Alice Jenkins draws a new map of the interactions between literature and science in the first half of the nineteenth century, showing how both disciplines were wrestling with the same central political and intellectual concerns--regulating access to knowledge, organizing knowledge in productive ways, and formulating the relationships of old and new knowledges.\n\nSpace has become a subject of enormous critical interest in literary and cultural studies. Space and the 'March of Mind' gives a wide-ranging account of how early nineteenth-century writers thought about--and thought with--space. Burgeoning mass access to print culture combined with rapid scientific development to create a crisis in managing knowledge. Contemporary writers tried to solve this crisis by rethinking the nature of space. Writers in all genres and disciplines, from all points on the political spectrum, returned again and again to ideas and images of space when they needed to set up or dismantle boundaries in the intellectual realm, and when they wanted to talk about what kinds of knowledge certain groups of readers wanted, needed, or deserved. This book provides a rich new picture of the early nineteenth century's understanding of its own culture.\n","torrent":{"xt":"urn:btih:185621edab52896e752d9c8a6a624680db600e90","amp;dn":"%5BPDF%5D+%5B2007%5D+Space+and+the+%5C%27March+of+Mind%5C%27+Literature+and+the+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"185621edab52896e752d9c8a6a624680db600e90","infoHashBuffer":{"type":"Buffer","data":[24,86,33,237,171,82,137,110,117,45,156,138,106,98,70,128,219,96,14,144]},"announce":[],"urlList":[]}}