{"title":"Bones","uid":8553940,"size":59188023048,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:185ec5aabba7fc32ab034ac48ac408976667382d&amp;dn=Bones&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Nailit","files":168,"time":1370715943,"description":"THIS TORRENT INCLUDES SEASON 1-8. ALL OF THE FILE NAMES HAVE BEEN ARRANGED SO THAT THEY WILL BE VIEWED CORRECTLY BY XBMC.\n\nBones is an American crime comedy-drama television series that premiered on the Fox network in the United States on September 13, 2005. The show is based on forensic anthropology and forensic archaeology, with each episode focusing on an FBI case file concerning the mystery behind human remains brought by FBI Special Agent Seeley Booth (David Boreanaz) to the forensic anthropologist Dr. Temperance &quot;Bones&quot; Brennan (Emily Deschanel). The rest of the main cast includes Michaela Conlin, T. J. Thyne, Eric Millegan, Tamara Taylor, Jonathan Adams, and John Francis Daley.\n\nCreated by Hart Hanson, the series is very loosely based on the life and writings of novelist and forensic anthropologist Kathy Reichs, who also produces the show. Its title character, Temperance Brennan, is named after the protagonist of Reichs' crime novel series. Conversely, Dr. Brennan writes successful mystery novels based around a fictional (in the Bones universe) forensic anthropologist named Kathy Reichs. Bones is a joint production by Josephson Entertainment, Far Field Productions and 20th Century Fox Television.\n","torrent":{"xt":"urn:btih:185ec5aabba7fc32ab034ac48ac408976667382d","amp;dn":"Bones","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"185ec5aabba7fc32ab034ac48ac408976667382d","infoHashBuffer":{"type":"Buffer","data":[24,94,197,170,187,167,252,50,171,3,74,196,138,196,8,151,102,103,56,45]},"announce":[],"urlList":[]}}