{"title":"My Plaything Miko Lee","uid":8518870,"size":4680857600,"categoryP":"porn","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:19637e192c8d738a21522620498a4f3433b94224&amp;dn=My+Plaything+Miko+Lee&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"NoWayNo","files":315,"time":1369849335,"description":"My Plaything: Miko Lee: The world's premier Interactive Sex Simlulator has turned its sights towards Asian beauty Miko Lee. \n\nFollowing the incredible success of other volumes featuring Jenna Jameson, Tera Patrick, Stacy Valentine, and Silvia Saint, My Plaything Miko Lee is nothing short of perfection.\n\nThe craftsmen at Digital Sin have spared no expense in this most recent production which includes authentic sets and props such as shoji screens, an authentic Japanese Garden, Koi ponds, and most importantly Miko Lee herself.\n\nThis My Plaything Miko Lee, just as its predecessors, was shot exclusively for DVD and features dual camera switching, mood control, male/female orgasm control, multi-positional POV sex, and all of the added features that have made this series a international best seller. Select from Masturbation, Foreplay, Tease, and ultimately, Sex, as well as several different costumes and settings. Miko Lee in a Japanese School Girl outfit, getting nasty alone on the sybian, or out in the tranquil garden; you'll love each scenario.","torrent":{"xt":"urn:btih:19637e192c8d738a21522620498a4f3433b94224","amp;dn":"My+Plaything+Miko+Lee","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19637e192c8d738a21522620498a4f3433b94224","infoHashBuffer":{"type":"Buffer","data":[25,99,126,25,44,141,115,138,33,82,38,32,73,138,79,52,51,185,66,36]},"announce":[],"urlList":[]}}