{"title":"Pokemon Mundo Misterioso Exploradores De La Oscuridad (By TUNEO)","uid":4374745,"size":134217728,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:19b9018c5880a83130ea536d87156cc6a334cc49&amp;dn=Pokemon+Mundo+Misterioso+Exploradores+De+La+Oscuridad+%28By+TUNEO%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TUNEO","files":1,"time":1220350692,"description":"Observa el mundo a travÃƒÂ©s de los ojos de un PokÃƒÂ©mon y vive una aventura llena de incÃƒÂ³gnitas con &quot;PokÃƒÂ©mon Mundo misterioso: Exploradores de la oscuridad&quot; para Nintendo DS.\n\nUn dÃƒÂ­a te despiertas en una tierra extraÃƒÂ±a y descubres que te has convertido en un PokÃƒÂ©mon. Te haces muchas preguntas, pero sÃƒÂ³lo encontrarÃƒÂ¡s respuesta si emprendes un viaje ÃƒÂ©pico. Ã‚Â¡Por el camino, te embarcarÃƒÂ¡s en varias misiones en las que recuperarÃƒÂ¡s objetos perdidos, perseguirÃƒÂ¡s forajidos y te verÃƒÂ¡s envuelto en la bÃƒÂºsqueda de un preciado objeto que ha robado un PokÃƒÂ©mon Viajetiempo!\n\nPor supuesto, para llevar a cabo esta difÃƒÂ­cil gesta, tendrÃƒÂ¡s que buscar ayuda. Forma un Equipo explorador con unos cuantos PokÃƒÂ©mon de confianza para que recorra a tu lado el peligroso mundo misterioso. SerÃƒÂ¡ vital para tu supervivencia. Y no te olvides de entrenar a tu equipo antes de embarcarte en una nueva misiÃƒÂ³n: Ã‚Â¡EnsÃƒÂ©ÃƒÂ±ales a dominar las habilidades que les permitirÃƒÂ¡n obtener la victoria en las muchas batallas PokÃƒÂ©mon que les esperan!\n\nEl peligro acecha en cada esquina, asÃƒÂ­ que es posible que necesites mÃƒÂ¡s ayuda que la que pueden ofrecerte tus compaÃƒÂ±eros de viaje. Por suerte, la opciÃƒÂ³n &quot;Rescate de amigos&quot; con la que cuenta &quot;PokÃƒÂ©mon Mundo misterioso: Exploradores de la oscuridad&quot; te permite mandar mensajes de socorro a travÃƒÂ©s de la ConexiÃƒÂ³n Wi-Fi de Nintendo a un amigo que tenga &quot;PokÃƒÂ©mon Mundo misterioso: Exploradores del tiempo&quot; o &quot;Exploradores de la oscuridad&quot;. Si de repente te desmayas en una mazmorra, envÃƒÂ­a un grito de socorro vÃƒÂ­a inalÃƒÂ¡mbrica a tu colega y espera pacientemente.\n\nMientras esperas a que te rescaten, podrÃƒÂ¡s entretenerte con una Aventura secundaria y regresar a las mazmorras que ya has visitado. Si por el contrario, eres tÃƒÂº el que acude al rescate de un amigo, tendrÃƒÂ¡s diez intentos para salvarlo. Ã‚Â¡Y si lo consigues, obtendrÃƒÂ¡s una recompensa!\n\nÃ‚Â¡PrepÃƒÂ¡rate para una misteriosa nueva aventura de PokÃƒÂ©mon, en la que sÃƒÂ³lo tÃƒÂº y tu Equipo explorador podrÃƒÂ©is evitar que el tiempo se detenga y salvar el mundo de la oscuridad!\n\n    * Decide quÃƒÂ© PokÃƒÂ©mon eres a travÃƒÂ©s de un test de personalidad y forma un Equipo explorador para que te acompaÃƒÂ±e por las infinitas y desconocidas mazmorras.\n    * Utiliza la opciÃƒÂ³n &quot;Rescate de amigos&quot; para pedirles ayuda a tus amigos o para intercambiar objetos a travÃƒÂ©s de la conexiÃƒÂ³n inalÃƒÂ¡mbrica.\n    * Entrena los puntos fuertes de tu Equipo explorador para ganar las batallas que librarÃƒÂ¡s contra tus rivales PokÃƒÂ©mon e intenta salvar el mundo.\n\n","torrent":{"xt":"urn:btih:19b9018c5880a83130ea536d87156cc6a334cc49","amp;dn":"Pokemon+Mundo+Misterioso+Exploradores+De+La+Oscuridad+%28By+TUNEO%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19b9018c5880a83130ea536d87156cc6a334cc49","infoHashBuffer":{"type":"Buffer","data":[25,185,1,140,88,128,168,49,48,234,83,109,135,21,108,198,163,52,204,73]},"announce":[],"urlList":[]}}