{"title":"The Fast and the Furious - Tokyo Drift","uid":3501787,"size":730857472,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:19bca2921ed0ecd0939aff01820be04db7bf74ef&amp;dn=The+Fast+and+the+Furious+-+Tokyo+Drift&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fatmcgav","files":1,"time":1152410550,"description":"Fixed version of http://thepiratebay.se/details.php?id=3500634 without the album\n\nDetails:\n\nThe Fast and the Furious: Tokyo Drift (2006) \n\nAfter totaling his car in an illegal street race, Shaun Boswell is sent to live with his father, who is in the military, in Tokyo, Japan, to avoid juvy or even jail. While in school, he befriends Twinkie, a &quot;military brat.&quot; Twinkie introduces him to the world of racing in Japan. Though forbidden to drive, he decides to race against D.K., the &quot;Drift King&quot;, who has ties to the Yakuza, and loses, totaling the car because of his lack of knowledge of drifting, racing that involves dangerous hair pin turns. To repay his debt, he enters the underground world of drift street racing. As he becomes better and better, he must finally prove his worth in that world by once again racing D.K.\n\nLucas Black ....  Sean Boswell \nBrandon Brendel ....  Buddy \nZachery Ty Bryan ....  Clay \nDaniel Booko ....  Buddy \nDavid V. Thomas ....  Buddy \nAmber Stevens ....  Cheerleader \nChris Astoyan ....  Racer \nAshika Gogna ....  Cheerleader \nDanny Ray McDonald II ....  Auto Shop Bully \nNikki Griffin ....  Cindy \nLynda Boyd ....  Mrs. Boswell \nNathalie Kelley ....  Neela \nBow Wow ....  Twinkie \nLeonardo Nam ....  Morimoto \nJason J. Tobin ....  Earl \n\nSean Boswell, who has always been an outsider. A loner at school, his only connection to the indifferent world around him is through illegal street racing -- which has made him particularly unpopular with the local authorities. To avoid jail time, Sean is sent out of the country to live with his Farther in the military, in a cramped apartment in a low-rent section of Tokyo. In the land that gave birth to the majority of modified racers on the road, the simple street race has been replaced by the ultimate pedal-to-the-metal, gravity-defying automotive challenge ... drift racing, a deadly combination of brutal speed on heart stopping courses of hairpin turns and switchbacks. For his first unsuccessful foray in drift racing, Shean unknowingly takes on D.K., the &quot;Drift King,&quot; with ties to the Yakuza, the Japanese crime machine. The only way he can pay off the debt of his loss is to venture into the deadly realm of the Tokyo underworld, where the stakes are life and death.\n","torrent":{"xt":"urn:btih:19bca2921ed0ecd0939aff01820be04db7bf74ef","amp;dn":"The+Fast+and+the+Furious+-+Tokyo+Drift","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19bca2921ed0ecd0939aff01820be04db7bf74ef","infoHashBuffer":{"type":"Buffer","data":[25,188,162,146,30,208,236,208,147,154,255,1,130,11,224,77,183,191,116,239]},"announce":[],"urlList":[]}}