{"title":"Guide to Assembly Language - A Concise Introduction{BBS}","uid":6675670,"size":1752056,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1b04d0e0c223da398a06464ee638ee0a5a130232&amp;dn=Guide+to+Assembly+Language+-+A+Concise+Introduction%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1316017543,"description":"This book will enable the reader to very quickly begin programming in assembly language. Through this hands-on programming, readers will also learn more about the computer architecture of the Intel 32-bit processor, as well as the relationship between high-level and low-level languages. Topics: presents an overview of assembly language, and an introduction to general purpose registers; illustrates the key concepts of each chapter with complete programs, chapter summaries, and exercises; covers input/output, basic arithmetic instructions, selection structures, and iteration structures; introduces logic, shift, arithmetic shift, rotate, and stack instructions; discusses procedures and macros, and examines arrays and strings; investigates machine language from a discovery perspective. This textbook is an ideal introduction to programming in assembly language for undergraduate students, and a concise guide for professionals wishing to learn how to write logically correct programs in a minimal amount of time.\nFrom the Back Cover\n\nAlthough the need for assembly language programmers has decreased, the need to understand assembly language has not, and it is important to actually write assembly language code if one is to understand it thoroughly.\n\nThis Guide to Assembly Language will enable the reader to very quickly begin programming in assembly language. Through this hands-on programming, readers will also learn more about the computer architecture of the Intel 32-bit processor, as well as the relationship between high-level and low-level languages. The book can either be used as a stand-alone text in a one-semester course on assembly language, or as a supplementary text in a computer organization and architecture course.\n\nTopics and features:\n\n    * Presents an overview of assembly language, and an introduction to general purpose registers\n    * Illustrates the key concepts of each chapter with complete programs, chapter summaries, and exercises (with answers to selected exercises provided in the Appendices)\n    * Covers input/output, basic arithmetic instructions, selection structures, and iteration structures\n    * Introduces logic, shift, arithmetic shift, rotate, and stack instructions\n    * Discusses procedures and macros, and examines arrays and strings\n    * Investigates machine language from a discovery perspective\n    * Provides an overview of binary and hexadecimal, logic, and arithmetic in the Appendices, together with a Glossary, and a section on Visual C++ and MASM\n\nThis textbook/reference is an ideal introduction to programming in assembly language for undergraduate students in computer science, as well as a concise guide for professionals wishing to learn how to write logically correct programs in a minimal amount of time.\n\nDr. James T. Streib is Professor and Chair of Computer Science at Illinois College, Jacksonville, Illinois USA.\nProduct Details\n\n    * Hardcover: 270 pages\n    * Publisher: Springer; 1st Edition. edition (March 14, 2011)\n    * Language: English\n    * ISBN-10: 0857292706\n    * ISBN-13: 978-0857292704","torrent":{"xt":"urn:btih:1b04d0e0c223da398a06464ee638ee0a5a130232","amp;dn":"Guide+to+Assembly+Language+-+A+Concise+Introduction%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b04d0e0c223da398a06464ee638ee0a5a130232","infoHashBuffer":{"type":"Buffer","data":[27,4,208,224,194,35,218,57,138,6,70,78,230,56,238,10,90,19,2,50]},"announce":[],"urlList":[]}}