{"title":"I Testify Against the Jews - Robert Edmondson","uid":4596186,"size":12743960,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1b53d7e02065903e4fe741e715982bf874e869f3&amp;dn=I+Testify+Against+the+Jews+-+Robert+Edmondson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CuriousGeorge","files":1,"time":1230018106,"description":"Description \nRobert Edmondson was thrown into jail in 1936 and again in 1942 for producing hundreds of bulletins alerting his fellow Americans to an International conspiracy financed by the central bankers and consisting largely of Communist Jews. This conspiracy has grown into the New World Order.\n\nIn 1936, Edmondson was charged with &quot;libeling the Jewish people.&quot; In his defense, he wrote, &quot;I am not against Jews because of their religion, as a race, a people or as individuals, but because Jewish leadership [i.e. the bankers] is actively anti-American, is attempting to jettison the American political philosophy and take over the Country, and that I would continue to be anti-Jewish until Jewry repudiated such subversion. Were the offender any other than the Jewish minority, my attitude would be precisely the same. This problem is the biggest and most acute thing in the world today....\n\n&quot; Knowing that pitiless publicity is the only cure for public evils, in 1934 I started on a campaign to expose Jewish Anti-Americanism and Talmudic Communism which has been called the &quot;Code of Hell&quot;: a &quot;Rabbi Racket&quot; that victimizes its own followers; an international &quot;Satanic System&quot; subverting France, Britain, Germany and Russia, causing the present depression and moving to take over the United States through the Jewish Radical administration [of FDR.] &quot; (p.69)\n\nFaced with exposure, organized Jewry backed down. Edmondson subpoenaed &quot;Princes of Jewry&quot; Bernard Buruch, Henry Morganthau, Rabbi Wise, Samuel Untermeyer, Mayor LaGuardia, James P. Warburg, Walter Lippmann and Justice Samuel Rosenman. Whereupon the American Jewish Committee petitioned the court NOT to hear the case because the indictment violated the free speech guarantee of the Constitution.\n\n&quot;Jews are afraid of the truth,&quot; Edmondson wrote. &quot;They know that a few grains of it will blow the lid off when publicized.&quot; (137)\n\nIn 1954, Robert Edmondson published a collection of his bulletins entitled &quot;I Testify Against the Jews.&quot; \n\nHe quotes rare documents such as a letter published in 1880 in the Review of Jewish Studies, financed by James de Rothschild. The letter, dating from 1489, is from the head of the Grand Sanhedrin in Constantinople. It advises a rabbi in Arles France to infiltrate gentile society.\n\nThe Grand Satraps and Rabbis told the rabbi to convert to Christianity as the French King demands but &quot;keep the Law of Moses in your hearts;&quot; make your sons merchants so &quot;that they may despoil Christians of their property; doctors so that &quot;they may take away Christian lives.&quot;\n\n&quot;Make your sons canons and clerics that they may destroy the churches.....Arrange that your sons become advocates and lawyers, and see that they always mix themselves up with affairs of state in order that by putting Christians under your yoke, you may dominate the world and be avenged on them.&quot; (71)\n\nEdmondson also quotes a May 11 1933 address at the Hebrew University by the famous Jewish poet N.H. Bialik which confirms a Jewish agenda few Jews are aware of. He says Jews have undermined Christianity by &quot;deliberate Jewish conniving...it has been effected in great measure by crypto Jews (secret Jews) who have permeated Christianity and spoken through the mouth of Christianity.&quot; (51)\n\nHe says these crypto Jews are also the creators of &quot;the Renaissance, of Liberalism, of Democracy, of Socialism, and of Communism.&quot; (151)\n\nRemember he was speaking in 1933: &quot;The Gentiles have at last realized this secret--that Judaism has gradually penetrated and permeated them like a drug. The Gentile nature is in revolt, and is trying to organize the final battle...They would 'smoke us out' of all the cracks and crannies where we have hidden. They would exterminate us like bacilli and be rid of us.&quot; (152) (Judaism in History-A Jewish Conception in &quot;Lines of Communication&quot; July 1933)\n\nJudaism is a conspiracy against Christian Western civilization which has succeeded to such an extent that it cannot even be mentioned. \n\n 308 Pages\n\n","torrent":{"xt":"urn:btih:1b53d7e02065903e4fe741e715982bf874e869f3","amp;dn":"I+Testify+Against+the+Jews+-+Robert+Edmondson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b53d7e02065903e4fe741e715982bf874e869f3","infoHashBuffer":{"type":"Buffer","data":[27,83,215,224,32,101,144,62,79,231,65,231,21,152,43,248,116,232,105,243]},"announce":[],"urlList":[]}}