{"title":"Il Caso Scafroglia Tutti i Torrent [TVrip ITA] TNT Village","uid":6870744,"size":395500,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1ce179fdaf7c9f21fd2ebb16e21470ac908e6c64&amp;dn=Il+Caso+Scafroglia+Tutti+i+Torrent+%5BTVrip+ITA%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"l.diliberto","files":4,"time":1323268402,"description":"Il Caso Scafroglia Tutti i Torrent [TVrip ITA] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=274050&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=274050&lt;/a&gt;\n\nCorrado Guzzanti, oltre a curare la regia insieme a Igor Skofic e la scrittura con Andrea Salerno, impersonava l'anonimo conduttore del programma, che racchiudeva in sÃƒÂ© le peggiori caratteristiche del mondo dei media e dello spettacolo: morbositÃƒÂ , superficialitÃƒÂ , disincanto e costante ricerca del sensazionalismo. Ospite fisso era Padre Federico (Marco Marzocca), che incarnava il clichÃƒÂ© del sacerdote codino e retrogrado, in generale lontano dalla realtÃƒÂ  e dalla gente comune. Lo scontro tra il perbenismo del sacerdote e il cinismo sprezzante del conduttore (che lo provoca in continuazione storpiandone il nome, o con frecciate del tipo Ã‚Â«Il vero Messia era ElvisÃ‚Â», Ã‚Â«I quattro Vangeli corrispondono ai quattro elementi terra, aria, acqua, fuocoÃ‚Â», Ã‚Â«Va bene la castitÃƒÂ , ma negli anni settanta c'ÃƒÂ¨ chi si ÃƒÂ¨ divertitoÃ‚Â») dava luogo a parecchi dialoghi esilaranti.\n\nIl distacco dalla realtÃƒÂ  di Padre Federico era evidente durante &quot;L'angolo delle telefonate&quot;: un momento, presente in ogni puntata, nel quale il religioso rispondeva alle chiamate dei giovani che tornavano dalle discoteche (il che, a suo dire, accadrebbe verso le ore 22-23). Intendeva cosÃƒÂ¬ proporsi come sorta di &quot;telefono amico&quot; per cercare di allontanarli dalla perdizione dell'alcol, della droga e delle corse in automobile. Invariabilmente non chiamava nessun giovane, bensÃƒÂ¬ un solitario telespettatore abruzzese (impersonato ancora da Guzzanti): quest'ultimo, caduto in esilaranti equivoci (per esempio dare Grazia a Sofri, la direzione della rivista Grazia; la cittÃƒÂ  dello Stato anzichÃƒÂ© laicitÃƒÂ ; l'arresto del tenore Caruso invece che l'attivista politico omonimo), protestava vibratamente contro quanto detto durante la trasmissione.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img338.imageshack.us/img338/9949/9788817006927g.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img338.imageshack.us/img338/9949/9788817006927g.jpg&lt;/a&gt;\n\n.: Crediti :.\n\nAnni di produzione 2002\nGenere satirico - di analisi politica\nPresentato da Corrado Guzzanti\nEmittente Rai 3\nRegista Corrado Guzzanti - Igor Skofic\n\nvulvia, procace annunciatrice del canale scientifico Rieducational Channel;\nfascisti su marte, una serie di cinegiornali che raccontano una veritÃƒÂ  per troppo tempo celata, la conquista del Pianeta Rosso da parte del regime fascista;\nil boss mafioso che, rinchiuso in carcere assieme al suo picciotto, trae vantaggio dalle leggi in tema di giustizia dell'allora governo Berlusconi ricusando tutti i giudici e scegliendo Honolulu come sede processuale;\nil massone, che oscura la trasmissione impadronendosi delle frequenze per dare delle comunicazioni di servizio ai confratelli per l'organizzazione di manovre eversive;\nil vecchio personaggio Lorenzo in qualitÃƒÂ  di critico cinematografico (caricatura di Enrico Ghezzi);\nimitazioni di personalitÃƒÂ  del calibro di Giulio Tremonti, Gabriele La Porta, Francesco Rutelli e Edward Luttwak.\n\nAlla trasmissione partecipÃƒÂ² anche Caterina Guzzanti in piÃƒÂ¹ ruoli:\n\nuna dottoressa incaricata di ricostruire il volto dello scomparso Scafroglia;\nuna ragazza trasferita telematicamente in Svizzera, come fosse una somma di denaro, e lÃƒÂ¬ prigioniera di un conto cifrato;\nuna dislessica e vanesia Miss Italia;\nun cucciolo di NOCS russo, smarritosi all'interno degli studi della Rai durante le operazioni di cattura del consiglio d'amministrazione e della presa del palazzo;\nuna psicologa (Dottoressa Acceprane) interrogata a proposito della presunta timidezza di Dio - egli infatti si nasconde agli occhi di tutti; dimostra scarsa severitÃƒÂ , eccezion fatta per alcune sfuriate, allontanandosi cosÃƒÂ¬ dalla ben maggiore espansivitÃƒÂ  degli Dei greci; non aver avuto genitori avrÃƒÂ  probabilmente influito sul carattere &quot;chiuso&quot; di Dio -;\nun angelo mandato per punire il conduttore Antonio Socci, ma che invece sbaglia studio, entrando in quello de Il caso Scafroglia e annunciando un parto doloroso per il conduttore, il quale risponde negando questa possibilitÃƒÂ , dato che lui usa il diaframma.\n\nDa segnalare anche la partecipazione in una puntata di Fiorella Mannoia, invitata a parlare di problemi di attualitÃƒÂ , e che si ritrova invece vittima delle pesanti avances del conduttore; e di Antonio Albanese, nei panni di un elettore di centrodestra cocainomane.\n\n0=============================0\n\n.: Info Ripping :.\n\nDimensione: 1.38 GB\nDurata: 2:35:32\n\nVideo Codec: DivX 5.0.2\nVideo Bitrate: 1137\nRisoluzione: 512 x 384\nFPS (Frames/sec): 25\nQF (Frame quality): 0.231\n\nAudio Codec: MP3\nAudio Bitrate: 128 kb/s tot\nFreq Audio: 44100Hz","torrent":{"xt":"urn:btih:1ce179fdaf7c9f21fd2ebb16e21470ac908e6c64","amp;dn":"Il+Caso+Scafroglia+Tutti+i+Torrent+%5BTVrip+ITA%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ce179fdaf7c9f21fd2ebb16e21470ac908e6c64","infoHashBuffer":{"type":"Buffer","data":[28,225,121,253,175,124,159,33,253,46,187,22,226,20,112,172,144,142,108,100]},"announce":[],"urlList":[]}}