{"title":"Murray.Rothbard.Audio.Collection-chakra71","uid":4321244,"size":765995507,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1d9942fc1c180d7f28a6476207b2ed1e264c471f&amp;dn=Murray.Rothbard.Audio.Collection-chakra71&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chakra71","files":80,"time":1217483144,"description":"Get your degree in Austrian Economics with this compilation of Murray N. Rothbard audiobooks and lectures.  Everything here has been sourced from http://www.mises.org so please check out their site and buy a Rothbard T-Shirt while you're there!\n\nContents:\n1) Ethics of Liberty - Audiobook\n2) For a New Liberty - Audiobook\n3) History of Economic Thought - Lecture Series\n4) Random Lectures &amp; Articles\n5) What Has Government Done to Our Money? - Audiobook\n\n----- 1) Ethics of Liberty - Audiobook -----\n\nMurray Rothbard's greatest contribution to the politics of freedom is back in print. Following up on Mises's demonstration that a society without private property degenerates into economic chaos, Rothbard shows that every interference with property represents a violent and unethical invasion that diminishes liberty and prosperity.\n\nFirst published in 1982, The Ethics of Liberty is a masterpiece of argumentation, and shockingly radical in its conclusions. Rothbard says that the very existence of the state--the entity with a monopoly privilege to invade private property--is contrary to the ethics of liberty. A society without a state is not only viable; it is the only one consistent with natural rights.\n\nWhen it first appeared, the book was ignored by the scholarly world. Robert Nozick's treatise, taking a much softer view, was heralded instead. Nozick has since moved on to social democracy. Meanwhile, Rothbard's primary philosophical work went out of print and then virtually disappeared. Foreign-language editions have appeared, but the English version was unavailable.\n\nBut times have changed. For believers in liberty, Rothbard is an invaluable intellectual asset. At last, his most rigorous argument is available again, and in the stirring prose he is famous for.\n\nIn this volume, Rothbard first familiarizes the reader with Natural Law theory. After this ethical introduction, he goes on to address numerous ethical issues, showing how liberty is in the right in every case. In the final two sections, Rothbard enumerates the state's role in society as inherently anti-liberty, and details the structure of alternate theories of liberty.\n\n\n----- 2) For a New Liberty - Audiobook -----\n\nIn For A New Liberty: The Libertarian Manifesto, Rothbard proposes a once-and-for-all escape from the two major political parties, the ideologies they embrace, and their central plans for using state power against people. Libertarianism is Rothbard's radical alternative that says state power is unworkable and immoral and ought to be curbed and finally overthrown.\n\nTo make his case, Rothbard deploys his entire system of thought: natural law, natural rights, Austrian economics, American history, the theory of the state, and more.\n\nIt is relentless, scientific, analytical, and morally energetic?a book that makes an overwhelming case. Indeed, it gave an entire movement its intellectual consciousness and earned Rothbard the titles &quot;Mr. Libertarian&quot; and &quot;The State's Greatest Living Enemy.&quot;\n\nSociety without the nation state? Rothbard shows that this is the way for peace, prosperity, security, and freedom for all. In the entire history of libertarian ideas, no book has more successfully combined ideological rigor, theoretical exposition, political rhetoric, historical illustration, and strategic acumen. Rothbard poured a lifetime of research and all his intellectual energy into this project and he succeeded in writing a classic.\n\n\n----- 3) History of Economic Thought - Lecture Series -----\n\nMurray Rothbard died before he could write his third volume of his famous History of Economic Thought that would cover the birth and development of the Austrian School, through the Keynesian Revolution and Chicago School. However, he had already mapped out the entire project.\n\nFortunately, the Mises Institute had Rothbard lecture on his discoveries and analysis of this period while he was researching the topic. The tapes were only recently discovered. We re-mastered them, and put them on a single MP3-CD: nearly seven hours of lectures.\n\nWith this CD, the History of Economic Thought is complete. The quality of both the audio and the intellectual content is high. He discusses Menger and the birth of Austrian economics, Mises and his struggles, Hayek and his contemporaries, and the loss of direction to the Austrian school in the 1970s. He talks about the rise of the Misesian branch in the 1980s and following.\n\nThese recordings are a treasure!\n\nSix lectures in mp3 audio format; nearly seven hours of audio \n\n\n----- 5) What Has Government Done to Our Money? - Audiobook -----\n\nThe Mises Institute has united this book with its natural complement: a detailed reform proposal for a 100 percent gold dollar. &quot;The Case for a 100 Percent Gold Dollar&quot; was written a decade before the last vestiges of the gold standard were abolished. His unique plan for making the dollar sound again still holds up. Some people have said: Rothbard tells us what is wrong with money but not what to do about it. Well, by adding this essay, the problem and the answer are united in a comprehensive whole.\n\nAfter presenting the basics of money and banking theory, he traces the decline of the dollar from the 18th century to the present, and provides lucid critiques of central banking, New Deal monetary policy, Nixonian fiat money, and fixed exchange rates. He also provides a blueprint for a return to a 100 percent reserve gold standard.\n\nThe book made huge theoretical advances. He was the first to prove that the government, and only the government, can destroy money on a mass scale, and he showed exactly how they go about this dirty deed. But just as importantly, it is beautifully written. He tells a thrilling story because he loves the subject so much.\n\nThe passion that Murray feels for the topic comes through in the prose and transfers to the reader. Readers become excited about the subject, and tell others. Students tell professors. Some, like the great Ron Paul of Texas, have even run for political office after having read it.\n\nRothbard shows precisely how banks create money out of thin air and how the central bank, backed by government power, allows them to get away with it. He shows how exchange rates and interest rates would work in a true free market. When it comes to describing the end of the gold standard, he is not content to describe the big trends. He names names and ferrets out all the interest groups involved.\n\nSince Rothbard's death, scholars have worked to assess his legacy, and many of them agree that this little book is one of his most important. Though it has sometimes been inauspiciously packaged and is surprisingly short, its argument took huge strides toward explaining that it is impossible to understand public affairs in our time without understanding money and its destruction.\n\nPlease download, listen, seed, and educate others!","torrent":{"xt":"urn:btih:1d9942fc1c180d7f28a6476207b2ed1e264c471f","amp;dn":"Murray.Rothbard.Audio.Collection-chakra71","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d9942fc1c180d7f28a6476207b2ed1e264c471f","infoHashBuffer":{"type":"Buffer","data":[29,153,66,252,28,24,13,127,40,166,71,98,7,178,237,30,38,76,71,31]},"announce":[],"urlList":[]}}