{"title":"Blood and Shadows - Torrent Edition","uid":8773594,"size":1211305,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f0ee9d35cd2c9797be752107bb796e92486f177&amp;dn=Blood+and+Shadows+-+Torrent+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dayne87","files":1,"time":1375503798,"description":"Shadows stretch across the land as the denizens of the underworld unite under a single deadly leader and threaten to bathe the magical kingdom of Tar Ebon in blood, dooming mankind. To answer the threat, Dawyn Darklance, the champion of the king and time bender, along with his companions, the fierce druid Anwyn, the fiery mage Alivia and the flamboyant minstrel Favio must travel across the terrified land to bring justice upon the leader of the assassins, Lord Garik, and his allies, the mysterious veiled assassin and arrogant mage. Along the way Dawyn and his companions will encounter dangerous enemies, stout allies and uncover a secret threat that could yet doom the world.\n\nThis novel, the first in a series, by a talented novelist introduces readers to the world of Tar Ebon, a place where  magic pervades and dangerous creatures lurk in the far reaches of the world. This book will leave you entranced by the characters and begging for more.\n\nNote that the original seeder of this torrent is the owner and copyright holder of this ebook. ","torrent":{"xt":"urn:btih:1f0ee9d35cd2c9797be752107bb796e92486f177","amp;dn":"Blood+and+Shadows+-+Torrent+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f0ee9d35cd2c9797be752107bb796e92486f177","infoHashBuffer":{"type":"Buffer","data":[31,14,233,211,92,210,201,121,123,231,82,16,123,183,150,233,36,134,241,119]},"announce":[],"urlList":[]}}