{"title":"Sexually BrokenSuper hot MILF with huge tits Angelina Valentine","uid":7923675,"size":1409873119,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:1fd0695d80922b8802554d120d21bf06aac3ede2&amp;dn=Sexually+Broken%5CSuper+hot+MILF+with+huge+tits+Angelina+Valentine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1355529291,"description":"Sexually Broken---Super hot MILF with huge tits Angelina Valentine Matt Williams\n\n \n\n \n\n \n\nSuper hot MILF with huge tits, suffers amazing rope bondage, get face fucked made to cum! | Angelina Valentine | Matt Williams\n\n \n\nDecember 14, 2012 \n\n \n\n  \n\nMP4 only.    \n\n    \n\n \n\nWelcome Angelina Valentine to the pages of Sexually Broken. This amazingly hot MILF has a body that small nations would go to war over. Huge tits, tiny waist, sexy phat ass and lips to die for. Angelina has an XRCO Deep Throat Award under her belt. We are about to see if that award was warranted. \n\n \n\nAngelina starts with her elbows bound. We have her slowly show off her amazing body. She teases us, flaunts her amazing ass and her huge boobs. After we are sufficiently aroused, we put a hard cock in front of her amazing blow job lips and let her worship the cock with her mouth. \n\n \n\nQuickly bored with her slow sensual blow job, we get rough. We start fucking her mouth. We want to see if that award was justified. We now control her with cock, we control when she breathes, when she swallows. We fuck her throat deep and rough. She struggles, we get harder. \n\n \n\nIt's time to see that amazing body in all it's glory. We cut off her clothes and position her in-between two pillars. The neck is bound into place, the wrist pulled out and the legs spread. Angelina is on her knees and her mouth is at the right height for an epic skull fucking.\n\n \n\nWe come from behind with a powerful vibrator and attack her pussy with a vengeance. We make Angelina cum over and over. She struggles in vain her clit gets over sensitive. We don't care, we just make her cum again. Almost exhausted and out of breath we jam out cock all the way down her throat again. She struggle for air and we fuck the hell out of her tight throat. In the end Angelina is a drooling mess, totally destroyed by cock and orgasms.  \n\n \n\nScreens\n &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/12_14angelina/SexuallyBroken-Angelina-Valentine-Matt-Williams-Super-hot-MILF-with-huge-tits-suffers-amazing-rope-bondage-get-face-fucked-made-to-cum.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/12_14angelina/SexuallyBroken-Angelina-Valentine-Matt-Williams-Super-hot-MILF-with-huge-tits-suffers-amazing-rope-bondage-get-face-fucked-made-to-cum.php&lt;/a&gt;\n\n \n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n\n  \n\nCheers  :-)  \n","torrent":{"xt":"urn:btih:1fd0695d80922b8802554d120d21bf06aac3ede2","amp;dn":"Sexually+Broken%5CSuper+hot+MILF+with+huge+tits+Angelina+Valentine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fd0695d80922b8802554d120d21bf06aac3ede2","infoHashBuffer":{"type":"Buffer","data":[31,208,105,93,128,146,43,136,2,85,77,18,13,33,191,6,170,195,237,226]},"announce":[],"urlList":[]}}