{"title":"J.K.Rowling - Harry Potter - En de relieken van de dood (deel 7)","uid":5360855,"size":693843,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:202054fda3315c454aec7770acfbadcfaa40e5ec&amp;dn=J.K.Rowling+-+Harry+Potter+-+En+de+relieken+van+de+dood+%28deel+7%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"soap22","files":6,"time":1266092350,"description":"J.K.Rowling - Harry Potter en de relieken van de dood\n\nBeschrijving\nHarry staat voor een duistere, gevaarlijke en haast onmogelijke taak: hij moet de overgebleven Gruzielementen van Voldemort opsporen en vernietigen. Nooit eerder voelde Harry zich zo eenzaam en onzeker over zijn toekomst. Maar het is aan hem om de kracht te vinden om de zware taak goed te volbrengen. Om zonder angst of aarzeling \naan zijn lange, zware reis te beginnen, moet Harry eerst zijn veilige omgeving verlaten... \nIn deel 7, het allerlaaste deel in de Harry Potter-serie, geeft J.K. Rowling eindelijk antwoord op vragen die fans al jaren beantwoord willen zien. Opnieuw bewijst Rowling een meester in het vertellen van verhalen vol onverwachte wendingen te zijn. Ook dit boek zal weer verslonden worden!\n\nNu auteur J.K. Rowling het allerlaatste deel van haar succesvolle Harry Potter-serie heeft afgerond, is haar hart gebroken. De schrijfster zegt 'in rouw' te zijn, het afscheid van alle personages viel haar zwaar. Eerder werd al bekend dat een aantal hoofdpersonen het niet overleeft in het allerlaatste boek. Maar Rowling is vooral ook trots op haar prestatie. Ze kan zelf nog nauwelijks geloven dat ze na al die jaren echt een einde aan de serie heeft geschreven. Rowling is van mening dat het zevende deel uit de serie haar beste werk is. \n\nWat kunnen we verwachten in het zevende deel van Harry Potter? \n- Harry Potter wordt 17 jaar;\n- Harry gaat aan zijn zevende schooljaar beginnen op Zweinstein (als de school tenminste open gaat na de zomervakantie). Hij mag voor het eerst ook toverkunst gebruiken buiten Zweinstein; \n- Bill, de broer van Ron Wezel, gaat trouwen met zijn grote liefde Fleur;\n- Er zal een beslissend gevecht zijn tussen Harry en Voldemort. ","torrent":{"xt":"urn:btih:202054fda3315c454aec7770acfbadcfaa40e5ec","amp;dn":"J.K.Rowling+-+Harry+Potter+-+En+de+relieken+van+de+dood+%28deel+7%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"202054fda3315c454aec7770acfbadcfaa40e5ec","infoHashBuffer":{"type":"Buffer","data":[32,32,84,253,163,49,92,69,74,236,119,112,172,251,173,207,170,64,229,236]},"announce":[],"urlList":[]}}