{"title":"Alex Scarrow - Last Light","uid":10353875,"size":607650363,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:206ad85d966d081a84438cf8d6eccebcc2ac5828&amp;dn=Alex+Scarrow+-+Last+Light&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1402708474,"description":"Unabridged. 80kbps. Read by David John.\n\n\n\nIt begins on a very normal Monday morning. But in the space of only a few days, the world's oil supplies have been severed and at a horrifying pace things begin to unravel everywhere. This is no natural disaster?someone is behind this. Oil engineer Andy Sutherland is stranded in Iraq with a company of British soldiers, desperate to find a way home, trapped as the very infrastructure of daily life begins to collapse around him. Back in Britain, his wife Jenny is stuck in Manchester, fighting desperately against the rising chaos to get back to their children in London as events begin to spiral out of control?riots, raging fires, looting, rape, and murder. In the space of a week, London is transformed into an anarchic vision of hell. Meanwhile, a mysterious man is tracking Andy's family. He'll silence anyone who can reveal the identities of those behind this global disaster. The people with a stranglehold on the future of civilization have flexed their muscles at other significant tipping points in history, and they are prepared to do anything to keep their secret?and their power?safe.\n\n\n\n\n&gt;--- This Audiobook was converted and uploaded by OldScotsman ---&lt;","torrent":{"xt":"urn:btih:206ad85d966d081a84438cf8d6eccebcc2ac5828","amp;dn":"Alex+Scarrow+-+Last+Light","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"206ad85d966d081a84438cf8d6eccebcc2ac5828","infoHashBuffer":{"type":"Buffer","data":[32,106,216,93,150,109,8,26,132,67,140,248,214,236,206,188,194,172,88,40]},"announce":[],"urlList":[]}}