{"title":"Pet Photography 101 (Focal Press)  [ZDaddy]","uid":5997787,"size":14536228,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21cc42c310185568739f91dc3e72569e02639e10&amp;dn=Pet+Photography+101+%28Focal+Press%29++%5BZDaddy%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZDaddy","files":1,"time":1291081968,"description":"Publisher: Focal Press (October 22, 2009)\nLanguage: English\n\nISBN-10: 0240812158\nISBN-13: 978-0240812151\n\n206 pages | PDF\n\n\nExample Tips:\n\nTip #1 Should you buy a DSLR, or a high-end Point and Shoot (a.k.a. a compact camera) to photograph your pets and other family members? What about a camera that can do both stills and video? Andrew gives an overview of what's out there and how to find just the right camera (or cameras) for you and your family. He also covers tips for taking better photos with your camera phone/smartphone.\n\nTip #24 Learn how to find inexpensive, yet powerful handheld reflectors around the house, in your local hardware store or at another retailer, and find out what specific light stands and accessories you can use to hold them in place. Also learn techniques for using the sun as a &quot;lightbulb in the sky.&quot;\n\nTip #49 Valuable tips for getting your pets to stand still so that you can get great photographs of them (this is the pet photography question Andrew is most frequently asked!). Other suggestions in this tip include ways to get your pets moving around in interesting ways for better still photos or video clips.\n\nTip #83 This tip covers an important yet often overlooked topic-organizing your photos. Andrew introduces the process and links to an online step-by-step tutorial with downloadable folders for keeping your images organized (whether you use Mac or Windows).\n\nTip #99 This tip covers the reasons why continuous-tone photo prints from a photo lab or retail store are a great option. It also includes additional resources, including a link to a 4 x 6-inch calibration file on the companion site to help make sure you are getting proper color, density and sharpness.\n\nThe book's companion site: www.PhotoPetTips.com, contains additional links, tips and information as well as free excerpts-including all of Chapter 2 as a free downloadable PDF.\n\n* Professional results with easy and fun techniques for posing pets, lighting, post production and more!\n* Loaded with adorable and inspirational photographs of pets\n* Quirky and inviting tips showing you how to make your photos better!\n\n\n","torrent":{"xt":"urn:btih:21cc42c310185568739f91dc3e72569e02639e10","amp;dn":"Pet+Photography+101+%28Focal+Press%29++%5BZDaddy%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21cc42c310185568739f91dc3e72569e02639e10","infoHashBuffer":{"type":"Buffer","data":[33,204,66,195,16,24,85,104,115,159,145,220,62,114,86,158,2,99,158,16]},"announce":[],"urlList":[]}}