{"title":"The Dismemberment Plan - Uncanney Valley (2013) [FLAC]","uid":8982488,"size":273794256,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2335a548b6af72fd3eeb51deea17140a70567975&amp;dn=The+Dismemberment+Plan+-+Uncanney+Valley+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1380594447,"description":"\n  The Dismemberment Plan - Uncanney Valley (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie Rock, Emo\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 No One's Saying Nothing\n  02 Waiting\n  03 Invisible\n  04 White Collar White Trash\n  05 Living In Song\n  06 Lookin'\n  07 Daddy Was a Real Good Dancer\n  08 Mexico City Christmas\n  09 Go and Get It\n  10 Let's Just Go To the Dogs Tonight\n\n  Washington, D.C.-based emo quartet the Dismemberment Plan -- frontman Travis Morrison, guitarist Jason Caddell, bassist Eric Axelson, and drummer Joe Easley -- debuted in 1994 with the single &quot;Can We Be Mature?,&quot; signing to DeSoto to release the full-length ! in the fall of 1995. The Dismemberment Plan Is Terrified followed a year and a half later, and after releasing 1998's The Ice of Boston EP on major-label Interscope, the group returned to DeSoto for 1999's Emergency &amp; I. In early 2001, the Dismemberment Plan and Juno issued the Split Release EP, which featured new songs and covers from each of the bands. Following tours with Death Cab for Cutie, the band released their fourth studio album, Change, in 2001. The band put the music of the album on the website and invited their fans to remix the songs, the results were featured on the 2002 compilation A People's History of the Dismemberment Plan. Unexpectedly in 2003, the band announced that they were splitting up and held their last &quot;farewell&quot; concert at Washington D.C's 9:30 Club on September 1, 2003. In 2007, the band announced they were re-forming for a one-off benefit concert for the son of J. Robbins of the band Jawbox who was diagnosed with spinal muscular atrophy. Tickets for the show sold out within minutes and the band, who were overwhelmed with the positive response from the fans, announced another show but stated that this would be their last. The band would actually re-form for good in 2011, with a rafter of live dates being announced. In 2013, the band released the single &quot;Waiting&quot; as a precursor to their fifth studio album, Uncanney Valley, which was slated for release later that year.","torrent":{"xt":"urn:btih:2335a548b6af72fd3eeb51deea17140a70567975","amp;dn":"The+Dismemberment+Plan+-+Uncanney+Valley+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2335a548b6af72fd3eeb51deea17140a70567975","infoHashBuffer":{"type":"Buffer","data":[35,53,165,72,182,175,114,253,62,235,81,222,234,23,20,10,112,86,121,117]},"announce":[],"urlList":[]}}