{"title":"Smarty Uninstaller v4.4.0","uid":13623253,"size":6671185,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:242b81082abfd71525a05c728211263269af218c&amp;dn=Smarty+Uninstaller+v4.4.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZarkBit","files":1,"time":1455987555,"description":"Smarty Uninstaller v4.4.0\r\n\r\nEnsures complete Uninstall\r\n\r\nSmarty Uninstaller is a software that allows you to completely uninstall programs (64 and 32-bit) installed on your system. It monitors the built-in application uninstaller and uses an advanced scan engine that deletes any program leftovers. It allows you to launch the scan engine manually at any time to force uninstall a program with broken uninstaller.\r\n\r\n\r\nDetects all changes to your system\r\n\r\nIn addition to the smart scan engine, Smarty Uninstaller provides you with an easy to use but effective feature – Smarty Snapshot. It allows you to monitor the installation of new applications and detect every change made to your system during this process. These changes are saved to the snapshot, that can be accessed later at any time for review or complete uninstall.\r\n\r\n\r\nEasily manage programs\r\n\r\nThe grouping feature allows you to organize applications into logical groups and view grouped programs in separate tabs. You can add comments to installed applications which will be displayed on the main window when an application is selected.\r\n\r\n\r\nIntuitive and modern interface\r\n\r\nFeaturing an intuitive and modern interface, Smarty Uninstaller displays in the main window all installed software, broken installations, system components and Windows updates.\r\n\r\n\r\nFully compatible\r\n\r\nSmarty Uninstaller has been developed and fully tested to work great on Windows® 8 and other Windows® operating systems, from Windows® XP and up. No matter what you own - a PC or a laptop or netbook or tablet.\r\n\r\n\r\nFeatures at a glance\r\n\r\n    Easy to use\r\n    Using Smarty Uninstaller is simple, thanks to the easy to use and modern user interface. Allows you to uninstall unwanted applications in a few clicks. Smarty Uninstall is also faster than standard Add/Remove Programs tool.\r\n\r\n    Smart scan engine\r\n    Scans your computer for traces left by application and deletes them even if regular uninstaller does not work. Monitors application setup and saves a snapshot for complete uninstall in the future.\r\n\r\n    View, sort, group\r\n    Smarty Uninstaller will show possible broken installations, installed programs, system components and Windows Updates. Allows you to group and sort applications the ways you like","torrent":{"xt":"urn:btih:242b81082abfd71525a05c728211263269af218c","amp;dn":"Smarty+Uninstaller+v4.4.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"242b81082abfd71525a05c728211263269af218c","infoHashBuffer":{"type":"Buffer","data":[36,43,129,8,42,191,215,21,37,160,92,114,130,17,38,50,105,175,33,140]},"announce":[],"urlList":[]}}