{"title":"PathPix Laugh v1.0","uid":8934877,"size":3605697,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:250561e3f0db1da54ad5a18f68f74e0b8cb6bb36&amp;dn=PathPix+Laugh+v1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1379540949,"description":"\nPathPix Laugh has 202 all-new picture logic puzzles to keep you smiling.\nEasy to Extreme - graduated difficulty and sizes.\nDraw bright bold lines of color, connecting pairs of colored numbers with paths of the same length.\n\nFind the unique solution to each puzzle and discover a little piece of pixel art.\nAs an extra reward you get a silly joke or quote related to the picture you have made.\n\nCHOOSE from 7 different PathPix apps, each with a DIFFERENT assortment of puzzles.\n\n---PATHPIX LITE: Wondering if PathPix is for you? Start here.\n---PATHPIX: Hooked? This is the next step, with 189 graduated levels, ranging from small, easy puzzles to large, advanced level puzzles.\n---PATHPIX PRO: Are you an expert? Looking for a LOT of puzzles? Then PathPix Pro is for you, with 320 puzzles, ranging from Medium difficulty to Extreme.\n---PATHPIX ZEN: Want more puzzles? PathPix Zen contains 99 beautiful, all-new puzzles, including an Advanced Levels section with 12 special challengers.\n---PATHPIX JOY: More puzzles! PathPix Joy contains 99 all-new puzzles to provide many more happy hours of PathPix fun. Small to large, easy to advanced - you'll find it all here.\n---PATHPIX MAGIC: Truly the most magical PathPix of all, PathPix Magic includes 99 puzzles, small to huge, easy to advanced. Magic of all kinds!\n---PATHPIX LAUGH: 202 puzzles to tickle your funnybone, each with a silly joke or quote related to the puzzle picture. Wide range of sizes (16x16 to 50x50) and difficulty levels (easy to extreme).\n\nSIMPLE RULES - COMPLEX PUZZLES - HIDDEN PICTURES!\nDraw paths with your finger, connecting pairs of colored numbers. The length of each path must match the numbers on the two endpoints. Draw backwards or double tap to correct mistakes. There's only one way to do it, and all squares will contain a piece of a path when the puzzle is solved.\n\nWhen completed, all the colored paths in each puzzle form a miniature picture. Each puzzle also includes an appropriate quote, ranging from wry to witty to profound, as a reward for success.\n\nTwo ways to navigate while solving: \n---Tap the VIEW button for an overview, then touch the screen where you want to play next. \n---Pan to show another area of the board. Put your finger down any place WITHOUT A NUMBER and move it around.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.kpixgames.PathPixLaugh&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.kpixgames.PathPixLaugh&lt;/a&gt;\n","torrent":{"xt":"urn:btih:250561e3f0db1da54ad5a18f68f74e0b8cb6bb36","amp;dn":"PathPix+Laugh+v1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"250561e3f0db1da54ad5a18f68f74e0b8cb6bb36","infoHashBuffer":{"type":"Buffer","data":[37,5,97,227,240,219,29,165,74,213,161,143,104,247,78,11,140,182,187,54]},"announce":[],"urlList":[]}}