{"title":"Investigating Internet Crime (gnv64)","uid":9359066,"size":33003874,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:253ea76ecbfcd0f3c5aa894c09884ab30beac60b&amp;dn=Investigating+Internet+Crime+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1387270875,"description":"Investigating Internet Crimes: An Introduction to Solving Crimes in Cyberspace \nby Todd Shipley, Art Bowker and Nick Selby\nSyngress | December 2013 | ISBN-10: 0124078176 | PDF | 352 pages | 31.4 mb\n\nWritten by experts on the frontlines, Investigating Internet Crimes provides seasoned and new investigators with the background and tools they need to investigate crime occurring in the online world. This invaluable guide provides step-by-step instructions for investigating Internet crimes, including locating, interpreting, understanding, collecting, and documenting online electronic evidence to benefit investigations.\nCybercrime is the fastest growing area of crime as more criminals seek to exploit the speed, convenience and anonymity that the Internet provides to commit a diverse range of criminal activities. Today's online crime includes attacks against computer data and systems, identity theft, distribution of child pornography, penetration of online financial services, using social networks to commit crimes, and the deployment of viruses, botnets, and email scams such as phishing. Symantec's 2012 Norton Cybercrime Report stated that the world spent an estimated $110 billion to combat cybercrime, an average of nearly $200 per victim.\nLaw enforcement agencies and corporate security officers around the world with the responsibility for enforcing, investigating and prosecuting cybercrime are overwhelmed, not only by the sheer number of crimes being committed but by a lack of adequate training material. This book provides that fundamental knowledge, including how to properly collect and document online evidence, trace IP addresses, and work undercover.\n-    Provides step-by-step instructions on how to investigate crimes online\n-    Covers how new software tools can assist in online investigations\n-    Discusses how to track down, interpret, and understand online electronic evidence to benefit investigations\n-    Details guidelines for collecting and documenting online evidence that can be presented in court\n\nAbout the Authors\nTodd G. Shipley is a retired Detective Sergeant with over 30 years of law enforcement and civilian experience performing and teaching Internet and digital forensic investigations, speaking internationally, has authored books and articles in the field and holds the Patent for Online Evidence Collection.\nArt Bowker, an award winning author, has over 27 years experience in law enforcement/corrections and is recognized as an expert in managing cyber-risk in offender populations.\n\nCONTENTS\nCHAPTER 1 Introduction to Internet Crime ................... 1\nCHAPTER 2 Internet Criminals ...................... 21\nCHAPTER 3 How the Internet Works........................ 41\nCHAPTER 4 Collecting Legally Defensible Online Evidence....... 69\nCHAPTER 5 Documenting Online Evidence............................... 99\nCHAPTER 6 Using Online Investigative Tools ......................... 131\nCHAPTER 7 Online Digital Officer Safety ............................... 149\nCHAPTER 8 Tracing IP Addresses Through the Internet .......... 171\nCHAPTER 9 Working Unseen on the Internet.......................... 211\nCHAPTER 10 Cover Operations on the Internet......................... 233\nCHAPTER 11 Conducting Reactive and Proactive Internet nvestigations................ 253\nCHAPTER 12 Internet Resources for Locating Evidence............ 269\nCHAPTER 13 Investigating Websites and Webpages ................ 293\nCHAPTER 14 Investigating Social Networking Sites................. 315\nCHAPTER 15 Investigating Methods of Communication ............ 345\nCHAPTER 16 Detection and Prevention of Internet Crimes........ 375\nCHAPTER 17 Putting It All Together ....................... 401\nCHAPTER 18 Epilogue .......................... 411\nAppendices...........................413\nIndex ..................461","torrent":{"xt":"urn:btih:253ea76ecbfcd0f3c5aa894c09884ab30beac60b","amp;dn":"Investigating+Internet+Crime+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"253ea76ecbfcd0f3c5aa894c09884ab30beac60b","infoHashBuffer":{"type":"Buffer","data":[37,62,167,110,203,252,208,243,197,170,137,76,9,136,74,179,11,234,198,11]},"announce":[],"urlList":[]}}