{"title":"De Delta Decepie - Dan Brown NLT-Release","uid":4647640,"size":347045509,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:272660d1ad4cd7d642a8976dd765fbb92bb29a13&amp;dn=De+Delta+Decepie+-+Dan+Brown+NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PA1HEX","files":35,"time":1231940184,"description":"+------------Beschrijving----------+\nHij is terug... Een wetenschappelijke revolutie, een verbijsterende misleiding, een razendsnelle thriller!\nOnder het poolijs ligt iets wat de wereld voorgoed kan veranderen...\nEen NASA-satelliet doet een opzienbarende ontdekking op de Noordpool. Dat is een opsteker voor de ruimtevaartorganisatie, die al tijden onder vuur ligt. Ook voor president Zach Herney betekent de vondst goed nieuws: een tweede termijn in het Witte Huis lijkt in zicht.\nDe president vraagt Rachel Sexton, analiste bij de inlichtingendienst NRO, na te gaan of de vondst authentiek is. In allerijl vertrekt ze naar het noordpoolgebied om het werk van een team wetenschappers, onder wie de charismatische oceanograaf Michael Tolland, te controleren.\nMaar na Rachels aankomst neemt de zaak een onverwachte wending. Het 'bewijs' lijkt minder rotsvast dan gedacht. Voor de president gewaarschuwd kan worden, begint een nachtmerrie op het poolijs. Een speciale eenheid maakt werk van zijn missie: kost wat kost voorkomen dat de waarheid uitkomt...\nNa Het Juvenalis dilemma, maar vÃƒÂ³ÃƒÂ³r De Da Vinci code, schreef Dan Brown deze 'verfijnde mengeling van actie en intriges' (Publishers Weekly). Opnieuw besteedt hij aandacht aan een schimmige geheime dienst. Deze National Reconnaissance Office is nauw verweven met de beroemde ruimtevaartorganisatie NASA.\nDan Brown is dÃƒÂ© bestsellerauteur van dit moment. De Da Vinci code stond maandenlang op 1 in de top tienen, en ook Het Bernini mysterie en Het Juvenalis dilemma vonden moeiteloos hun weg naar de consument. Ook dit jaar zal in het teken staan van Dan Brown, omdat in mei The Da Vinci Code, dÃƒÂ© grote publieksfilm van 2006, wereldwijd in premiÃƒÂ¨re gaat.\n+-----------------------------------+\n","torrent":{"xt":"urn:btih:272660d1ad4cd7d642a8976dd765fbb92bb29a13","amp;dn":"De+Delta+Decepie+-+Dan+Brown+NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"272660d1ad4cd7d642a8976dd765fbb92bb29a13","infoHashBuffer":{"type":"Buffer","data":[39,38,96,209,173,76,215,214,66,168,151,109,215,101,251,185,43,178,154,19]},"announce":[],"urlList":[]}}