{"title":"Alfred Hitchcock Hour Season 3 (Disc 4 of 8)","uid":9143004,"size":7971733504,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:277c50ab67a22fec125d0b36205030e2d797f5ba&amp;dn=Alfred+Hitchcock+Hour+Season+3+%28Disc+4+of+8%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":6,"uploader":"BoogieMan57","files":-1,"time":1383541336,"description":"* imdb rating: 8.1/10\n* Full DVD quality\n* PAL (720p x 576p)\n* 4:3 Aspect Ratio\n* 25 frames per second\n* VIDEO: 9800 Kbps\n* AUDIO: AC3 224 Kbps, 48 kHz, Stereo\n* ENGLISH AUDIO only, no sub-titles\n* UNTOUCHED except for making Region-Free\n\n\nLegendary director and story-teller Alfred Hitchcock set the benchmark for all TV mystery series to come with his groundbreaking classic television series ALFRED HITCHCOCK PRESENTS, remaining an indelible part of popular culture. No one equaled his talent for presenting viewers with stories of murder, mystery and the macabre that had an unforeseen kick in the 'tale'.\n\nWith the format being limited to short story-telling, rather than progress to an Eighth Season of the half-hour series, Hitchcock returned with an expanded format titled THE ALFRED HITCHCOCK HOUR. Stories were given more scope, but all the hallmarks viewers had come to love remained faithful and the series went from strength to strength running a further three years.\n\nNow, for the first time anywhere, the curtain comes down with the entire final season of THE ALFRED HITCHCOCK HOUR available on DVD-all 29 stories presented by the master of suspense himself. Join an incredible who's who of guest stars including Peter Fonda, David Carradine, Efrem Zimbalist, Jr, Vera Miles, Angie Dickinson, Anne Francis, Roddy McDowall, George Kennedy, Peter Lawford, Lola Albright, Lee Majors, June Lockhart, Ann Sothern, Bruce Dern, John Cassavetes, James Cann, Sally Kellerman, Jack Cassidy, Walter Koenig and many more as they become the puppets in Hitch's theatre.\n\nVoted as one of &quot;The 100 Best TV Shows of All-Time&quot; by Time magazine, tune in once more to the master storyteller with some of the most deliciously wicked and chilling television ever aired and discover why THE ALFRED HITCHCOCK HOUR remains one of the most beloved series ever made. \n\n\nDisc 1\n======\n1 &quot;The Return of Verge Likens&quot; (Peter Fonda, Robert Emhardt)\n2 &quot;Change of Address&quot; (Arthur Kennedy, Phyllis Thaxter)\n3 &quot;Water's Edge&quot; (Ann Sothern, John Cassavetes)\n4 &quot;The Life Work of Juan Diaz&quot; (Alejandro Rey, Frank Silvera)\n\nDisc 2\n======\n5 &quot;See the Monkey Dance&quot; (Roddy McDowall, Efrem Zimbalist, Jr)\n6 &quot;Lonely Place&quot; (Teresa Wright, Pat Buttram, Bruce Dern)\n7 &quot;The McGregor Affair&quot; (Elsa Lanchester, Andrew Duggan)\n8 &quot;Misadventure&quot; (Barry Nelson, Lola Albright, George Kennedy)\n\nDisc 3\n======\n9 &quot;Triumph&quot; (Ed Begley, Jeanette Nolan)\n10 &quot;Memo from Purgatory&quot; (James Caan, Tony Musante, Walter Koenig)\n11 &quot;Consider Her Ways&quot; (Barbara Barrie, Gladys Cooper)\n12 &quot;The Crimson Witness&quot; (Peter Lawford, Martha Hyer, Julie London)\n\nDisc 4\n======\n13 &quot;Where the Woodbine Twineth&quot; (Margaret Leighton)\n14 &quot;The Final Performance&quot; (Franchot Tone, Roger Perry, Sharon Farrell)\n15 &quot;Thanatos Palace Hotel&quot; (Angie Dickinson, Steven Hill)\n16 &quot;One of the Family&quot; (Jeremy Slate, Lilia Skala)\n\nDisc 5\n======\n17 &quot;An Unlocked Window&quot; (Dana Wynter, T.C. Jones, Louise Latham, John Kerr)\n18 &quot;The Trap&quot; (Anne Francis, Robert Strauss)\n19 &quot;Wally the Beard&quot; (Larry Blyden, Kathie Browne)\n20 &quot;Death Scene&quot; (Vera Miles, John Carradine, James Farentino)\n\nDisc 6\n======\n21 &quot;The Photographer and the Undertaker&quot; (Jack Cassidy, Harry Townes)\n22 &quot;Thou Still Unravished Bride&quot; (Ron Randell, David Carradine, Sally Kellerman)\n23 &quot;Completely Foolproof&quot; (J.D. Cannon, Patricia Barry)\n24 &quot;Power of Attorney&quot; (Richard Johnson, Geraldine Fitzgerald)\n\nDisc 7\n======\n25 &quot;The World's Oldest Motive&quot; (Henry Jones, Linda Lawson, Robert Loggia)\n26 &quot;The Monkey's Paw - A Retelling&quot; (Leif Erickson, Jane Wyatt, Lee Majors)\n27 &quot;The Second Wife&quot; (June Lockhart, John Anderson)\n\nDisc 8\n======\n28 &quot;Night Fever&quot; (Colleen Dewhurst)\n29 &quot;Off Season&quot; (John Gavin, Richard Jaeckel)\n\n\nWill seed all discs in this set until approx. 2:1 ratio and then drop off seeding to be able to upload more of the Alfred Hitchcock Hour.","torrent":{"xt":"urn:btih:277c50ab67a22fec125d0b36205030e2d797f5ba","amp;dn":"Alfred+Hitchcock+Hour+Season+3+%28Disc+4+of+8%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"277c50ab67a22fec125d0b36205030e2d797f5ba","infoHashBuffer":{"type":"Buffer","data":[39,124,80,171,103,162,47,236,18,93,11,54,32,80,48,226,215,151,245,186]},"announce":[],"urlList":[]}}