{"title":"Seven Web Frameworks in Seven Weeks + Code","uid":10069206,"size":14030066,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:27904994e7536e90d19d2a3f67bf20d7a7861dad&amp;dn=Seven+Web+Frameworks+in+Seven+Weeks+%2B+Code&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"el_hadi","files":-1,"time":1398826006,"description":"Seven Web Frameworks in Seven Weeks\nAdventures in Better Web Apps\nby Jack Moffitt, Frederic Daoud\nPragmatic Programmers | January 2014 | PDF, EPUB | 302 pages\n\nWhether you need a new tool or just inspiration, Seven Web Frameworks in Seven Weeks explores modern options, giving you a taste of each with ideas that will help you create better apps. You'll see frameworks that leverage modern programming languages, employ unique architectures, live client-side instead of server-side, or embrace type systems. You'll see everything from familiar Ruby and JavaScript to the more exotic Erlang, Haskell, and Clojure.\n\nThe rapid evolution of web apps demands innovative solutions: this survey of frameworks and their unique perspectives will inspire you and get you thinking in new ways to meet the challenges you face daily.\n\nThis book covers seven web frameworks that are influencing modern web applications and changing web development: Sinatra, CanJS, AngularJS, Ring, Webmachine, Yesod, Immutant. Each of these web frameworks brings unique and powerful ideas to bear on building apps.\n\nEmbrace the simplicity of Sinatra, which sheds the trappings of large frameworks and gets back to basics with Ruby. Live in the client with CanJS, and create apps with JavaScript in the browser. Be declarative with AngularJS; say what you want, not how to do it, with a mixture of declarative HTML and JavaScript. Turn the web into data with Ring, and use Clojure to make data your puppet. Become a master of advanced HTTP with Webmachine, and focus the power of Erlang. Prove web theorems with Yesod; see how Haskell's advanced type system isn't just for academics. Develop in luxury with Immutant, an enlightened take on the enterprise framework.\n\nSeven Web Frameworks will influence your work, no matter which framework you currently use.","torrent":{"xt":"urn:btih:27904994e7536e90d19d2a3f67bf20d7a7861dad","amp;dn":"Seven+Web+Frameworks+in+Seven+Weeks+%2B+Code","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27904994e7536e90d19d2a3f67bf20d7a7861dad","infoHashBuffer":{"type":"Buffer","data":[39,144,73,148,231,83,110,144,209,157,42,63,103,191,32,215,167,134,29,173]},"announce":[],"urlList":[]}}