{"title":"The Feelies - Time For A Witness  (FLAC)","uid":4728279,"size":281988320,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:27dab3fa36fdd777963969efe53e686fe174e33a&amp;dn=The+Feelies+-+Time+For+A+Witness++%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Bootycall88","files":11,"time":1234868042,"description":"Ripped in fabulous FLAC from their 1991 CD. \n\n\nReview from AMG:\n\n\nThe final Feelies album didn't change much in the way the band operated, but as a conclusion to the band's active days, it makes for a fine coda. Million and Mercer peel out some amazing frazzled solos, the rhythm section knows the virtues of raving it up and keeping the beat steady and flowing, and the ghost of various earlier inspirations plays around without dominating things. If anything, the concluding cover this time around makes for an intriguing difference away from the Velvets -- namely, the Stooges, in a gentle rip through &quot;Real Cool Time.&quot; But even though there's nothing &quot;new&quot; to report about the Feelies and the members' way of doing things, as a well-played and written collection of low-key rock with non-mainstream aims and goals, Time for a Witness makes for a fine listen. One of the band's best songs surfaces here, the lengthy &quot;Find a Way,&quot; which showcases both the noted Million/Mercer guitar interplay, solo filigrees, and soft chimes passed back and forth, and the complex layering of Weckerman's percussion with the core rhythm section. It's a virtuoso performance from a band that doesn't need to create pointless flash with its abilities, a fine balance all told. Other smart performances crop up song for song, including some really fine, energetic performances such as &quot;Sooner or Later&quot; or &quot;Doin' It Again.&quot; &quot;Invitation&quot; deserves more attention -- in its own way it indicates where the Feelies could have gone next, with a lovely vocal arrangement on the chorus and a slightly varied mix that steps away from the usual clear flow for a hazier yet still strong end result. The lead guitar melody in particular is a charmer, and the whole thing kicks up its heels with delight, a bit like a happier &quot;Boys Don't Cry.&quot;\n\n\nOne of the great 80's alternative bands. \n\nLove to hear your comments. Enjoy!","torrent":{"xt":"urn:btih:27dab3fa36fdd777963969efe53e686fe174e33a","amp;dn":"The+Feelies+-+Time+For+A+Witness++%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27dab3fa36fdd777963969efe53e686fe174e33a","infoHashBuffer":{"type":"Buffer","data":[39,218,179,250,54,253,215,119,150,57,105,239,229,62,104,111,225,116,227,58]},"announce":[],"urlList":[]}}