{"title":"SinDrive: Aletta Ocean (Super Shiny Glam Fashionistas Oily Jugs","uid":13215961,"size":922531687,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:28262e5f4a771da5414ab332000ff92d71b4edbf&amp;dn=SinDrive%3A+Aletta+Ocean+%28Super+Shiny+Glam+Fashionistas+Oily+Jugs+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ImgSnaps","files":2,"time":1452702061,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/R7\r\n \nhttp://imgsnaps.com/image/Rl\r\n\r\nCategory: Anal, DP, Big Tits, CFNM, Blowjob, Deep Throat, Hardcore\r\n\r\nCast: Aletta Ocean\r\n\r\n\r\n.:Description:.\r\nWorld-famous Eurobabe pornstar extraordinaire Aletta Ocean is giving us the full package in this very first Big Tits On Screen update, and she's definitely launching this site with a bang! Aletta is a goddess who expects nothing less than total destruction from her boy toys, who may pound her pussy, face, and ass with intensity, but she's always in charge with her incredibly sexy, super fashionable self as her perfect, mega tits are about to explode out of her blouse underneath her leather jacket! Once this beauty has two cocks at her disposal she puts them to work, stroking them, showing off her deepthroat skills while drooling all over her satin blouse to absurd levels, so much so that she takes the opportunity to undress and then put on another incredible outfit! At this point Aletta gets ready for her super hardcore afternoon, first oiling down her jugs and blouse, and then spreading wide to get taken double-team style, with one dick in her mouth and one in her pussy, and that's just the warm-up for the pounding anal action she's about to enjoy, getting her amazing asshole gaped wide open and then getting some DP love, getting fucked in her pussy and ass at the same time, showing us what an incredible pornstar slut she is! This freak also knows how to handle some jizz, happily getting double blasted on her face and massive, amazing tits! Do not miss the incredible Aletta Ocean like you've never seen her before!\r\nTake a look at screenshots! Enjoy!","torrent":{"xt":"urn:btih:28262e5f4a771da5414ab332000ff92d71b4edbf","amp;dn":"SinDrive%3A+Aletta+Ocean+%28Super+Shiny+Glam+Fashionistas+Oily+Jugs+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28262e5f4a771da5414ab332000ff92d71b4edbf","infoHashBuffer":{"type":"Buffer","data":[40,38,46,95,74,119,29,165,65,74,179,50,0,15,249,45,113,180,237,191]},"announce":[],"urlList":[]}}