{"title":"VHCS VM - Virtual Hosting Server with an Open Source Control (VM","uid":4981211,"size":301313684,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:2889ab544a540f3f255fbdfc78793e99a081afba&amp;dn=VHCS+VM+-+Virtual+Hosting+Server+with+an+Open+Source+Control+%28VM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MADDSPD","files":5,"time":1246315970,"description":"~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nEDIT:\nSo I've decided not to use VHCS for a couple of reasons... First of all, it doesn't seem very easy to install.... There are install scripts out there that will do it for you, but none of them are updated for Ubuntu 9.04 or Debian 5.0.1. --Also, I ran across this article: &lt;a href=&quot;\nhttp://ubuntu-tutorials.com/2006/08/15/vhcs-v2471-pro-do-not-use&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ubuntu-tutorials.com/2006/08/15/vhcs-v2471-pro-do-not-use&lt;/a&gt; and many others I found on google by searching for VHCS HACK\n\nSo instead, I think I'll give SysCP a shot... It looks promising, has great documentation and installation guides, and it's being kept up to date: &lt;a href=&quot;\nhttp://www.syscp.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.syscp.org&lt;/a&gt;\n\nHowever, I will still continue to host the .torrent files I uploaded earlier in case others want to still give VHCS a shot and use these VM appliances...\n\n/ END EDIT\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n\n\n\nFOR FULL DETAILS, VISIT: &lt;a href=&quot; http://www.vmware.com/appliances/directory/370&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.vmware.com/appliances/directory/370&lt;/a&gt;\n\n\n\n\nOperating System:\nDebian Linux\n\nApplications:\nApache HTTP Server version 2.0.54 (aka Apache2)\nDebian Linux OS version 3.1 (aka Sarge)\nLynx Web Browser version 8.2.5\nOpenSSH version 3.1.8\nMySQL Database Tool version 4.1\nPHP Development Tools version 4\nVHCS Open Source Control Panel version 2.4.7\nVMwareTools-5.5.1-19175\n\nVHCS-VM was developed to provide a turn-key solution for\nVirtual Web Servers with a fully functional Control Panel. This VMWare application\nwas built on the Debian Linux\noperating system running Apache2.\nI chose Debian for it's simplicity and ease of maintenance. The Control Panel\nthat is packaged with this virtual server appliance comes from the open source\nproject VHCS.\nVHCS delivers a complete hosting automation appliance by\noffering significant security, total-cost-of-ownership, and performance advantages\nover competing commercial solutions. With VHCS you can configure your server\nand applications, create users with domains with a few point-and-click operations\nthat take less than a minute. There is no limit to the number of resellers,\nusers and domains that can be created. At the core of VHCS are 3 easy-to-use,\nWeb-based control panels. VHCS provides graphic user interfaces for the administrators,\nresellers and users.\nVHCS-VM and VMWare\nServer open the door a little more for someone to sell hosting\nproducts. VHCS-VM uses the latest stable builds of VHCS and integrates\nin a Linux Apache Webserver that is ready to be downloaded and run. You\ncan host multiple Virtual VHCS-VM Servers running on one VMWare Server.\nWhat is VHCS?\nVHCS is an Open Source Software Project that is dedicated to giving users,\nadministrators and developers the ultimate level of control over their Linux\nweb servers, web sites and their data. The goal of VHCS' group of developers\nis to create software that is easy for everyone to use, not just to pile\non features. It has a wide VHCS community of support, and is supported by\nthe leading companies in Linux and Unix. VHCS was developed and is used to\nsupport dozens of languages, and they strive to ensure that every piece of\nVHCS software can be translated into all languages.\nWhat does VHCS do?\nFor data center operations and Virtual WebHosting sellers, it maximizes\nproductivity and eases administrative burdens while improving the return-on-investment\nby providing the following features:\n\n    * Graphic user interfaces for the administrators, resellers and users.\n    * Hosting services plan management - create your own hosting plans, that\n      include a combination of hosting applications and server resources such\n      as disk space and traffic.\n    * Automated creation of users and domains.\n    * Graphical evaluation of every reseller's and user's traffic.\n    * Reduce the time required to manage web sites.\n\nFor server owners, their resellers, and their clients; VHCS shortens the\ntime and expertise required to deploy new sites. VHCS makes management of\nsites, files, configurations and users easy, and provides all the services\nanyone could need.\n\n    * Virtual host management (Name-based, IP-based)\n    * CO-Domains (Domain alias) and sub domains management\n    * DNS (BIND 8 and 9) management\n    * FTP users\n    * E-mail addresses\n    * POP3 and IMAP accounts\n    * Auto responders\n    * CGI, PHP,SSI configuration and management\n    * MySQL user databases\n    * Disk quotas\n    * IP addresses\n    * Backup and restore\n    * SSL-secured domains\n    * Password protection (.htaccess files)\n    * Custom error files - 401, 403, 404 and 500\n    * Traffic accounting\n    * Multi language support\n    * Skin-based graphic user interface - 4 pre-installed skins\n","torrent":{"xt":"urn:btih:2889ab544a540f3f255fbdfc78793e99a081afba","amp;dn":"VHCS+VM+-+Virtual+Hosting+Server+with+an+Open+Source+Control+%28VM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2889ab544a540f3f255fbdfc78793e99a081afba","infoHashBuffer":{"type":"Buffer","data":[40,137,171,84,74,84,15,63,37,95,189,252,120,121,62,153,160,129,175,186]},"announce":[],"urlList":[]}}