{"title":"Enterprise Architecture at Work Modelling, Communication and Ana","uid":4683732,"size":13300188,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29680e4ee0cd704be4f181ae7a5aae424e7ba063&amp;dn=Enterprise+Architecture+at+Work+Modelling%2C+Communication+and+Ana&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"malestrom_HH","files":1,"time":1233163853,"description":" &lt;a href=&quot;http://www.image-upload.net/images/z2l1moskbgmrmzjrhhh.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/z2l1moskbgmrmzjrhhh.jpeg&lt;/a&gt;\n\nMarc Lankhorst, &quot;Enterprise Architecture at Work: Modelling, Communication and Analysis&quot;\nSpringer | 2005-12-31 | ISBN: 3540243712 | 334 pages | PDF \n\nAn enterprise architecture tries to describe and control an organisations structure, processes, applications, systems and techniques in an integrated way. The unambiguous specification and description of components and their relationships in such an architecture requires a coherent architecture modelling language.\nLankhorst and his co-authors present such an enterprise modelling language that captures the complexity of architectural domains and their relations and allows the construction of integrated enterprise architecture models. \n\nThey provide architects with concrete instruments that improve their architectural practice. As this is not enough, they additionally present techniques and heuristics for communicating with all relevant stakeholders about these architectures. Since an architecture model is useful not only for providing insight into the current or future situation but can also be used to evaluate the transition from as-is to to-be, the authors also describe analysis methods for assessing both the qualitative impact of changes to an architecture and the quantitative aspects of architectures, such as performance and cost issues.\n\n\nThe modelling language and the other techniques presented have been proven in practice in many real-life case studies. So this book is an ideal companion for enterprise IT or business architects in industry as well as for computer or management science students studying the field of enterprise architecture.","torrent":{"xt":"urn:btih:29680e4ee0cd704be4f181ae7a5aae424e7ba063","amp;dn":"Enterprise+Architecture+at+Work+Modelling%2C+Communication+and+Ana","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29680e4ee0cd704be4f181ae7a5aae424e7ba063","infoHashBuffer":{"type":"Buffer","data":[41,104,14,78,224,205,112,75,228,241,129,174,122,90,174,66,78,123,160,99]},"announce":[],"urlList":[]}}