{"title":"Breakout - Newt Gingrich - Audiobook MP3","uid":10289372,"size":224416503,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:298f50438084574b49dbf1d682d13b066b10d1d1&amp;dn=Breakout+-+Newt+Gingrich+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1401841128,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Smart AudioBook Player or Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nBreakout: Pioneers of the Future, Prison Guards of the Past, and the Epic Battle That Will Decide America's Fate\n\nWritten by: Newt Gingrich\nNarrated by: David Cochran Heath\nLength: 7 hrs and 51 mins\nFormat: Unabridged\nRelease Date:11-04-13\nProgram Type: Audiobook\n\nBest-selling author Newt Gingrich proposes a bold vision ofthe future: America is on the cusp of a renaissance, a new birth of technological and scientific innovation that will dramatically transform the prosperity and quality of life of every American. Our biggest enemy? Special interest groups, powerful lobbyists, and government bureaucrats who aredetermined to squash, control, or prevent these innovations - and permanently change the future of America. These are the enemies of the future - powerful forces determined to prevent the enormous benefits that American ingenuity will bring.\n\nIn his groundbreaking new book, Breakout, former Speaker of the House Newt Gingrich sketches America's future, brimming withpossibilities and prosperity. Despite big government regulation and taxation, despite special interest groups and lobbyists, American entrepreneurs, innovators, engineers, and scientists are still abundantly creative and productive.\n\nGingrich describes the top technologies that promise to change theway we live and prosper, including 3D printing, driverless cars, breakthroughs in genetics and medicine, unprecedented and ever-growing Internet connectivity,and the new &quot;app store&quot; model of business development.\n\nWill big government, whacky extremists, and powerful lobbyists stop these innovations? They will try - with punitive taxes, stiflingregulation, and hopelessly outdated policies. Will Americans allow it? Newt Gingrich sounds the rallying cry to make sure we defeat the enemies of the future. ","torrent":{"xt":"urn:btih:298f50438084574b49dbf1d682d13b066b10d1d1","amp;dn":"Breakout+-+Newt+Gingrich+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"298f50438084574b49dbf1d682d13b066b10d1d1","infoHashBuffer":{"type":"Buffer","data":[41,143,80,67,128,132,87,75,73,219,241,214,130,209,59,6,107,16,209,209]},"announce":[],"urlList":[]}}