{"title":"Sunset.Boulevard.1950.1080p.BluRay.x264.DTS-SARTRE+Extras","uid":12166105,"size":6224153073,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:2ae0151c8a06fe9ff34dbdd313bb1399c3f317e8&amp;dn=Sunset.Boulevard.1950.1080p.BluRay.x264.DTS-SARTRE%2BExtras&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"sartre7","files":35,"time":1438040619,"description":"\nBilly Wilder's Sunset Boulevard ranks among the most scathing satires of Hollywood and the cruel fickleness of movie fandom. The story begins at the end as the body of Joe Gillis (William Holden) is fished out of a Hollywood swimming pool. From The Great Beyond, Joe details the circumstances of his untimely demise (originally, the film contained a lengthy prologue wherein the late Mr. Gillis told his tale to his fellow corpses in the city morgue, but this elicited such laughter during the preview that Wilder changed it). Hotly pursued by repo men, impoverished, indebted &quot;boy wonder&quot; screenwriter Gillis ducks into the garage of an apparently abandoned Sunset Boulevard mansion. Wandering into the spooky place, Joe encounters its owner, imperious silent star Norma Desmond (Gloria Swanson). Upon learning Joe's profession, Norma inveigles him into helping her with a comeback script that she's been working on for years. Joe realizes that the script is hopeless, but the money is good and he has nowhere else to go. Soon the cynical and opportunistic Joe becomes Norma's kept man. While they continue collaborating, Norma's loyal and protective chauffeur Max Von Mayerling (played by legendary filmmaker Erich von Stroheim) contemptuously watches from a distance. More melodramatic than funny, the screenplay by Wilder and Charles Brackett began life as a comedy about a has-been silent movie actress and the ambitious screenwriter who leeches off her. (Wilder originally offered the film to Mae West, Mary Pickford and Pola Negri. Montgomery Clift was the first choice for the part of opportunistic screenwriter Joe Gillis, but he refused, citing as &quot;disgusting&quot; the notion of a 25-year-old man being kept by a 50-year-old woman.) Andrew Lloyd Webber's long-running musical version has served as a tour-de-force for contemporary actresses ranging from Glenn Close to Betty Buckley to Diahann Carroll.\n\n\n\nSTARS.........: William Holden, Gloria Swanson, Erich von Stroheim\nDIRECTOR......: Billy Wilder\nWRITERS.......: Charles Brackett, Billy Wilder\nGENRE.........: Drama\nRATING........: 8.6/10   101,084 votes\nIMDB link.....: http://www.imdb.com/title/tt0043014/\nRUNTIME.......: 1h 50mn\nSIZE..........: 4.40 GiB + 1.36GB (Extras)\nVIDEO CODEC...: x264 (&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;fab2939d92bab6ced4ca&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;)\nRESOLUTION....: 1476x1080\nBITRATE.......: 5000 Kbps\nFRAMERATE.....: 23.976 fps\nAUDIO1........: English DTS 2.0 Mono 384 Kbps\nAUDIO2........: English Commentary AC3 2.0 224 Kbps\nSOURCE........: Untouched Blu Ray\nSUBTITLES.....: ENG, ENG-SDH, ARA, DAN, FRE, PER, POR, SPA  \nCHAPTERS......: Yes\nENCODED BY....: Sartre\nENCODE DATE...: 2014-03-01\n\n\n\nExtras\n\nGENRE.........: Documentary\nRUNTIME.......: ~3 hrs\nSIZE..........: 1.36 GiB\nVIDEO CODEC...: x264 (&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;c48cada3ac8488f7eaf5&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;)\nRESOLUTION....: 640x480/854x480/1280x720\nBITRATE.......: ~900 Kbps avg\nFRAMERATE.....: 29.970 fps NTSC\nAUDIO.........: English AC3 2.0 224kbps\nSUBTITLES.....: ENG, FRE, SPA\nSOURCE........: Untouched Blu Ray\nENCODED BY....: Sartre\n\n\n\nBehind the Gate: The Lot (480p, 5:05): Producer A.C. Lyles and Film Historian/Author Rudy Behlmer offer a very brief but fascinating history of Paramount Pictures, the famed gate, and studio expansion.\n\nDeleted Scene - Morgue Prologue (720p, 3:47): Discarded footage from the original opening, rejected by preview audiences. \n\nDeleted Scene - The Paramount Don't Want Me Blues (720p, 1:26): A new supplement exclusive to the Blu-ray edition is a deleted scene that would have been a sort of prelude to the New Year's party scene: Before Joe Gillis arrives, his movieland pals have all gathered round to sing a rueful but cheery rendition of a ditty befitting the milieu called &quot;The Paramount Don't Want Me Blues&quot; by ray Livingston and Jay Evans.\n\nEdith Head: The Paramount Years (480p, 13:43): A look back at the life and career of the legendary cinema costume designer whose credits include Sunset Boulevard and Wings.\n\nFranz Waxman and the Music of Sunset Boulevard (480p, 14:27): Film Music Historian John Waxman, Composer Elmer Bernstein, and Composer John Mauceri take a closer look at the life and work of Sunset Boulevard Composer Franz Waxman.\n\nMad About the Boy: A Portrait of William Holden (480p, 11:13): Producer A.C. Lyles, Actress Stefanie Powers, Actress Nancy Olson, and Author Joseph Wambaugh speak on Holden's life and career.\n\nParamount in the '50s (480p, 9:33): A feature that looks back at Paramount's best films from the 1950s, including Sunset Boulevard.\n\nRecording Sunset Boulevard (480p, 5:51): Critic Andrew Sarris and Soundtrack Album Producer Robert Townson discuss Franz Waxman's classic score and re-recording the score in 2002 for a commercial album release.\n\nStories of Sunset Boulevard (480p, 11:22): Critic Andrew Sarris, Author Ed Sikov, Filmmaker Nicholas Meyer, and Actress Nancy Olson speak on the film's opening shot, Olson's work on the film, Billy Wilder's scriptwriting and direction, tales from the shoot, and making the last scene.\n\nSunset Boulevard: A Look Back (480p, 25:52): Author Ed Sikov, Actress Nancy Olson, Critic Andrew Sarris, Producer A.C. Lyles, and Actress Glenn Close speak on the picture's themes, the scrapped opening, filming locales, Writer/Director Billy Wilder's work, reaction to the film, casting, DeMille's involvement, the film's end, the picture's public acceptance, awards, and the film's legacy.\n\nSunset Boulevard Becomes a Classic (480p, 14:29): Critic Andrew Sarris, Actress Gloria Swanson, Author Ed Sikov, Filmmaker Nicholas Meyer, Actress Glenn Close, and Actress Stefanie Powers speak on audience and critical reaction, the film's themes, its dark look at Hollywood, awards and nominations, the picture's impact on culture, the Broadway musical version, and more.\n\nSunset Boulevard: The Beginning (480p, 22:47): The piece features Paramount Pictures Producer A.C. Lyles, Actress Stefanie Powers, Filmmaker Nicholas Meyer, Author Ed Sikov, and Actress Nancy Olson speaking on Billy Wilder's life and work, his scripts, and use of narration. The piece continues with discussions on the film's title, casting and the dynamics the four main players brought to the film, defining the characters, and Cecil B. DeMille's contributions to the film.\n\nThe City of Sunset Boulevard (480p, 5:36): Author Borislav Stanic, Author Ed Sikov, and Actress Nancy Olson speak on shooting locales seen within the film, including the history of each major location.\n\nThe Noir Side of Sunset Boulevard (480p, 14:19): Author and former LAPD Sergeant Joseph Wambaugh discusses one of his favorite films, Sunset Boulevard. He covers his first reactions to the film, Gloria Swanson's work, the picture's noir-inspired elements and those that drift from noir norm, set design, cast, drama, themes, and more.\n\nSunset Boulevard Theatrical Trailer (720p, 3:16).\n\nTwo Sides of Ms. Swanson (480p, 10:37): Gloria Swanson's Granddaughter Brooke Anderson and Actress Linda Harrison speak on the life and times of Gloria Swanson, both away from the film and considering her part in Sunset Boulevard.\n\nMap mini-clips (480p, 2:22): Three clips from the map feature: Schwabs Pharmacy, The House, The Car\n\n\n\n\n &lt;a href=&quot;\nhttp://img850.imageshack.us/img850/7804/8f7o.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img850.imageshack.us/img850/7804/8f7o.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img571.imageshack.us/img571/5270/z9hn.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img571.imageshack.us/img571/5270/z9hn.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img844.imageshack.us/img844/7889/9782.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img844.imageshack.us/img844/7889/9782.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:2ae0151c8a06fe9ff34dbdd313bb1399c3f317e8","amp;dn":"Sunset.Boulevard.1950.1080p.BluRay.x264.DTS-SARTRE%2BExtras","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ae0151c8a06fe9ff34dbdd313bb1399c3f317e8","infoHashBuffer":{"type":"Buffer","data":[42,224,21,28,138,6,254,159,243,77,189,211,19,187,19,153,195,243,23,232]},"announce":[],"urlList":[]}}