{"title":"Exploring Art: A Global, Thematic Approach 5th Edition","uid":13257948,"size":204591739,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b5e7c8f983e659af604f5e1c7b256e0dc51e911&amp;dn=Exploring+Art%3A+A+Global%2C+Thematic+Approach+5th+Edition&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1453232616,"description":"Giving you an appreciation for artworks and art styles across time and across the world, EXPLORING ART: A GLOBAL, THEMATIC APPROACH, 5E provides a solid foundation of art basics and then presents art through themes such as religion, power and politics, sexuality, mind and body, mortality and immortality, nature and technology, and entertainment and visual culture. &quot;Art Experiences&quot; features in every chapter and an all-new Chapter 15, &quot;Art in Your Life,&quot; draw explicit connections between art and daily life, illustrating how art is all around us as well as providing suggestions for interacting with art. Timelines with thumbnail images help you easily draw chronological connections between works, and detailed world maps illustrate geographical relevance. In addition to new works by such artists as Tomatsu Shomei, Cindy Sherman, Doris Salcedo, George Rickey, Claude Monet, Georgia O'Keeffe, Hans Holbeing, James McNeill Whistler, Paul Klee, Giorgio de Chirico, Kay Sage, and Alexander Calder, the fifth edition offers expanded representation of contemporary artists from around the globe, including Julie Mehretu, Zaha Hadid, Ai Weiwei, Banksy, Anish Kapoor, Rafael Lozano-Hemmer, Do Ho Suh, Korczak Ziolkowski, and Marina Abramovic. Also available with the fifth edition, MindTap™ provides the ultimate personal learning experience through an interactive eBook, digital activities, author videos for each chapter, apps, and more.\r\n\r\nISBN-13: 978-1285858166\r\nISBN-10: 1285858166","torrent":{"xt":"urn:btih:2b5e7c8f983e659af604f5e1c7b256e0dc51e911","amp;dn":"Exploring+Art%3A+A+Global%2C+Thematic+Approach+5th+Edition","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b5e7c8f983e659af604f5e1c7b256e0dc51e911","infoHashBuffer":{"type":"Buffer","data":[43,94,124,143,152,62,101,154,246,4,245,225,199,178,86,224,220,81,233,17]},"announce":[],"urlList":[]}}