{"title":"heather allen","uid":8809946,"size":2038647,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b8353cdaa8de38b25b4967d86a32fe53a8c4542&amp;dn=heather+allen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":3,"time":1376433604,"description":"Ever Harding, an average teenager with a passion for swimming is about to turn eighteen. Out of the blue she has been dumped by her long time boyfriend, which is the ultimate of tragedies in her life. Little does she know that on that fated eighteenth birthday, she will have to make a choice that will change her life as she knows it, forever.\nA month before her birthday, Ever meets Jack, a mysterious new boy with mesmerizing eyes. He affects her like no one else. This meeting sets things into a whirlwind she never would have dreamed. With Jack's guidance she discovers a family line that leads her to the sea. She must make the ultimate choice, stay on land where life as she knows it, won't change, or go and live in the sea as a mermaid with Jack.\n\nUltimately her choice sets into motion an even bigger decision, in which she has the fate of a race of people, in her hands. The people in the sea are in a feud, she will tip the balance. She must battle the ageless moral delimma of prejudice and race. Once she comes to terms with her life changing choices, she must ask herself, did I make the right decisions? and Is Jack really who I think he is?","torrent":{"xt":"urn:btih:2b8353cdaa8de38b25b4967d86a32fe53a8c4542","amp;dn":"heather+allen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b8353cdaa8de38b25b4967d86a32fe53a8c4542","infoHashBuffer":{"type":"Buffer","data":[43,131,83,205,170,141,227,139,37,180,150,125,134,163,47,229,58,140,69,66]},"announce":[],"urlList":[]}}