{"title":"Shaun White Skateboarding [R.Free][Multi5][Spanish][Xbox360][www","uid":5909723,"size":7838695885,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:2bf72a92ecaf64dd02d5beae038b62e11c055c99&amp;dn=Shaun+White+Skateboarding+%5BR.Free%5D%5BMulti5%5D%5BSpanish%5D%5BXbox360%5D%5Bwww&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"consolasatope","files":4,"time":1288004294,"description":"Tu tabla contra la opresiÃƒÂ³n\nSe conocen pocos detalles acerca del argumento, pero todo indica que nos pondremos en el lugar de Shaun White y todo un repertorio de personajes con el cometido de llevar la libertad a una sociedad dominada por The Ministry, un grupo gubernamental que ha lavado el cerebro a la poblaciÃƒÂ³n, creando un estado sin personalidad ni diversiÃƒÂ³n. Algo asÃƒÂ­ como lo expuesto por George Orwell en su famoso libro &quot;1984&quot;, salvo que esta vez vamos sobre una tabla de ruedas.\n\nY no es una comparaciÃƒÂ³n gratuita. Responsables de Ubisoft nos han confirmado la intenciÃƒÂ³n por dar a Shaun White Skateboarding una cierta complejidad en cuanto a su argumento. Esa es la principal razÃƒÂ³n por la que se ha contratado a un guionista como el de &quot;Padre de Familia&quot;, John Viener, encargado de hacer de esta epopeya contra lo gris una obra interactiva argumentalmente llamativa de principio a fin... y presumimos tambiÃƒÂ©n que dotada con algo de humor.\n\nPor tanto, la impresiÃƒÂ³n tras nuestra primera hora de juego es la de no encontrarnos ante un juego de &quot;skate&quot; sin mÃƒÂ¡s, sino ante un conjunto de misiones y retos (carreras o recolecciÃƒÂ³n de items, entre otros) que quedan justificados por una historia de fondo.\n\nLa magia del &quot;skate&quot;\nResulta algo novedoso, pero lo es mÃƒÂ¡s aÃƒÂºn la posibilidad de modificar el escenario con nuestras acciones. Cualquier acrobacia tiene un efecto sobre el escenario, que gana vida tanto si saltamos sobre la carretera como si nos apoyamos en un escalÃƒÂ³n, o utilizamos para desplazarnos una barandilla que, en algÃƒÂºn que otro caso, podremos incluso prolongar rotando el stick de nuestro controlador para llegar a lugares insospechados.\n\nPara que llenar de color al mundo del videojuego no sea algo aburrido, Ubisoft Montreal nos propone cerca de 80 trucos de &quot;skate&quot; (entre los que se incluyen movimiento ÃƒÂºnicos de Shaun, como el &quot;armadillo&quot;). Sin duda, un gran repertorio para que no se nos escapen puntos que nos ayuden a comprar nuevo equipo y mejorar nuestras opciones como skaters.\n\nIncluso se aÃƒÂ±ade la posibilidad de jugar en cooperativo y en competitivo, tanto en modo local (un mÃƒÂ¡ximo de 2 jugadores) como online (hasta 8 usuarios), aunque aÃƒÂºn no se han confirmado las modalidades exactas, salvo que podremos crear nuestros propios mapas y explorarlos en compaÃƒÂ±ÃƒÂ­a. Tal vez en los prÃƒÂ³ximas semanas podamos ampliar informaciÃƒÂ³n antes de que Shaun White regrese a las ruedas de su tabla\n\n","torrent":{"xt":"urn:btih:2bf72a92ecaf64dd02d5beae038b62e11c055c99","amp;dn":"Shaun+White+Skateboarding+%5BR.Free%5D%5BMulti5%5D%5BSpanish%5D%5BXbox360%5D%5Bwww","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bf72a92ecaf64dd02d5beae038b62e11c055c99","infoHashBuffer":{"type":"Buffer","data":[43,247,42,146,236,175,100,221,2,213,190,174,3,139,98,225,28,5,92,153]},"announce":[],"urlList":[]}}