{"title":"Seinfeld S01 E02 Male Unbonding","uid":7379672,"size":230306983,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2ef29d4e6f23532ec77fdc8b523a3684018107f3&amp;dn=Seinfeld+S01+E02+Male+Unbonding&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GrandMstrBud","files":1,"time":1340469463,"description":"George tells Jerry that he was out with a girlfriend. They went to see a play, during which he put his hand in his pocket to get some money and accidentally got some dental floss stuck to his hand. George worries that his girlfriend is going to leave him because of it.\n\nJerry has problems with a childhood friend, Joel Hornick, who persists in keeping in touch with him. He does not like Hornick, who does not pay attention to anything that Jerry says. Jerry claims that he feels uncomfortable &quot;breaking up with&quot; Hornick, so George suggests that he should pretend that Hornick is a woman and break up normally. Jerry therefore attempts to break up with Hornick at Monk's Cafe, but when he does so, Hornick bursts into tears. Deeply uncomfortable, Jerry assures Hornick he didn't mean it, and agrees to take him to see the New York Knicks, although he was supposed to take George.\n\nAs George tells Jerry that his girlfriend no longer wants to see him, Jerry tells George that he gave away his ticket to Hornick. George does not go to the game because he does not know Hornick, so Jerry decides to give Hornick both tickets, claiming that he cannot make the game because he is tutoring his nephew. Later, when talking to his ex-girlfriend Elaine, she tries to provide Jerry with a list of excuses to help him avoid Hornick. He later discovers that Hornick took Kramer to the game and that Hornick is in the building. When Hornick meets Jerry and Elaine, Hornick invites them out to another Knicks game. They come up with more unusual excuses in an attempt to avoid going out. However, Hornick then gets out a newspaper and tries to organize a time when they can all meet, weeks in advance. Jerry realizes that no matter what excuses he comes up with, he cannot avoid Hornick.\n\nKramer, working under the name &quot;Kramerica Industries&quot;, conceptualizes building &quot;a pizza place where you make your own pizza pie.&quot; Jerry and George try to persuade Kramer to forget the idea, but Kramer is determined to go on with it. Kramer's pizza parlor idea reappears in later episodes such as &quot;The Puffy Shirt&quot; in season 5, and &quot;The Couch&quot; in season 6.","torrent":{"xt":"urn:btih:2ef29d4e6f23532ec77fdc8b523a3684018107f3","amp;dn":"Seinfeld+S01+E02+Male+Unbonding","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ef29d4e6f23532ec77fdc8b523a3684018107f3","infoHashBuffer":{"type":"Buffer","data":[46,242,157,78,111,35,83,46,199,127,220,139,82,58,54,132,1,129,7,243]},"announce":[],"urlList":[]}}