{"title":"After Henry - S01 to 04 - Audio Comedy - MP3 - Slimoo","uid":5731546,"size":898003154,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2f2e999cc138030a4a1d93467c92d1913d76aa78&amp;dn=After+Henry+-+S01+to+04+-+Audio+Comedy+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_Slimoo_","files":34,"time":1280669677,"description":"After Henry - Series - 01 to 04 - Complete - Audio Comedy - BBC R7 via DVB-T \n34 x 30 minute episodes - 128Kbps - Mp3 - Slimoo\n\n\n\nSarah France is 42 and a widow of two years, her GP husband, Henry, having been killed in a car crash. Dr France has left Sarah well provided for, with a large Edwardian detached house in a leafy town about 70 miles out of London, which she shares with their 18-year-old daughter Clare and her seventy-something mother Eleanor. 'Mother' is a manipulative sort, but Henry had assured Sarah that, between the two of them, and with Clare's help, they would cope with her presence without undue trouble. Now he's gone and all three women have to cope After Henry.\n\nOf the three generations in the one household, Sarah is most definitely piggy in the middle, not only by her age but also by simple geography - mother Eleanor resides in the upstairs flat and daughter Clare moves into the basement; Sarah is in between. Both women bring her grief. Mother is the ultimate in cunning, forever sapping Sarah's confidence and undermining her principles. She is also a terrible gossip (Sarah calls Eleanor and her friends 'The Geriatric Mafia'), prone to making pronouncements about what she's heard from 'Valerie Brown on the pension counter's sister Mary's gentleman friend Maurice' or from her friend Vera Poling who lives at the Sycamores, a residential home for the elderly. Clare, meanwhile, is at that precocious age, keen to assert her independence when it suits her but equally quick to go running back to mother when it doesn't. Life being what it is, Eleanor and Clare frequently gang up on Sarah, whose only source of refuge is Russell, the owner of Bygone Books, the second-hand bookshop where she works. Russell is Sarah's counsel, and, because he's homosexual, they can exchange frank confidences without threat of romantic entanglement.\n\nA gentle and sensitive comedy, After Henry was a special creation, exploring parallel mother/daughter relationships within an intelligent framework. The episodes were scripted superbly, with all loose ends neatly tied up inside every story. Originally created for BBC radio, After Henry shone within that medium and quickly became a favourite among listeners. \n\n\n\nPrunella Scales  as  Sarah France  \nJoan Sanderson  as  Eleanor Prescott  \nJanine Wood  as  Clare France  \nJonathan Newth  as  Russell Bryant  \nPeggy Ann Wood  as  Vera Poling  \n\n\n\n\nAfter Henry - S01 - E01 - The Older Man\nAfter Henry - S01 - E02 - Moving\nAfter Henry - S01 - E03 - The Cowboy\nAfter Henry - S01 - E04 - The Dinner Party\nAfter Henry - S01 - E05 - Gossip\nAfter Henry - S01 - E06 - Mr Right\nAfter Henry - S01 - E07 - The Spectre At The Feast\nAfter Henry - S01 - E08 - Going Away\nAfter Henry - S01 - E09 - A Week Of Sundays[b]&lt;&lt; Christmas Special[/b]\n\nAfter Henry - S02 - E01 - Memory Games\nAfter Henry - S02 - E02 - The Romantic Approach\nAfter Henry - S02 - E03 - The Cold\nAfter Henry - S02 - E04 - Bedside Manners\nAfter Henry - S02 - E05 - The Kitten\nAfter Henry - S02 - E06 - The Married Man\nAfter Henry - S02 - E07 - The Other Married Man\nAfter Henry - S02 - E08 - The Teapot            \n\nAfter Henry - S03 - E01 - Wedding Bells\nAfter Henry - S03 - E02 - Poor Relations\nAfter Henry - S03 - E03 - Guilty Secrets\nAfter Henry - S03 - E04 - Lines of Communication\nAfter Henry - S03 - E05 - Intellectual Aspirations\nAfter Henry - S03 - E06 - A Box Of Chocolates \nAfter Henry - S03 - E07 - Different Viewpoints\nAfter Henry - S03 - E08 - The End Of A Chapter \nAfter Henry - S03 - E09 - The Season Of Relative Goodwill [b]&lt;&lt; Christmas Special[/b]\n\nAfter Henry - S04 - E01 - Dependent Relatives\nAfter Henry - S04 - E02 - Relative Movement\nAfter Henry - S04 - E03 - A Fully-Extended Family\nAfter Henry - S04 - E04 - Sunday Lunch\nAfter Henry - S04 - E05 - Little Women\nAfter Henry - S04 - E06 - Family Album\nAfter Henry - S04 - E07 - Keeping Faith\nAfter Henry - S04 - E08 - Positive Thinking \n\n\n\n\nAudio Format    : MP3\nDuration Approx : 28mn 00s\nBit rate mode   : Constant\nBit rate        : 128 Kbps \nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n[","torrent":{"xt":"urn:btih:2f2e999cc138030a4a1d93467c92d1913d76aa78","amp;dn":"After+Henry+-+S01+to+04+-+Audio+Comedy+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f2e999cc138030a4a1d93467c92d1913d76aa78","infoHashBuffer":{"type":"Buffer","data":[47,46,153,156,193,56,3,10,74,29,147,70,124,146,209,145,61,118,170,120]},"announce":[],"urlList":[]}}