{"title":"Philosophy and the Idea of Communism [PDF]","uid":12092891,"size":380553,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f73c470aa749fe291cc01c3809bc5e8c2c8979d&amp;dn=Philosophy+and+the+Idea+of+Communism+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hawzerstar","files":1,"time":1436054454,"description":"Book name: Philosophy and the Idea of Communism: Alain Badiou in Conversation with Peter Engelmann\n\nBook author: Alain Badiou and Peter Engelmann\n\nBook description: In a well-known text called &quot;The Communist Hypothesis&quot;, first published in 2007, the renowned philosopher Alain Badiou breathed fresh life into the idea of communism as an intellectual representation that provides a critical perspective on existing politics and offers a systemic alternative to capitalism.\n\nNow, in the course of this wide-ranging conversation with Peter Engelmann, Alain Badiou explains why he continues to value the idea of communism against the background of current social crises and despite negative historical experiences. From the anticipation of a communism without a state to the problem of the concept of democracy and an analysis of capitalism as a system, the two thinkers discuss the key political issues of our time. Whilst explaining his political philosophy, Badiou also reflects on current socio-political developments such as the turmoil in the Middle East and the situation in China.\n\nThis compelling dialogue is both a highly topical contribution to the question of how we might organize our societies differently and an accessible introduction to Badiou's philosophical thinking.\n\nNumber of pages: 120\n\nISBN13: 9780745688367\n\nISBN10: 0745688365\n\nFormat: PDF","torrent":{"xt":"urn:btih:2f73c470aa749fe291cc01c3809bc5e8c2c8979d","amp;dn":"Philosophy+and+the+Idea+of+Communism+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f73c470aa749fe291cc01c3809bc5e8c2c8979d","infoHashBuffer":{"type":"Buffer","data":[47,115,196,112,170,116,159,226,145,204,1,195,128,155,197,232,194,200,151,157]},"announce":[],"urlList":[]}}