{"title":"Aurorarama by Jean-Christope Valtat {dwg}","uid":11447771,"size":10933340,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ff77315748b58639d2007c45834cfd6a05ced59&amp;dn=Aurorarama+by+Jean-Christope+Valtat+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gratefuldawg77","files":6,"time":1415858608,"description":"A startling, seductive literary novel that entwines suspense, science fiction, adventure, romance and history into an intoxicating new genre.\n\n1908: New Venice--&quot;the pearl of the Arctic&quot;--a place of ice palaces and pneumatic tubes, of beautifully ornate carriage-sleds and elegant victorian garb, of long nights and vistas of ice.\n\nBut as the city prepares for spring, it feels more like qaartsiluni, &quot;the time when something is about to explode in the dark.&quot; Local &quot;poletics&quot; are wracked by tensions with the Eskimos circling the city, with suffragette riots led by an underground music star, with drug round-ups by the secret police force known as the Gentlemen of the Night. An ominous black airship hovers over the city, and the Gentlemen are hunting for the author of a radical pamphlet calling for revolt.\n\nTheir lead suspect is Brentford Orsini, one of the city's most prominent figures. But as the Gentlemen of the Night tighten the net around him, Orsini receives a mysterious message from a long-lost love that compels him to act.\n\nWhat transpires is a literary adventure novel unlike anything you've ever read before. Brilliant in its conception, masterful in its prose, thrilling in its plot twists, and laced with humor, suspense, and intelligence, it marks the beginning of a great new series of books set in New Venice-and the launch of an astonishing new writer","torrent":{"xt":"urn:btih:2ff77315748b58639d2007c45834cfd6a05ced59","amp;dn":"Aurorarama+by+Jean-Christope+Valtat+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ff77315748b58639d2007c45834cfd6a05ced59","infoHashBuffer":{"type":"Buffer","data":[47,247,115,21,116,139,88,99,157,32,7,196,88,52,207,214,160,92,237,89]},"announce":[],"urlList":[]}}