{"title":"Bailey And Love's","uid":5932508,"size":86799951,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3016167b366ba9520aa46dbfa3ef5810110ad907&amp;dn=Bailey+And+Love%5C%27s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aronymous","files":1,"time":1288828805,"description":"Bailey &amp; Love's Short Practice of Surgery remains one of the world's pre-eminent medical textbooks, beloved by generations of surgeons, with lifetime sales in excess of one million copies.\n\nNow in its 25th edition, the content has been thoroughly revised and updated while retaining its traditional strengths. Under the stewardship of the eminent editorial team, comprising two editors with experience gained over previous editions and a third editor new to this edition, and in response to reader feedback, the content has been sub-divided into parts to ensure a logical sequence and grouping of related chapters throughout while the text features enthusiastically received in the last edition have been retained. The new edition opens with sections devoted to the underlying principles of surgical practice, investigation and diagnosis, and pre-operative care. These are followed by chapters covering all aspects of surgical trauma. The remainder of the book considers each of the surgical specialties in turn, from elective orthopaedics through skin, head and neck, breast and endocrine, cardiothoracic and vascular, to abdominal and genitourinary. ","torrent":{"xt":"urn:btih:3016167b366ba9520aa46dbfa3ef5810110ad907","amp;dn":"Bailey+And+Love%5C%27s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3016167b366ba9520aa46dbfa3ef5810110ad907","infoHashBuffer":{"type":"Buffer","data":[48,22,22,123,54,107,169,82,10,164,109,191,163,239,88,16,17,10,217,7]},"announce":[],"urlList":[]}}