{"title":"Sandman Presents - Merv Pumpkinhead, Agent Of Dream","uid":7561690,"size":16004499,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:30356c91013bf572ae76d7b8bfc3a4145ba05b03&amp;dn=Sandman+Presents+-+Merv+Pumpkinhead%2C+Agent+Of+Dream&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1345756630,"description":"Sandman Presents: Merv Pumpkinhead, Agent of D.R.E.A.M. (one-shot, 2000), a renegade dream breaks into Morpheus' palace and steals some of the dream sand from his pouch. Pumpkin-headed servant Merv, ever-willing to play the secret agent, volunteers to track the dream down and bring the sand back.\n\nSandman Presents: Merv Punpkinhead, Agent of D.R.E.A.M.\nVertigo, DC Comics, 2000\nWriter - Bill Willingham\nPencils - Mark Buckingham\nInks - John Stokes\n\n\nMervyn &quot;Merv&quot; Pumpkinhead is a fictional character in Neil Gaiman's popular comic book series, The Sandman.\n\nMerv (as he is better known throughout the series) is Dream's jaded, street-wise, cigarette-smoking janitor. While his appearance can vary based on who is viewing him (for example, William Shakespeare saw a turnip-headed version of Merv in Sandman #75 (March 1996)), Merv is generally portrayed as having a pumpkin for a head. His appearance is based on Jack Pumpkinhead, a character in L. Frank Baum's Oz books.\n\nMervyn's first appearance in The Sandman #5 (May 1989) had him driving a bus, helping to transport Morpheus on his quest. Pumpkinhead later claims this was his job during Morpheus' absence. Merv seems to be in charge of the construction and demolition of the Dreaming, though he often complains that his job is superfluous since Dream can change any of it at will. He takes up arms to fight the Furies in The Kindly Ones and is killed, but he was returned to life by the new Dream in The Wake.\n\nMervyn also appeared in his own spin-off to The Sandman series called Merv Pumpkinhead: Agent of DREAM, published in 2000. In this publication, Merv goes on a James Bond-esque adventure in which he attempts to foil the schemes of a would-be world conqueror, and along the way meets beautiful women and evil villains.\n\nMerv co-stars a later issue of 'The Dreaming', where a dreamer finds joy working with Merv's repair crew. In the very next issue, Lucian, the librarian of the Dreaming, feels the need to travel to Earth proper. He entrusts Merv with watching the library. When another character expresses doubt that Merv can supervise every book ever written or thought of, Lucian states that Merv has his cellphone number. ","torrent":{"xt":"urn:btih:30356c91013bf572ae76d7b8bfc3a4145ba05b03","amp;dn":"Sandman+Presents+-+Merv+Pumpkinhead%2C+Agent+Of+Dream","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30356c91013bf572ae76d7b8bfc3a4145ba05b03","infoHashBuffer":{"type":"Buffer","data":[48,53,108,145,1,59,245,114,174,118,215,184,191,195,164,20,91,160,91,3]},"announce":[],"urlList":[]}}