{"title":"Cat-Man 1940-1946 Holyoke Publishing Golden Age","uid":8410839,"size":798563164,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:31b2e9a490189ae7d87e7eed75270523416aa67b&amp;dn=Cat-Man+1940-1946+Holyoke+Publishing+Golden+Age&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Mothra67","files":-1,"time":1366914314,"description":"Another one from the vaults due to my inspiration of Alex Ross's Project Superpowers:\n\nThe Merrywether family was traveling through the jungles of Burma when bandits killed the mother, father, and sister. Young David was the only survivor. He was found and raised by a Tigress and gradually gained all the powers of the cat family. When he became an adult, he decided to return to the United States. Upon arriving there, he was appalled to discover that the city was full of crime and evil he found. He decided to fight it, both as a private eye in his civilian identity and as the costumed Cat-Man.\n\nIn Cat-Man Comics #4, David encountered Katie Conn, an 11-year old orphan. Her unscrupulous uncle was using her to help him steal. After putting her uncle behind bars, David took Katie in as his ward. He was initially reluctant to let her fight crime with him, but after she put on a costume and fights as Kitten and helped him defeat the latest villain, David changed his mind.\n\nWhen World War II broke out, David joined the military. He was never deployed. A year before the war ended, he was discharged under unspecified circumstances and he and Katie moved to Center City, home of the Deacon. While their sidekicks were already good friends, the two crime-fighters barely interacted. They only teamed up on two occasions.\n\nDavid and Katie continued to fight crime as Cat-Man and Kitten until Cat-Man Comics was canceled.\n\nCat-Man had cat-like powers -- he can see in the dark, leap many times his length, and climb anything. He also had nine lives. He was watched over by a guardian angel in the form of a tigress who brings Cat-Man back to life if and when he is murdered (He had seven lives left as of Cat-Man Comics #3) Some of his more supernatural powers were de-emphasized over time. He originally carried a silent-firing pistol called the Power Gun. \n\nPlease seed and enjoy!","torrent":{"xt":"urn:btih:31b2e9a490189ae7d87e7eed75270523416aa67b","amp;dn":"Cat-Man+1940-1946+Holyoke+Publishing+Golden+Age","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31b2e9a490189ae7d87e7eed75270523416aa67b","infoHashBuffer":{"type":"Buffer","data":[49,178,233,164,144,24,154,231,216,126,126,237,117,39,5,35,65,106,166,123]},"announce":[],"urlList":[]}}