{"title":"Processing: A Programming Handbook for Visual Designers","uid":4947926,"size":14650050,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32175943d0c50a8bd6064b15af19352afcb9aa1c&amp;dn=Processing%3A+A+Programming+Handbook+for+Visual+Designers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nova666","files":1,"time":1244746690,"description":"Full Title: Processing: A Programming Handbook for Visual Designers and Artists\n\nAuthors: Casey Reas and Ben Fry (Foreword by John Maeda).\n\nPublished 24 August 2007, MIT Press. 736 pages. Hardcover. ISBN: 9780262182621\n\nThis book is an introduction to the ideas of computer programming within the context of the visual arts. It targets an audience of computer-savvy individuals who are interested in creating interactive and visual work through writing software but have little or no prior experience. It is the result of six years of software development and teaching experience. The ideas presented have been continually tested in the classrooms, computer labs, and basements of universities, art and design schools, and arts institutions.\n\nThe majority of the book is divided into tutorial units discussing specific elements of software and how they relate to the arts. These units introduce the syntax and concepts of software such as variables, functions, and object-oriented programming. They cover topics such as photography and drawing in relation to software. These units feature many short, prototypical example programs with related images and explanation. More advanced professional projects from diverse domains including animation, performance, and typography are discussed in interviews with their creators. The extension sections present concise introductions to further domains of exploration including computer vision, sound, and electronics.\n\n---\n\nThis book was already on The Pirate Bay, but that version didn't work for me (probably a corrupted pdf), this is a fixed version.","torrent":{"xt":"urn:btih:32175943d0c50a8bd6064b15af19352afcb9aa1c","amp;dn":"Processing%3A+A+Programming+Handbook+for+Visual+Designers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32175943d0c50a8bd6064b15af19352afcb9aa1c","infoHashBuffer":{"type":"Buffer","data":[50,23,89,67,208,197,10,139,214,6,75,21,175,25,53,42,252,185,170,28]},"announce":[],"urlList":[]}}