{"title":"Assassins Creed [Wersja Polska - Polish Version]","uid":4171222,"size":5502050526,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:32bd6e150e57a36fff490d3c7b0acaacdecb44aa&amp;dn=Assassins+Creed+%5BWersja+Polska+-+Polish+Version%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HellR1d3r","files":2,"time":1209877065,"description":"Assassin&amp;#039;s Creed jest gra komputerowa i wideo stworzona przez Ubisoft. Akcja gry toczy sie podczas III wyprawy krzyzowej, w roku 1191. Gracz wciela sie w role czlonka sekty Asasynow znanego jako AltaÃ„?r (arab. Ã˜Â§Ã™?Ã˜Â·Ã™?Ã˜Â§Ã˜Â±), ktorego celem jest wyeliminowanie 9 historycznych postaci propagujacych wyprawy krzyzowe i odpowiedzialnych za cierpienia wielu ludzi. Gracz odwiedza trzy miasta: Damaszek, Akke i Jerozolime.\nRozgrywke charakteryzuje duza interaktywnosc z otoczeniem. Mieszkancy miast reaguja na gracza w zaleznosci od jego poczynan. Jesli gracz przeciskajac sie przez tlum lekko kogos popchnie, prawdopodobnie bedzie to zignorowane. Jesli natomiast rzuci kogos na ziemie i go zabije, mieszkancy moga zaczac atakowac zabojce lub uciekac, by wezwac straz. Ludzie moga byc rowniez podejrzliwi, a nawet zawiadomic straz jesli gracz zwisa z duzej wysokosci lub biega po dachu.\n\nWaznym elementem rozgrywki jest takze umiejetnosc &quot;wtopienia sie&quot; w tlum. W demie pokazanym na targach E3, zabojca zblizyl sie do swojej ofiary, gdyz wszedl w tlum kaplanow i udawal modlacego sie. Nie wzbudzilo to podejrzen i w konsekwencji stworzylo to okazje do zadania smiertelnego ciosu. Istnieja takze inne sposoby na unikniecie konfrontacji z straza. Bohater ma mozliwosc schowania sie do stogu siana czy udawania zwyklego &quot;cywila&quot; siedzac na lawce.\n\nW grze wystepuje rowniez oryginalny system walki. Opiera sie on na atakach i kontratakach, wymierzanych po ciosach przeciwnika. Sile oraz szybkosc ciosow mozna regulowac. Tak samo jest z przeciwnikami - nalezy prowadzic tak dlugo walke, az ktoras ze stron popelni blad i przyjmie pchniecie. Dzieki temu gra nabiera realizmu, w przeciwienstwie do innych gier w ktorych to gracz czasami moze przyjac serie smiertelnych ciosow i wychodzic z tego bez szwanku. W grze wystepuje system regeneracji zycia bohatera.\n\nJednym za najistotniejszych elementow rozgrywki jest wspinanie sie. Podczas gry gracz ma mozliwosc wlaczenia free run dzieki czemu AltaÃ„?r nabiera predkosci i sam wybiera odpowiednia droge poprzez wchodzenie na budynki czy akrobacje na elementach srodowiska. Ten pozornie latwy element calkowicie moze odmienic droge do likwidacji celu dajac graczowi duza swobode dzialania.\n\nSystem sterowania zostal rozwiniety i zmieniony wzgledem tego typu produkcji. Kazdy przycisk odpowiada czesci ciala. Mozliwe sa takze liczne kombinacje, dzieki czemu pozornie niewinne popchniecie, przy odpowiedniej sytuacji i inwencji gracza moze byc mocnym uderzeniem, niekiedy zle odbieranym przez inne postacie. Ubisoft rozbudowal swoj pomysl poprzez dwa &quot;zestawy&quot; ruchow. W podstawowej postawie poczynania bohatera sa delikatne i powolne co umozliwia wtopienie sie w tlum. Przytrzymujac RT (Right Trigger) AltaÃ„?r zmienia sile i typ czynnosci czyniac np. zwykly krok &quot;spacerowy&quot; - sprintem. Znacznie ulatwia to poruszanie po swiecie lecz wzbudza podejrzenia i jest zle odbierane przez przechodniow i sily porzadkowe.\n\nBohater dysponuje roznymi rodzajami broni. Glownym orezem do walki jest jednoreczny miecz, a narzedziem likwidowania celu - ukryty sztylet. Wraz z postepem w grze gracz otrzymuje liczne ulepszenia np. noze do rzucania, wieksza ich ilosc, potezniejsze miecze, specjalne elementy stroju, jak np. rekawice czy buty umozliwiajace sprawniejsze poruszanie sie po budynkach.\n\n\n\nScreenshoty: &lt;a href=&quot;\nhttp://xbox360gamer.pl/wp-content/uploads/2007/11/assassins_creed_1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xbox360gamer.pl/wp-content/uploads/2007/11/assassins_creed_1.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://www.myps3.com.au/img/news/Assassins-Creed-1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.myps3.com.au/img/news/Assassins-Creed-1.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://www.myps3.com.au/img/news/Assassin-s-Creed-Delayed-1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.myps3.com.au/img/news/Assassin-s-Creed-Delayed-1.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://www.myps3.com.au/img/news/Assassin-s-Creed-Delayed-1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.myps3.com.au/img/news/Assassin-s-Creed-Delayed-1.jpg&lt;/a&gt;\n\n\n\nPL: Gralem, wygralem, gra dziala bez zarzutu, kompletna wersja polska.\nEN: I&amp;#039;ve played it to the end, worked fine all the time without any problems, complete Polish version.\n\n\nChcesz to? Pobierz to, ale takze seeduj to, tak, jak inni seeduja dla Ciebie.\n\nWant it? Download it, but seed it for the others just like they seed for you.","torrent":{"xt":"urn:btih:32bd6e150e57a36fff490d3c7b0acaacdecb44aa","amp;dn":"Assassins+Creed+%5BWersja+Polska+-+Polish+Version%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32bd6e150e57a36fff490d3c7b0acaacdecb44aa","infoHashBuffer":{"type":"Buffer","data":[50,189,110,21,14,87,163,111,255,73,13,60,123,10,202,172,222,203,68,170]},"announce":[],"urlList":[]}}