{"title":"Alford-Gods of New Millenium-Shattering Truth of Human Origins (","uid":4531156,"size":1900842,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32e7057c5440e976c63c932939031cdca7f2e686&amp;dn=Alford-Gods+of+New+Millenium-Shattering+Truth+of+Human+Origins+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227559025,"description":"This is Alan F. Alford&amp;#039;s amazing book Gods of the New Millenium - The Shattering Truth of Human Origins (1996) where he examines the idea that human culture and indeed human genes may have been planted onto this planet by extraterrestrial intelligences in the distant past. Following the pioneering explorations and speculations by his predecessors von Daeniken and Sitchin, Alford examines several &quot;unexplained mysteries&quot; - from ancient Sumeria, pharaonic Egypt, Baalbek to Stonehenge, Nazca and Peru. He points out the unlikelyhood that the monumental buildings, found at those sites, could have been constructed with simple Iron Age technologies. To support this thesis, the author provides interesting information, especially on less conventional research which tends to be omitted from the &quot;classical&quot; anthropological and historical work. Whether one agrees with Alford&amp;#039;s book or not, Gods of the New Millennium does reconcile many disparate elements (religions, myths, archeological and geological records, etc.) into a cohesive whole, something not done by any other writer. Among the many fascinating notions put forth by Alford is that the &quot;gods&quot; (aliens) &quot;operate in eras of 2,160 years&quot;, and that we have been in a &quot;hands off&quot; period. Alford speculates that the next active era (of involvement of the gods in man&amp;#039;s affairs) would commence somewhere between the turn of the 21st century and 2012. Although the stories described in his books are truly astonishing, many scholars are beginning to have serious doubts wheter his interpretation of ancient texts is accurate and above all - true. Find out how how evidence supposedly exist that we have been visited by alien beings in past who not only created us but also built all those great monuments all around the world. 190 pages, many pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:32e7057c5440e976c63c932939031cdca7f2e686","amp;dn":"Alford-Gods+of+New+Millenium-Shattering+Truth+of+Human+Origins+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32e7057c5440e976c63c932939031cdca7f2e686","infoHashBuffer":{"type":"Buffer","data":[50,231,5,124,84,64,233,118,198,60,147,41,57,3,28,220,167,242,230,134]},"announce":[],"urlList":[]}}