{"title":"Billy Meier Contact Notes mp3 UFO Stokeman","uid":4698325,"size":1412951542,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:33a0f07cfa916253117bda0271d94622f9b608ac&amp;dn=Billy+Meier+Contact+Notes+mp3+UFO+Stokeman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Stokeman","files":158,"time":1233633924,"description":"Hello again everyone. Stokeman here. I just wanted to upload something that I feel I needed to share. This is not my normal upload, but times, they are a changing! I have always pondered many things throughout my short life and I believe that there are many people out there who are contemplating the same things. You know, things like; Why am I here?, What is the point of life?, Is there life after death?, Are there other intelligent races in the Universe? These are just a few! I have heard of the Billy Meier ufo photos and I have always been intrigued. I have done quite a bit of research on the subject and I have always been searching for some meaning and I believe that I have found some of that meaning withing the Billy Meier contact notes. \n In 1992, a man named Randolf Winters released a 16 tape set of the Billy Meier contact notes. A friend an I found them on the internet in MP4 format and I have converted them to MP3 format. I converted them just to be able to put them on my Phone. I have listened to these all the way through ,from beginning to end, twice now and I am developing my own thoughts, views, and truths from this. I have my own opinions, you all have to form your own. I will not lie to you all. These may be controversial to many, especially if you have a linear point of view on many aspects of human life such as scientific theories and religion. Download, SEED, and Enjoy! Just do me a favor and be open-minded, listen to all the audio, and then ask yourself what makes more sense? Is everything we have learned throughout our lives the real truth or have we all been mislead? Stokeman Out.....","torrent":{"xt":"urn:btih:33a0f07cfa916253117bda0271d94622f9b608ac","amp;dn":"Billy+Meier+Contact+Notes+mp3+UFO+Stokeman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33a0f07cfa916253117bda0271d94622f9b608ac","infoHashBuffer":{"type":"Buffer","data":[51,160,240,124,250,145,98,83,17,123,218,2,113,217,70,34,249,182,8,172]},"announce":[],"urlList":[]}}