{"title":"Castle of Days BotNS excerpts.","uid":9758420,"size":44311699,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:33e1bf1de0bfbbdd9bbec91fbf3480378aa214f1&amp;dn=Castle+of+Days+BotNS+excerpts.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"valbee","files":71,"time":1394775409,"description":"Know what you're downloading:\n\nSaved and uploaded for the fans and for posterity's sake.\n\nThis is the trial run of my new book/document scanner. It took me about 5 tries and some redos just to make it all look this well. The bottom line is cut off on some pages but it's about the best I could manage without cutting my book apart, considering how this scanner works. (It has a dead lift senser bar that stopped the scanning when I reached the bottom of the page)\n\nI figured I would upload it as is since 95% is there and quite readable. I chose this to test on because I didn't see it hosted and I think it's a nice, informative bit of information about BotNS I'm sure will still be enjoyable to most people that want to read these sections and haven't yet.\n\nPlease enjoy and hopefully I don't get too much hate for the small bits I couldn't scan well. It helped me learn how to use the scanner and what I can use it on effectively. I'll pick the right things to scan and save in the future.\n\n\n\nWhat's in the torrent:\nThese are the few sections in Castle of Days that feature the majority of the information about The Book of the New Sun. They include stories about BotNS, classifications, clarifications, the dictionary of strange words and some small story additions.","torrent":{"xt":"urn:btih:33e1bf1de0bfbbdd9bbec91fbf3480378aa214f1","amp;dn":"Castle+of+Days+BotNS+excerpts.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33e1bf1de0bfbbdd9bbec91fbf3480378aa214f1","infoHashBuffer":{"type":"Buffer","data":[51,225,191,29,224,191,187,221,155,190,201,31,191,52,128,55,138,162,20,241]},"announce":[],"urlList":[]}}