{"title":"Manual of Photography: Photographic and Digital Imaging, Ninth E","uid":4797405,"size":10860837,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:33f202bc2f33eb16c7dbdd1e13ea6204710f807b&amp;dn=Manual+of+Photography%3A+Photographic+and+Digital+Imaging%2C+Ninth+E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"VasiaZozulia","files":-1,"time":1237928440,"description":"The Manual of Photography is the standard work for anyone who is serious about photography - professional photographers and lab technicians or managers, as well as students and enthusiastic amateurs who want to become more technically competent. The authors provide comprehensive and accessible coverage of the techniques and technologies of photography.\nThe Manual has aided many thousands of photographers in their careers. The ninth edition now brings this text into a third century, as the first edition dates from 1890.\nMajor new updates for the ninth edition include:\nCoverage of digital techniques - more emphasis on electronic and hybrid media\nGreater coverage of colour measurement, specification and reproduction - illustrated with a new colour plate section\nDealing with the fundamental principles as well as the practices of photography and imaging, the Manual topics ranging from optics to camera types and features, to colour photography and digital image processing and manipulation.\nThe authors write in a reader-friendly style, using many explanatory illustrations and dividing topics into clear sections.\nThe authoritative text on virtually every technical aspect of photography and digital imaging\nIf you are serious about photography you can't afford to be without this book\nNew colour plate section illustrates the chapters on colour techniques","torrent":{"xt":"urn:btih:33f202bc2f33eb16c7dbdd1e13ea6204710f807b","amp;dn":"Manual+of+Photography%3A+Photographic+and+Digital+Imaging%2C+Ninth+E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33f202bc2f33eb16c7dbdd1e13ea6204710f807b","infoHashBuffer":{"type":"Buffer","data":[51,242,2,188,47,51,235,22,199,219,221,30,19,234,98,4,113,15,128,123]},"announce":[],"urlList":[]}}