{"title":"Brad R. Torgersen - The Chaplain's War","uid":13118423,"size":254063867,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:35258e9b60ff969e6109fe510f2ef72ad300397b&amp;dn=Brad+R.+Torgersen+-+The+Chaplain%27s+War&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":14,"time":1451656551,"description":"A chaplain serving in Earth's space fleet is trapped behind enemy lines where he struggles for both personal survival and humanity's future.\r\n\r\nThe mantis cyborgs: insectlike, cruel, and determined to wipe humanity from the face of the galaxy.\r\n\r\nThe Fleet is humanity's last chance: a multi-world, multi-national task force assembled to hold the line against the aliens' overwhelming technology and firepower. Enter Harrison Barlow, who like so many young men of wars past, simply wants to serve his people and partake of the grand adventure of military life. Only, Harrison is not a hot pilot, nor a crack shot with a rifle. What good is a Chaplain's Assistant in the interstellar battles which will decide the fate of all?\r\n\r\nMore than he thinks. Because while the mantis insectoids are determined to eliminate the human threat to mantis supremacy, they remember the errors of their past. Is there the slightest chance that humans might have value? Especially since humans seem to have the one thing the mantes explicitly do not: an innate ability to believe in what cannot be proven nor seen God. Captured and stranded behind enemy lines, Barlow must come to grips with the fact that he is not only bargaining for his own life, but the lives of everyone he knows and loves. And so he embarks upon an improbable gambit, determined to alter the course of the entire war.\r\n\r\n\r\n\r\nRead by George Newbern\r\nFormat: MP3\r\nBitrate: 48 Kbps\r\nLength: 11 hrs and 45 mins\r\nUnabridged Audiobook\r\nRelease Date:10-07-14\r\nPublisher: Audible Studios","torrent":{"xt":"urn:btih:35258e9b60ff969e6109fe510f2ef72ad300397b","amp;dn":"Brad+R.+Torgersen+-+The+Chaplain%27s+War","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35258e9b60ff969e6109fe510f2ef72ad300397b","infoHashBuffer":{"type":"Buffer","data":[53,37,142,155,96,255,150,158,97,9,254,81,15,46,247,42,211,0,57,123]},"announce":[],"urlList":[]}}