{"title":"A.Valley.Without.Wind-TiNYiSO-on","uid":7209435,"size":450517064,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:36d0d16e2724c52186ea24cea02187289f907ca8&amp;dn=A.Valley.Without.Wind-TiNYiSO-on&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ontotita","files":3,"time":1335188831,"description":"Proudly Presents\n\nA Valley Without Wind (c) Arcen Games\n\nRelease On: 23 April 2012 Disk Amount/Format: 1 CD ISO\nType of Game: Action Media Protection: Activation\n\nRelease Information:\n\nA 2D sidescroller without a linear path. An action game with tactical\ncombat and strategic planning. An adventure game that lets you free-roam\na vast, procedurally-generated world. A Valley Without Wind defies genre\nstereotypes. Unlike other procedurally-generated games, you also get a\nlogical progression in difficulty, plus helpful tips and checklists to\nguide your travels (should you need them)\n\nChoose for yourself how to prepare to face the vastly stronger Overlord\nComplete a variety of missions to earn arcane rewards, or roam the wilds\nto uncover secret missions and stashes of magical loot. Customize your\ncharacters with unique combinations of enchants and spells that change\nhow you move, jump, and fight. Or rescue people and bring them back to\nyour settlement, recruiting them to help you in return\n\nYou choose how to play, and the world adapts around you\n\nFeatures:\n\nTravel alone or with friends across an ever-expanding world of dangerous\ncreatures, powerful magic, high technology, and mysteries\n\nYou have choice. The world of Environ is procedurally generated, and\nlets you go anywhere you see -- including right into the overlord's keep\nat any time. (Good luck with that.)\n\nEnviron is endless. When you save one continent from an overlord, a\nlarger and more complex continent appears\n\nThe game adapts to how you play: as you demonstrate your proficiency\nmonsters upgrade accordingly. Killed 100 bats? Okay, time for... bats on\nfire!\n\nCrazy amounts of character customization. Combine a multitude of spells\nenchants, and equipment to create specialized character builds\n\nPlay as a long line of brave adventurers. It's not a question of IF your\ncharacter is going to die, but WHEN. Any character that dies is\npermanently lost, but you keep all your inventory, enchants, and general\nprogress in the game\n\nBecome a community leader. Rescue NPCs, have them join your settlement\nand construct buildings for them -- they may return the favor and help\nyou\n\nBe a clever problem-solver. Challenges have more than one solution, each\nwith its own pros and cons. You get to figure things out rather than just\njumping through a set of hoops\n\nDifficulty levels give exactly the challenge you want, from casual to\nhardcore on both platforming and combat independently\n\nNew updates are arriving all the time packed with additional content\nimprovements, and more\n\nBurn/mount, install, use keygen, play!\n\nGreetz: LARGEiSO and MEDIUMiSO\n\n(C) E/dfs\n&quot; SIZE DOES NOT MATTER! &quot;.","torrent":{"xt":"urn:btih:36d0d16e2724c52186ea24cea02187289f907ca8","amp;dn":"A.Valley.Without.Wind-TiNYiSO-on","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36d0d16e2724c52186ea24cea02187289f907ca8","infoHashBuffer":{"type":"Buffer","data":[54,208,209,110,39,36,197,33,134,234,36,206,160,33,135,40,159,144,124,168]},"announce":[],"urlList":[]}}