{"title":"Emperor Series (Book 1-5) Epub-Mobi","uid":9371609,"size":5307482,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36e6b291f3971a739c38173ab918d7e1ab5cc81b&amp;dn=Emperor+Series+%28Book+1-5%29+Epub-Mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":10,"time":1387538335,"description":"1. The Gates of Rome - spanning from 92 BC to 82 BC (Caesar at eight years of age to the victory of Sulla). Caesar grows up with his childhood friend Marcus outside Rome, terrorized by the slightly older neighbor Suetonius Prandus. Caesar and Marcus are trained to be warriors under the tutelage of ex-gladiator and soldier, Renius. After Caesar's father and others are killed in a slave revolt, the children go to Rome to join Caesar's uncle (in reality not related by blood) Gaius Marius and the populares faction. Marius, who is consul, is waging a political war against the conservative optimates led by Cornelius Sulla, the main antagonist. After a triumph celebrating Marius' victory over African tribes, Sulla is shipped of to Asia Minor to fight Mithridates VI of Pontus.\n\n2. The Death of Kings - spanning from 81 BC to 71 BC (Cornelia's pregnancy to the defeat of Spartacus). Opening in the Aegean Sea, Caesar leads a group of men to attack a rebellious fortress in Mytilene (historical) and he is saluted for his courage. Meanwhile, Brutus is forced to flee Greece upon having late meetings with a young woman. Accompanied by cruel but magnificent gladiator Renius, he sets off to Rome. Meanwhile, Cornelia is terrified as Sulla haunts her. Upon raping her on the night where her and Caesar's daughter Julia is born, Caesar and Brutus' friend Tubruk (caretaker of Caesar's estate when they were young) kills Sulla and manages to escape uncaught though others are tortured and killed. Caesar is caught by pirates and forced to ransom 20 talents.\n\n3. The Field of Swords - spanning from 67 BC to 49 BC (Four years after the defeat of Spartacus to the crossing of the Rubicon). Caesar is in Spain, still depressed after his wife's death and with no plans of further advancement. Pompey and Crassus rule Rome as consuls while Brutus mother Servilia travels to Spain to meet her son. Caesar goes out to ride with her and they fall in love, dividing Brutus and Caesar for the first time as Brutus unintentionally sees his mother and best friend in bed together. Soon returning to Rome, Caesar rallies to become consul but is disturbed as Crassus reveals a conspiracy to him, led by the insurgent Catiline. Taking his Tenth legion (originally created by Brutus as Caesar was in Greece), Caesar defeats Catiline and his supporters are brutally executed by Pompey. Confronting Crassus, Caesar reveals he knew Crassus was the mastermind of the whole conspiracy, yet unknown by all others, including Pompey. After becoming consul, Caesar goes to Gaul to fight an eight year war, spanning half the book. After finally defeating the great-king Vercingetorix, where his old friend Renius dies in battle and Cabera shortly before, prophesying he saw Caesar fall on the Ides of March in Rome.\n\n4. The Gods of War - spanning from 49 BC to 44 BC (the crossing of the Rubicon to assassination on the Ides of March). Pompey flees Italy as his troops are insufficient. Caesar takes the city, saying he is no tyrant nor dictator and just wants to purify Rome from men such as Pompey. As he finds himself ignored, Brutus joins Pompey instead. Ultimately going to fight him in Greece, Caesar is defeated by his once-friend Pompey at Dyrrhachium but takes revenge at Pharsalus where he reunites with Brutus, though the latter won't forgive him.\n\n5. Blood of Gods - Julius Caesar has been assassinated. A nation is in mourning. Revenge will be bloody.Rome?s great hero Julius Caesar has been brutally murdered by his most trusted allies. While these self-appointed Liberatores seek refuge in the senate, they have underestimated one man: Caesar?s adopted son Octavian, a man whose name will echo through history as Augustus Caesar.Uniting with his great rival Mark Antony, Octavian will stop at nothing to seek retribution from the traitors and avenge his father?s death. His greatest hatred is reserved for Brutus, Caesar?s childhood friend and greatest ally, now leader of the conspirators.","torrent":{"xt":"urn:btih:36e6b291f3971a739c38173ab918d7e1ab5cc81b","amp;dn":"Emperor+Series+%28Book+1-5%29+Epub-Mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36e6b291f3971a739c38173ab918d7e1ab5cc81b","infoHashBuffer":{"type":"Buffer","data":[54,230,178,145,243,151,26,115,156,56,23,58,185,24,215,225,171,92,200,27]},"announce":[],"urlList":[]}}