{"title":"The Devil in Gray By Graham Masterton","uid":9307867,"size":1079947,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:38605af573ea94134cac524f721aee85bfba6326&amp;dn=The+Devil+in+Gray+By+Graham+Masterton&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"maxdesolate","files":4,"time":1386348601,"description":"\nDecker Martin is a Richmond, VA detective who is slowly reaching the end of his rope. Carrying on affairs with various women (including his captain's wife), routinely looking for a new girlfriend, Martin is trying to forget the death of his beloved girlfriend, Cathy. That's not so easy as of late, especially because he's been having dreams about Cathy...and seeing her apparition in his apartment...\n\nCathy is warning Decker. The detective has just taken a unique and disturbing case--a killer who appears out of nowhere, brutally muders without being seen, and vanishes just as suddenly. The only eyewitness is a Down's Syndrome girl with a unique psychic gift. But as Decker pursues his invisible killer, he slowly descends into the Richmond subculture, into a fascinating and terrifying religion, and comes to realize that he may be on the killer's hit-list...\n\nFor decades, Graham Masterton has been crafting some truly unique horror novels. &quot;The Devil in Gray&quot; is no exception. It is gritty, it is witty, it is terrifying. Decker Martin is definitely an anti-hero prototype...occasionally hilarious, occasaionally unlikeable. The killer--and the deaths--are definitely spine-tingling, and then there is the mystique of the religious subculture you find yourself emersed in. &quot;The Devil In Gray&quot; is one to read late at night, with the lights on. And for you Civil War buffs out there...prepare to have your socks frightened off! The same goes for the rest of you.\n\nepub and mobi.","torrent":{"xt":"urn:btih:38605af573ea94134cac524f721aee85bfba6326","amp;dn":"The+Devil+in+Gray+By+Graham+Masterton","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38605af573ea94134cac524f721aee85bfba6326","infoHashBuffer":{"type":"Buffer","data":[56,96,90,245,115,234,148,19,76,172,82,79,114,26,238,133,191,186,99,38]},"announce":[],"urlList":[]}}