{"title":"Sherlock Holmes 2 : Jeu d'ombres TRUEFRENCH DVDRiP","uid":12866515,"size":735672506,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3b07612d96af2588bd9ccf05481458b4596f2aae&amp;dn=Sherlock+Holmes+2+%3A+Jeu+d%27ombres+TRUEFRENCH+DVDRiP&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"annuaireweb","files":1,"time":1448808116,"description":"Sherlock.Holmes.A.Game.of.Shadows.2011.REPACK.TRUEFRENCH.BDRip.XviD-AVS-AMIP\r\n\r\nSherlock Holmes a toujours été réputé pour être l'homme à l'esprit le plus affûté de son époque. Jusqu'au jour où le redoutable professeur James Moriarty, criminel d'une puissance intellectuelle comparable à celle du célèbre détective, fait son entrée en scène… Il a même sans doute un net avantage sur Holmes car il met non seulement son intelligence au service de noirs desseins, mais il est totalement dépourvu de sens moral. Partout dans le monde, la presse s'enflamme : on apprend ainsi qu'en Inde un magnat du coton est ruiné par un scandale, ou qu'en Chine un trafiquant d'opium est décédé, en apparence, d'une overdose, ou encore que des attentats se sont produits à Strasbourg et à Vienne et qu'aux Etats-Unis, un baron de l'acier vient de mourir… Personne ne voit le lien entre ces événements qui semblent sans rapport, hormis le grand Sherlock Holmes qui y discerne la même volonté maléfique de semer la mort et la destruction. Et ces crimes portent tous la marque du sinistre Moriarty. Tandis que leur enquête les mène en France, en Allemagne et en Suisse, Holmes et Watson prennent de plus en plus de risques. Mais Moriarty a systématiquement un coup d'avance et semble tout près d'atteindre son objectif. S'il y parvient, non seulement sa fortune et son pouvoir seront sans limite, mais le cours de l'Histoire pourrait bien en être changé à jamais…","torrent":{"xt":"urn:btih:3b07612d96af2588bd9ccf05481458b4596f2aae","amp;dn":"Sherlock+Holmes+2+%3A+Jeu+d%27ombres+TRUEFRENCH+DVDRiP","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b07612d96af2588bd9ccf05481458b4596f2aae","infoHashBuffer":{"type":"Buffer","data":[59,7,97,45,150,175,37,136,189,156,207,5,72,20,88,180,89,111,42,174]},"announce":[],"urlList":[]}}