{"title":"The Joy of Teen Sex S01E01    EoD","uid":6121172,"size":209823942,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3b1ad41ae00d67a01c5b23fcb94e637a484b2663&amp;dn=The+Joy+of+Teen+Sex+S01E01++++EoD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"5150EOD","files":-1,"time":1295747847,"description":"\n             The Joy of Teen Sex\n\n\n2011\n\n\nA bold, informative look at the love lives and sex lives of teenagers that tells it like it really is, and is definitely not just for teens\n\n\n\nSeason 1  Episode 1\n\n\n\n\nA frank and sometimes shocking look at the real world of teenage sex, complete with fears, frights and fun. Ruth and Dr Rachael meet a mother and daughter at loggerheads because the daughter refuses to go on the pill.\n\nSeventeen-year-old Rachel fell pregnant by accident last year and her mum Michelle is at a loss trying to get her daughter to protect herself from another unwanted pregnancy. While Ruth helps the pair to communicate better, can Dr Rachael find a suitable method of contraception for the teenager?\n\nRuth also meets 20-year-old Calvin from Liverpool. Calvin is gay and works as a drag queen on the club scene, but he's yet to have a sexual partner and is scared to lose his virginity. Sex coach Joanna gives him some helpful advice on foreplay to get him more accustomed to the idea of anal sex.\n\nNext into the clinic is Holly, 20, who takes the contraceptive pill but rarely uses condoms because she doesn't think the kind of guy she sleeps with would carry sexually transmitted infections - even though the fastest growing STI, chlamydia, has no visible symptoms. But Holly is shocked when Dr Rachael presents her with some cold hard facts about STIs.\n\nAlso looking for sex advice are 17-year-old lesbian Kim, keen to learn some more tricks for girls; sportsman Genna, 18, who is worried his sperm isn't normal; and 20-year-old Robyn who asks Ruth for help to make her boyfriend's semen more palatable!\n\n\n\n\n\n\n\n\n\n                                 ****EOD****\n\n                         Even Firefighters need Heroes\n\t\t\t\t","torrent":{"xt":"urn:btih:3b1ad41ae00d67a01c5b23fcb94e637a484b2663","amp;dn":"The+Joy+of+Teen+Sex+S01E01++++EoD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b1ad41ae00d67a01c5b23fcb94e637a484b2663","infoHashBuffer":{"type":"Buffer","data":[59,26,212,26,224,13,103,160,28,91,35,252,185,78,99,122,72,75,38,99]},"announce":[],"urlList":[]}}