{"title":"Led Zeppelin - The Soundtrack to the Film The Song Remains the S","uid":9073619,"size":1054619797,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3c87589a61dae1f4b335a7b3338d316ecf0f5eef&amp;dn=Led+Zeppelin+-+The+Soundtrack+to+the+Film+The+Song+Remains+the+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"}{eywood","files":27,"time":1382245414,"description":"Led Zeppelin \nThe Song Remains The Same\nExpanded Soundtrack\n\nThis is the second version of this I've created, due to discovery of a few new pieces that I didn't include the first time around.  \n\nI decided to do this because I am not at all happy with the way the 2007 remastered version of this album was put together.  Sure they fixed some bad notes, and did a lot of work editing Robert's vocals together from the three shows to sound as good as possible, but the music was remastered for the film, and mostly edited to fit around the available footage.  The same versions of the songs used for the film were used for the album, as if the CD were an afterthought.  This left some songs considerably shorter than the versions we are used to from the original album version (No Quarter and Whole Lotta Love), and other songs are from different performances altogether.  The first few verses of Stairway, for example, are from an inferior show (with an out of tune mellotron) than the one used on the original CD, and the brilliant guitar solo in Celebration Day was lost due to that song being taken from a different show (or at least that part of it).  Some songs had dropped beats and other timing anomalies that I found unacceptable.  Some particularly bad editing, especially in Moby Dick, left me wanting better out of this album.  \n\nAlthough this has been attempted before by CMI Music, I still wasn't happy with that version, as the bad editing and cuts in the versions used survived his efforts to compile it. So, using The Garden Tapes site as a guide, I decided to take all the different official versions of the MSG shows and put together The Song Remains The Same as it should be, not as a quickie throwtogether release that mimics the film version.  Sources used for this are the original CD version, the original DVD release of the movie (AC3 stream), the 2007 DVD (PCM stream) and CD releases, the Led Zeppelin DVD MSG section (PCM stream) and a fan edit called The Strongest Edition.  Due to different mixes in the sources it was quite hard to make all of it match up.  I had to change the panning of the channels to different widths and judiciously EQ all versions to a semblance of uniformity, but differences in the individual characteristics of the tracks they used (the snare drum sounds different on the original and 2007 releases, and it is panned more to the left on the original CD) left it so some of the edits may still be noticeable, especially in Moby Dick.  I hope this is forgiveable in light of the greater accuracy of the project as a whole.  I've used audience noise from parts of the 2007 CD as a way of covering the crossfades and dialogue composites and creating the encore break.  \n\nThe previously mentioned Strongest Edition was a decent attempt at doing what I have done here by combining the released versions of the original CD and film with some bootleg soundboard recordings, but it used versions of the songs with bad or unnecessary editing in them, and a couple tracks sounded awful.  A lot of dialogue was provided by this set, but I edited a good deal of it out.  Plant likes to babble a lot about things that only he understands, and I didn't want to clutter this up with too much of those Plantations.\n\nA detailed list of what I did is included in the folder.\n\nI Hope everyone who is a fan of this album/film/concert(s) likes what I've done here.  All editing was done with Adobe Audition 3.0.  Restoring the clipping on the 2007 versions was done with a nice little plugin called Relife.  SBE and flac 8 compressing with TLH.  Enjoy\n\n\n--}{eywood","torrent":{"xt":"urn:btih:3c87589a61dae1f4b335a7b3338d316ecf0f5eef","amp;dn":"Led+Zeppelin+-+The+Soundtrack+to+the+Film+The+Song+Remains+the+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c87589a61dae1f4b335a7b3338d316ecf0f5eef","infoHashBuffer":{"type":"Buffer","data":[60,135,88,154,97,218,225,244,179,53,167,179,51,141,49,110,207,15,94,239]},"announce":[],"urlList":[]}}