{"title":"Bram Stoker's Dracula (Collector's Edition)","uid":4370136,"size":9108791935,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3d54e6a95b2988f0b38569280923633a16fc9a85&amp;dn=Bram+Stoker%5C%27s+Dracula+%28Collector%5C%27s+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shemyaza","files":-1,"time":1220057565,"description":"Bram Stoker's Dracula (Collector's Edition)\n\nFrancis Ford Coppola's 1992 Bram Stoker's Dracula is a feverishly inventive movie that often overwhelms its own narrative flow, yet proves irresistible to watch. In the high-definition transfer on this two-disc Collector's Edition, Coppola's baroque, operatic set design, costumes, and cinematography look as lavish as they did on the film's first release. The director's grab-bag of visual effects are still bold and unabashed, if often over-the-top, and the actors still appear caught up in a certain hysterical pitch that feels a little forced but can be a lot of fun to watch. Gary Oldman's imaginative performance as the titular vampire carries the weight of Coppola's vision of Count Dracula as a tragic-romantic hero with Christ-like overtones. Keanu Reeves still looks a little lost in the pivotal role of Jonathan Harker, the London clerk who finds himself a prisoner in a Transylvanian castle while a 400-year-old vampire makes a play for his fiance back home (Winona Ryder). Anthony Hopkins is fearless as a daft Von Helsing, and Sadie Frost is very good as the doomed Lucy.\n\nThe second disc in this set includes several good documentaries, including a featurette on the making of the film, involving past and present interviews with the principal artists involved. (Coppola and screenwriter James V. Hart speak persuasively about their commitment to bringing Stoker's vision to the screen, rather than another revision.) Another documentary, &quot;In-Camera: The Naive Visual Effects of 'Dracula,'&quot; is a fascinating overview of Coppola's sometimes frustrated effort to get the timeless special effects he was seeking. There are also quite a few deleted scenes among the special features, the best of which is an alternative cut to the film's bloody ending.","torrent":{"xt":"urn:btih:3d54e6a95b2988f0b38569280923633a16fc9a85","amp;dn":"Bram+Stoker%5C%27s+Dracula+%28Collector%5C%27s+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d54e6a95b2988f0b38569280923633a16fc9a85","infoHashBuffer":{"type":"Buffer","data":[61,84,230,169,91,41,136,240,179,133,105,40,9,35,99,58,22,252,154,133]},"announce":[],"urlList":[]}}