{"title":"Bryce Courtenay~The Potato Factory~Mobi~Nookers","uid":7689947,"size":1723002,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d903a52a334af01c29f80f82950c225ed5a3e57&amp;dn=Bryce+Courtenay%7EThe+Potato+Factory%7EMobi%7ENookers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Nookers","files":1,"time":1349063378,"description":"The Potato Factory is a 1995 fictionalised historical novel by Bryce Courtenay, which was made into an Australian miniseries in 2000. The book is the first in a three-part series, followed by Tommo &amp; Hawk and Solomon's Song. The Potato Factory has been the subject of some controversy regarding its historical accuracy and its portrayal of Jewish characters.\nThe book is based on Ikey Solomon, the so-called &quot;Prince of Fences&quot;, and the basis of the Fagin character in the Charles Dickens novel Oliver Twist. Courtenay states in the book's introduction that it is a fictional historical novel based on extensive research, but portrays fictionalised versions of the characters. Author Judith Sackville-O'Donnell, who wrote another book on Ikey Solomon, claimed that the book was inaccurate and anti-Semitic. (News Article)\nThe book's other main character is a completely fictional woman named Mary Abacus. Abacus goes from serving girl, to prostitute, to high-class madam, to prisoner transported to Tasmania, to successful businesswoman. She gets her name for her outstanding ability to use an abacus.\nThe story starts in London in the early 19th century. Mary and Ikey start working together as business partners. It follows them as they are separately sent to Tasmania, a penal colony at the time.\nThe book was made into a four-part miniseries that aired in Australia in 2000.","torrent":{"xt":"urn:btih:3d903a52a334af01c29f80f82950c225ed5a3e57","amp;dn":"Bryce+Courtenay%7EThe+Potato+Factory%7EMobi%7ENookers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d903a52a334af01c29f80f82950c225ed5a3e57","infoHashBuffer":{"type":"Buffer","data":[61,144,58,82,163,52,175,1,194,159,128,248,41,80,194,37,237,90,62,87]},"announce":[],"urlList":[]}}