{"title":"Stevie Nicks SoundStage 2008","uid":4639192,"size":1355323030,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3dff3de490121948f76b8080885c0b63bd286c73&amp;dn=Stevie+Nicks+SoundStage+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"miona45","files":-1,"time":1231662486,"description":"Stevie Nicks SoundStage 2008 \n\nThis is the combined parts one and two Stevie Nicks' 2008 SoundStage concert, ripped from a retail DVD.  I believe this is much the same as the soon to be released 'Stevie Nicks Live in Chicago.'  Here's a description from the SoundStage website:\n\n&quot;In this episode, Soundstage captures a radiant Stevie Nicks in her first filmed solo performance since 1987. Clad in high heels and lace, Stevie boldly jumpstarts the night with &quot;Stand Back.&quot; Don't miss a second as she performs songs from her comprehensive career retrospective album, Crystal Visions. Throughout the evening, Stevie elegantly showcases her vocal abilities on &quot;Fall From Grace,&quot; and follows a stunning performance of &quot;How Still My Love&quot; with a cover of Dave Matthews Band's &quot;Crash&quot; interpreted through the eyes of a woman. Stevie also beautifully\nperforms &quot;Sara,&quot; a song rarely performed without Fleetwood Mac, before finishing up the hour with an amazing cover of Led Zeppelin's &quot;Rock and Roll.&quot;\n\nStevie Nicks knows how to put on a show. Part Two of this theatrical evening continues with a perfect mix of favorites like &quot;Landslide&quot; and &quot;Gold Dust Woman&quot; that will leave you yearning for more. During this intimate show, Stevie shares poignant personal memories and the origins of her songs. In long, dripping sleeves and trademark shawl, she breaks into her signature slow twirls, exuding a sensuous stage presence. The hour starts off with a riveting version of &quot;Rhiannon&quot;\nand ends with an epic rendition of &quot;Edge of Seventeen.&quot; If that's not enough, Vanessa Carlton joins Stevie on stage for a special duet of Bonnie Raitt's &quot;Circle Dance,&quot; as well as &quot;The One,&quot; a cut from Vanessa's latest album. Tune in to watch one of the most prolific and influential women in rock music history at her best!&quot;\n\nSongs\n\nStand Back\nEnchanted\nIf Anyone Falls\nRhiannon\nCrash Into Me\nSorcerer\nThe One\nGold Dust Woman\nI Need To Know\nCircle Dance\nLandslide\nSara\nFall From Grace\nHow Still My Love\nEdge of Seventeen\nRock and Roll\n\nThe original disc is more than 7 gigabytes.  I managed to get it down to 1.3 gig\nretaining good audio and video quality.  Please help seed.\n\nDuration: 1:46:08                                                \nFile Size: 1,355,321,978 bytes                                              \n=== Video Information ===                                                 \nVideo Codec Name:  XviD 1.1.0 Final                                     \nVideo Bitrate: 1499                                            \nQuality Factor (Bits/Pixel): 0.172                                   \nFrames Per Second: 29.970 fps                             \nDisplay Aspect Ratio:  1.782                                        \nFrame Width &amp; Height(pixels):  720x404              \n=== Audio Information ===                                                 \nAudio Codec: 0x0055 MPEG-1 Layer 3                                                \nAudio Bitrate: 192                                            \nAudio Channel Count: 2      ","torrent":{"xt":"urn:btih:3dff3de490121948f76b8080885c0b63bd286c73","amp;dn":"Stevie+Nicks+SoundStage+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dff3de490121948f76b8080885c0b63bd286c73","infoHashBuffer":{"type":"Buffer","data":[61,255,61,228,144,18,25,72,247,107,128,128,136,92,11,99,189,40,108,115]},"announce":[],"urlList":[]}}