{"title":"Krajobraz po bitwie (Landscape After Battle) - Andrzej Wajda","uid":4379610,"size":732528282,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3f1b6ef7bf31d0cb7948360a763ce9629d25e934&amp;dn=Krajobraz+po+bitwie+%28Landscape+After+Battle%29+-+Andrzej+Wajda&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"parkyns","files":-1,"time":1220585110,"description":"&quot;Landscape After Battle&quot; (1970; Krajobraz Po Bitwie) is a haunting and memorable film directed by Andrzej Wajda that takes place just after World War II. The film is based on several short stories written by Tadeusz Borowski, who survived Auschwitz. The film begins with the Americans entering a concentration camp at the end of the war in 1945, freeing the prisoners. However, they are freed from one camp and placed into another -- this time guarded by the Americans deep inside Germany. Fearing the people held inside the Nazi camps would know no sense of law, the authorities caged them in another prison until they could decide what to do with them. \n\nTadeusz (played by Daniel Olbrychski) is an intellectual man who sorts through rubbish to find books to read and writes poetry. He befriends a Jewish woman named Nina in the new camp who fled Poland after the war. After talking, they decide to leave the camp to go for a walk in the woods. Once outside the camp, the two share their feelings and becomes physically intimate. Nina tells Tadeusz she would rather be anywhere, except for Poland. Tadeusz, after thinking long, decides Poland is his home and should return there. Both decide that they should reenter the camp for a while, but doing so creates a dramatic turn of events neither expected. \n\n&quot;Landscape After Battle&quot; is a different type of war film, as it really starts with the war just ending. The viewers are exposed to some of the gritty details of the aftermath of war, as the name of the film suggests. The story is partially tragic, as are many Polish films, however, there is a powerful and artistic flair to the film. &quot;Landscape After Battle&quot; is a gem in the crown of achievement of Andrzej Wajda -- one that is sure to have several scenes that will leave you with lasting memories. \n\n\nLanguage: Polish\nSubtitles: English, French, Spanish, Italian and Brazilian Portuguese\n\n\nSize: 698Mb\nVideo Codec: XviD\nBitrate: 825 kbps\nWidth: 496 pixels\nHeight: 288 pixels\nDisplay Aspect ratio : 1.722\nFrame rate: 29.970 fps\nCodec : MPEG-1 Audio layer 3\nAudio Codec profile : Joint stereo\nBit rate : 129 Kbps\nBit rate mode : VBR\nChannel(s) : 2 channels\nSampling rate : 48 KHz\n\n","torrent":{"xt":"urn:btih:3f1b6ef7bf31d0cb7948360a763ce9629d25e934","amp;dn":"Krajobraz+po+bitwie+%28Landscape+After+Battle%29+-+Andrzej+Wajda","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f1b6ef7bf31d0cb7948360a763ce9629d25e934","infoHashBuffer":{"type":"Buffer","data":[63,27,110,247,191,49,208,203,121,72,54,10,118,60,233,98,157,37,233,52]},"announce":[],"urlList":[]}}