{"title":"Real World Adobe Illustrator CS5 {BBS}","uid":6894037,"size":57707793,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:40d7023ce8c8348420c823ebdccb05f51156f6ad&amp;dn=Real+World+Adobe+Illustrator+CS5+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1324128113,"description":"Real World Adobe Illustrator CS5 is the definitive reference to Adobe's industry-standard vector graphics software. With an easy, engaging style, author and past Illustrator product manager Mordy Golding takes readers through all of the features of the program, explaining not only how to use the multitude of features but also why and when to use them. This edition has been thoroughly updated for Illustrator CS5 and includes techniques on using the new perspective tools to draw, move, scale or duplicate objects in perspective. This edition also covers the refinements to Illustrator's drawing tools, such as its Stroke panel and brushes, including the new Bristle Brush for painting, as well as the Shape Builder tool, which makes it easier to merge, break apart, or modify objects. The multiple artboards that were introduced in CS4 are easier to manage in CS5, with a full Artboards panel.\n\nAlong with tips, sidebars, and expert commentary, there are also numerous 4-color illustrations and screen shots from contributing artists included to offer readers the most complete coverage on this extraordinary application. Designers from all fields--illustrators, animators, package designers, graphic designers, web designers, and more--will find Real World Adobe Illustrator CS5 their one-stop guide to creating powerful designs in Illustrator.\n\n\n# Paperback: 528 pages\n# Publisher: Peachpit Press; 1 edition (July 31, 2010)\n# Language: English\n# ISBN-10: 0321713060\n# ISBN-13: 978-0321713063","torrent":{"xt":"urn:btih:40d7023ce8c8348420c823ebdccb05f51156f6ad","amp;dn":"Real+World+Adobe+Illustrator+CS5+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40d7023ce8c8348420c823ebdccb05f51156f6ad","infoHashBuffer":{"type":"Buffer","data":[64,215,2,60,232,200,52,132,32,200,35,235,220,203,5,245,17,86,246,173]},"announce":[],"urlList":[]}}