{"title":"Christopher Jaros - OBE Suite Vol 1 - 2 [FLAC]","uid":11978452,"size":821126697,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:418efa66e86a853b557b80003288e3112ed52e11&amp;dn=Christopher+Jaros+-+OBE+Suite+Vol+1+-+2+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"elessedilgirl","files":3,"time":1433109196,"description":"OBE Suite Vol 1 (80 min) \n\nExperimental combination of SBRS, gongs recorded in a live session and Nabra-Sync patterns, plus some play around to extend the natural vibes of singing bowls and gongs. Results - unexpected, so - be prepared if you decide to use it. \n\nThe original name of this album was going to be &quot;Thetambient&quot; due to deep, dark, drone-like organic sounding - in a somewhat Mathias Grassow style. In general, this piece was born as a result of a need of the moment, so these effects were not intended. But after several experiments - I decided to rename it. This sound it reminds me shamanic stories told by Carlos Castaneda, touch of the Nagual so to speak. \n\nOBE Suite Vol 2 (80 min) \n\nExperiment continues. Vibration of over 200 singing bowls, space of a very specific gong, and rainy Nabra-Sync patterns, gently massaging in the background. This time is softer, or to be precise - a bit different - relaxed body and awakened mind in a state of expanded awareness. Comparing to vol 1, this recording acts more passive: state of subtle clear light with the opportunity to go out; no strong induction towards classic OBE, rather atmospheric &quot;phasing&quot;. From the perspective of sound - themes of delta and gamma are more perceivable. And these are organic vibrations, emerging from of natural sources. \n\nExperience the Wave of Change (headphones or good 2.0 speakers are recommended, setup your comfortable volume, music for quiet listening). \n\nreference libFLAC 1.2.1 20070917 \n\nSource: WebRip","torrent":{"xt":"urn:btih:418efa66e86a853b557b80003288e3112ed52e11","amp;dn":"Christopher+Jaros+-+OBE+Suite+Vol+1+-+2+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"418efa66e86a853b557b80003288e3112ed52e11","infoHashBuffer":{"type":"Buffer","data":[65,142,250,102,232,106,133,59,85,123,128,0,50,136,227,17,46,213,46,17]},"announce":[],"urlList":[]}}