{"title":"Grimhaven - Charles Willeford's lost Hoke Moseley novel (PDF)","uid":4824790,"size":79069948,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:41b41ca885d400d4cd2403450f2cc909508d8691&amp;dn=Grimhaven+-+Charles+Willeford%5C%27s+lost+Hoke+Moseley+novel+%28PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bobyllib","files":2,"time":1238901369,"description":"If you know anything about Grimhaven, you know how impossible it is\nto find.  This is a scan of the original manuscript of the unpublished\nsecond Hoke Moseley book (after Miami Blues).\n\nWith all due respect to Betsy Willeford, I don't think anyone should\nhave to travel to a library in Florida to read a book.  If she didn't\nwant it read by anyone, she shouldn't have donated it with the rest\nof her husband's papers.  But by making it available only there, all \nshe really accomplished was to make it easily available to a select\nfew and prohibitively difficult and expensive for everyone else to\naccess.  Anyone not &quot;geographically advantaged&quot; enough would have to\nspend hundreds - or thousands - of dollars (and significant travel\ntime) to share a few hours with this manuscript, and that imbalance\nreally isn't reasonable.  In fact, it's this situation - of Mrs. \nWilleford's own creation - that's resulted in the overpriced bootleg\ncopies being hawked around the net that she spends her time chasing\ndown.  Free distribution eliminates all of these problems.\n\nFor Charles Willeford and Hoke Moseley fans, this is the ultimate \n(disturbing) read.\n","torrent":{"xt":"urn:btih:41b41ca885d400d4cd2403450f2cc909508d8691","amp;dn":"Grimhaven+-+Charles+Willeford%5C%27s+lost+Hoke+Moseley+novel+%28PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41b41ca885d400d4cd2403450f2cc909508d8691","infoHashBuffer":{"type":"Buffer","data":[65,180,28,168,133,212,0,212,205,36,3,69,15,44,201,9,80,141,134,145]},"announce":[],"urlList":[]}}