{"title":"The Host (2013) Retail Pal DVD5 DD5.1 Subs Dutch TBS","uid":8781272,"size":4635160666,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:41b9d2b49ed00dc1d4e754f479727a44f79f88dc&amp;dn=The+Host+%282013%29+Retail+Pal+DVD5+DD5.1+Subs+Dutch+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"juutje","files":-1,"time":1375717243,"description":"The Host (2013) Retail Pal DVD5 DD5.1 Subs Dutch TBS\n\nThe Host (2013) \n\n\nVerenigde Staten\nSciencefiction / Thriller\n125 minuten\n\ngeregisseerd door Andrew Niccol\nmet Saoirse Ronan, Diane Kruger en Max Irons\n\nDe Aarde wordt bewoond door een intelligent buitenaards ras, bekend als de 'Souls'. Hoewel ze een vredig ras zijn, kunnen de Souls enkel overleven door een gastlichaam over te nemen. Op die manier nemen ze ook de controle over de gedachten over. In een poging om de geheime verblijfplaats van een aantal van de laatst overgebleven menselijke verzetshaarden te ontdekken, heeft de Soul Wanderer bezit genomen van het lichaam van Melanie Stryder, die werd gevangen genomen toen ze op zoek was naar haar familie. De Wanderer komt echter tot de verontrustende vaststelling dat Melanie haar gedachten gedeeltelijk kan afschermen om te voorkomen dat haar familie gevonden wordt. Naarmate de tijd verstrijkt begint Wanderer sympathie te voelen voor Melanie en haar liefde voor haar broer Jamie en haar partner Jared Howe. Wanderer wordt verscheurd tussen loyaliteit aan haar eigen ras en haar bloeiende liefde voor de mensen in haar herinneringen.\n\nStoryline\n\nA race of aliens who are non corporeal go from planet to planet looking for hosts. They come to Earth and basically take over human bodies. Now it's believed that once they take over a body all memories of the previous inhabitant are gone. And there are some humans who have remain hidden from them and are basically a resistance movement. So an alien charged with locating them known as the Seeker captures one of them a girl named Melanie and puts one of them who is known as Wanderer in her body, in hopes of finding out where the humans are. But Melanie for some reason is still there and she convinces Wanderer not to say anything to Seeker. Wanderer feels empathy for the humans. When Seeker is disappointed at her lack of progress, she informs Wanderer that she'll be removed and placed in a new host and she will be placed in Melanie. Melanie knowing she can't convince her the way she convinced Wanderer convinces Wsnderer to run away and they can meet with the humans. \n\n\n\nÂ» Vanaf 6 augustus te huur \nÂ» Vanaf 7 augustus te koop op DVD\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1517260/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1517260/&lt;/a&gt;\n\n Audio: English 5.1 dolby digital\nSubtitels: Dutch\nBeeld: 16.9 PAL\nMenu: aanwezig\nFormaat: VIDEO_TS (Extra's verwijderd, CCE9)\n\nEnjoy The Movie\n\nBenieuwd naar ons? Kom eens kijken\n\n\n\n","torrent":{"xt":"urn:btih:41b9d2b49ed00dc1d4e754f479727a44f79f88dc","amp;dn":"The+Host+%282013%29+Retail+Pal+DVD5+DD5.1+Subs+Dutch+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41b9d2b49ed00dc1d4e754f479727a44f79f88dc","infoHashBuffer":{"type":"Buffer","data":[65,185,210,180,158,208,13,193,212,231,84,244,121,114,122,68,247,159,136,220]},"announce":[],"urlList":[]}}