{"title":"The Ultimate Marilyn Manson &amp; The Spooky Kids Collection (Remast","uid":4176341,"size":1398978365,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:42e8cd1e3838ebcdd5da31ca1c6b2b86f4a85498&amp;dn=The+Ultimate+Marilyn+Manson+%26+The+Spooky+Kids+Collection+%28Remast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"stefthekiller","files":60,"time":1210152353,"description":"The Ultimate Spooky Kids Collection (Remastered)\n\nThis was Marilyn Manson before they changed their name from Marilyn Manson &amp; The Spooky Kids to just Marilyn Manson in 1992.\nThe Spooky Kids created an unique sound in the genre of Industrial. The first album of Marilyn Manson contains much songs that originate from the Spooky Kids, but the Spooky Kids had made a lot of demo&amp;#039;s who were released on self-promoted cassettes and sold in local stores.\n\nIn 1989, Brian Warner was a college student working toward a journalism degree, and gaining experience in the field by writing music articles for a South Florida lifestyle magazine, 25th Parallel. It was in this capacity that he was able to meet several of the musicians to whom his own band would later be compared, including My Life With the Thrill Kill Kult and Trent Reznor of Nine Inch Nails. He met Scott Putesky shortly afterward and, after showing him some lyrics and poems he had written, proposed that they form a band together. Warner, guitarist Putesky, and bassist Brian Tutunick recorded their first demo tape as Marilyn Manson &amp; The Spooky Kids in 1990, taking on the stage names of Marilyn Manson, Daisy Berkowitz and Olivia Newton Bundy, respectively. They were soon joined by Stephen Bier, who called himself Madonna Wayne Gacy; Bundy was replaced by Gidget Gein, born Brad Stewart. In 1991, drummer Fred Streithorst joined the band, with the stage name Sara Lee Lucas.\n\nThe stage names used by each member were representative of a concept the band considered central: the dichotomy of good and evil, and the existence of both, together, in every whole. &quot;Marilyn Monroe had a dark side&quot;, explained Manson in his autobiography, &quot;just as Charles Manson has a good, intelligent side&quot;. Images of both Monroe and Manson, as well as of others equally famous and notorious, were common in the band&amp;#039;s early promotional materials.\n\nThe Spooky Kids&amp;#039; popularity in the area grew quickly, largely because of radio DJ Scott David of WYNX-FM, an early fan who eagerly played songs from the band&amp;#039;s demo tapes on the air; and because of the band&amp;#039;s highly visual concerts, which drew from performance art and used many shock techniques. It was not uncommon to see onstage &quot;naked women nailed to a cross, a child in a cage, or bloody animal body parts&quot;; Manson, Berkowitz, and Gein variously performed in women&amp;#039;s clothing or bizarre costumes; and, for lack of a professional pyrotechnician, they would occasionally set their own stage props on fire. The band would dramatically contrast these grotesque theatrics with elements drawn from the culture of the members&amp;#039; youth in the 1970s and 1980s: characters from that era&amp;#039;s children&amp;#039;s television made regular, often somewhat altered, appearances on Marilyn Manson flyers and newsletters, and were frequently sampled in the music. They continued to perform and release cassettes shortening their name to Marilyn Manson in 1992  until the summer of 1993, when the band drew the attention of Trent Reznor, who at the time had just founded his own record label, Nothing Records.\n\nThis is the Ultimate Collection.... why? It has all the spooky kids demo tapes within and all the songs they&amp;#039;ve made completely remastered. Some alternate versions are not included but 95% is there. If you want to have the best spooky kids experience this is the right place for you! No more picking out songs of each demo or other source every time again and again because you like that one the best, here you have the best!\n\nCD1:\n01 Negative Three (After School Special)\n02 Son Of Man (The Beaver Meat Cleaver Beat)\n03 Dune Buggy (Lunchbox)\n04 Dope Hat (Refrigerator)\n05 IV-TV (Unreleased Version)\n06 Thrift (Refrigerator)\n07 Thingmaker (The Family Jams)\n08 Meat For A Queen (Grist-O-Line)\n09 White Knuckles (The Funnel Zone Alternate Mix)\n10 Cake and Sodomy (Lunchbox)\n11 Choklit Factory (After School Special)\n12 She&amp;#039;s Not My Girlfriend (Grist-O-Line)\n13 Strange Same Dogma (The Beaver Meat Cleaver Beat)\n14 Cyclops (After School Special)\n15 Learning To Swim (Lunchbox)\n16 Let Your Ego Die (Unreleased Version)\n17 My Monkey (Lunchbox)\n18 Filth (Refrigerator)\n\nCD2:\n01 Lunchbox (Refrigerator)\n02 Insect Pins (Portrait Rehearsals 1993)\n03 Luci In The Sky With Demons (The Family Jams)\n04 Scaredy Cat (Unreleased Version)\n05 Wrapped In Plastic (Refrigerator)\n06 Magic 8 Ball (Portrait Rehearsals 1993)\n07 Red (In My) Head (Unreleased Version)\n08 Get Your Gunn (Portrait Rehearsals 1993)\n09 Junk The Magic Dragon (The Beaver Meat Cleaver Beat)\n10 Sweet Tooth (Portrait Rehearsals 1993)\n11 Strange Same Dogma (The Family Jams)\n12 Snake Eyes &amp; Sissies (Portrait Rehearsals 1993)\n13 Big Mother (1991 Demo)\n14 Forest Head (1991 Demo)\n15 Scapegoat (1993 Rehearsal)\n16 Suicide Snowman (1992 Family Jams Rehearsal)\n\nCD3 (Bonus Tracks):\n01 My Monkey (Big Black Bus)\n02 Cake &amp; Sodomy (Grist-O-Line)\n03 Red (In My) Head (The Beaver Meat Cleaver Beat)\n04 Dope Hat (The Family Jams)\n05 Strange Same Dogma (Big Black Bus)\n06 Dune Buggy (Grist-O-Line)\n07 White Knuckles (The Family Jams)\n08 Jesus Is My Boyfriend (The Beaver Meat Cleaver Beat)\n09 Intro (The Family Jams)\n10 Interview With Scott David (The Beaver Meat Cleaver Beat)\n11 Janet (974-7153) (Lunchbox)\n12 My Monkey (The Beaver Meat Cleaver Beat)\n13 Outro (The Family Jams)\n14 Devil In My Lunchbox (Satan On Fire)\n15 Number Nine Pt. 1 (Satan On Fire)\n16 Number Nine Pt. 2 (Satan On Fire)\n17 Number Nine Pt. 3 (Satan On Fire)\n18 Cat In The Hat (Satan On Fire)\n19 Justify My Love (Satan On Fire)\n20 Herpes (live) (Mrs. Scabtree)\n21 White Knuckles (Big Black Bus)\n22 Hotline Messages (Big Black Bus)\n\nso have much fun with it, i&amp;#039;m always in for some feedback, improvements or critics!\n\nGreetings Stefan\n\n&lt;&lt;THIS IS A RELEASE FROM WWW.ULTIMATEMANSON.TK&gt;&gt;","torrent":{"xt":"urn:btih:42e8cd1e3838ebcdd5da31ca1c6b2b86f4a85498","amp;dn":"The+Ultimate+Marilyn+Manson+%26+The+Spooky+Kids+Collection+%28Remast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42e8cd1e3838ebcdd5da31ca1c6b2b86f4a85498","infoHashBuffer":{"type":"Buffer","data":[66,232,205,30,56,56,235,205,213,218,49,202,28,107,43,134,244,168,84,152]},"announce":[],"urlList":[]}}