{"title":"PBS - Evolution","uid":4677075,"size":2189848630,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4365187ebe3c0170884ed0d5f6642189c20437ae&amp;dn=PBS+-+Evolution&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Aquinas42","files":8,"time":1232936561,"description":"Evolution plays a critical role in our daily lives, yet it is one of the most overlooked principles of life. It is the mechanism that determines who lives, who dies, and who gets the opportunity to pass traits on to the next generation, and the next, and the next ...\n\nThe Evolution project is a seven-part, eight-hour television broadcast series, an extensive Web site, a far-reaching educational outreach initiative, and a HarperCollins companion book by acclaimed science writer Carl Zimmer.\n\nEvolution, which premiered on PBS September 24 - 27, 2001, travels around the world to examine evolutionary science and the profound effect it has had on society and culture. From the genius and torment of Charles Darwin to the vast changes that spawned the tree of life, from the role of mass extinctions in the survival of species to the power of sex to drive evolutionary change, Evolution is fascinating and far-reaching in scope. The series also explores the emergence of consciousness, the success of humans, and the perceived conflict between science and religion in understanding human life.\n\nThe Evolution project's goals are to heighten understanding of evolution and how it works, to dispel common misunderstandings, to illuminate why it is relevant to our lives, to improve its teaching, to encourage a national dialogue, and to prompt participation in all aspects of the project.\n\nEpisode titles\nDarwin's Dangerous Idea (two hours)\nGreat Transformations (one hour)\nExtinction! (one hour)\nThe Evolutionary Arms Race (one hour)\nWhy Sex? (one hour)\nThe Mind's Big Bang (one hour)\nWhat About God? (one hour) ","torrent":{"xt":"urn:btih:4365187ebe3c0170884ed0d5f6642189c20437ae","amp;dn":"PBS+-+Evolution","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4365187ebe3c0170884ed0d5f6642189c20437ae","infoHashBuffer":{"type":"Buffer","data":[67,101,24,126,190,60,1,112,136,78,208,213,246,100,33,137,194,4,55,174]},"announce":[],"urlList":[]}}