{"title":"White &amp; The Golden Sword v1.3","uid":8623573,"size":16255891,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:439e8883bc8357d1622a172e046e5cdfc1ea9f48&amp;dn=White+%26amp%3B+The+Golden+Sword+v1.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1372441224,"description":"\nJoin White in his adventure and defeat Obscurus, Lord of Darkness. Use your Golden Sword and your three special abilities to travel through its fifteen new levels full of fantasy and color.\n\nCupra Studios launches the adventure of a new character based on the classic concept of gaming platforms. Colorful designs and easy entertainment decorate the different levels through which the player must pass to complete the adventure.\nThe adventure of White\n\n==========================\n\nWhat is White? A white star? A drop of water? Nobody knows for sure. The unique info they have is he is a kind and gentle being who travels in search of something or someone that he only knows.\n\nOne day during his pilgrimage, White spotted on the horizon a column of smoke that penetrated deep into a forest consisting of trees glossy leaves. Immediately, our hero ran to the source of the smoke and among trees and undergrowth discovered a small village destroyed by fire.\n\nLooking between the houses found one of the beings that habited the village, a star lying on rubble. White was quick to take the star in her hands trying to wake her from the shock he had suffered. \n\nThe star opened his eyes slowly and soon after got his breath, White can heard the terrible story of what had happened in that village: A powerful being called Obscurus had attacked the village with an army of strange dark puppets. They captured all the stars from the village and imprisoned in a huge wooden cage taking them to Frozen Village, the Obscurus lair.\n\nWhite asked for the reasons of Obscurus and she replied that he wanted a way to absorb the immense magical power that the stars possess. White looked at the star with sorrow, &quot;I wish I could do something to help,&quot; he said, and the star suddenly changed his sad face into a big smile: &quot;Sure you can help!&quot;. \n\nThe star closed his eyes and began to glow with a blinding intensity, covering the stay of a bright white light. White closed his eyes as the blinding light was turned off to see where his new friend. Instead he found a beautiful, bright golden sword, was the star!\n\nOur brave hero wielded the sword, &quot;together we could get&quot; thought and headed toward Frozen Village in search of the stars captured by the evil Obscurus.\n\nAnd so begins the legend of White and Golden Sword, Would you like to finished?\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.Cupra.white2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.Cupra.white2&lt;/a&gt;\n","torrent":{"xt":"urn:btih:439e8883bc8357d1622a172e046e5cdfc1ea9f48","amp;dn":"White+%26amp%3B+The+Golden+Sword+v1.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"439e8883bc8357d1622a172e046e5cdfc1ea9f48","infoHashBuffer":{"type":"Buffer","data":[67,158,136,131,188,131,87,209,98,42,23,46,4,110,92,223,193,234,159,72]},"announce":[],"urlList":[]}}