{"title":"Need For Speed Rivals FIXED AND READY (j-TAG/RGH ONLY) XBOX360","uid":10303705,"size":8680078854,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:43e9dc6a7ad3e7bb04f12d2c3c03b8c49ab3b1f7&amp;dn=Need+For+Speed+Rivals+FIXED+AND+READY+%28j-TAG%2FRGH+ONLY%29+XBOX360&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"exdous69","files":-1,"time":1402007699,"description":"This game is for j-TAG/RGH ONLY! The file is a game rip, it does not contain an iso. this is ready to move to external and play. it has already been fixed. i also tested the rar. this file also includes a recovery record, so if there is data corruption, it can be fixed. \n\n\nNeed for Speed Rivals captures the adrenaline and intensity of the street's ultimate rivalry between cops and racers in a stunning open road environment. Built on the Frostbite 3 game engine, Need for Speed Rivals allows gamers play as either a cop or racer, where each side of the law has its own set of high stakes challenges, rewards and consequences. As a racer, the goal is to become infamous for taking risks behind the wheel and capturing your most intense escapes on video for the world to see. The more cops players evade, the more Speed Points they collect, enabling them to unlock new cars and items. Keep raising the stakes race after race to become an ever-more valuable target to the cops -- but risk losing it all if busted. As a cop, players work together as part of a team in pursuit of racers, earning prominence and rising in the ranks of the Police Force with every bust. Achieving higher ranks unlocks new police-only cars and more powerful pursuit tech.\n\nAt the heart of Need for Speed Rivals is AllDrive, an innovative new online feature that allows gamers to seamlessly transition from playing alone to playing with friends, eliminating the line between single player and multiplayer. Players will have to keep one eye on their rearview mirror as friends will be able to enter and exit races on-the-fly, creating a world where no two events will ever be the same.\n\n","torrent":{"xt":"urn:btih:43e9dc6a7ad3e7bb04f12d2c3c03b8c49ab3b1f7","amp;dn":"Need+For+Speed+Rivals+FIXED+AND+READY+%28j-TAG%2FRGH+ONLY%29+XBOX360","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43e9dc6a7ad3e7bb04f12d2c3c03b8c49ab3b1f7","infoHashBuffer":{"type":"Buffer","data":[67,233,220,106,122,211,231,187,4,241,45,44,60,3,184,196,154,179,177,247]},"announce":[],"urlList":[]}}