{"title":"Mysql Monitor Agent-2.3.3","uid":6366937,"size":56753408,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4407df777ffe5b69a4a036a4b233818fd71d7b9f&amp;dn=Mysql+Monitor+Agent-2.3.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"adzcqe","files":2,"time":1304542616,"description":"MySQL Enterprise Agent\n----------------------------------------------------------------------\nVersion 2.3.3                                               2011-02-28\n----------------------------------------------------------------------\n\nWelcome to the MySQL Enterprise Agent.  This README file contains the\nfollowing sections:\n\n    GETTING STARTED\n    CHANGES SINCE LAST RELEASE\n    UPGRADE NOTES\n    KNOWN ISSUES\n    REPORTING ISSUES &amp; FEEDBACK\n\nIMPORTANT: For late-breaking news, check the README file on the MySQL\nEnterprise Monitor download page.\n\nMySQL Query Analyzer is designed to gather query performance\ninformation from a variety of sources.  In this release you can use\nPlugins for Connectors to gather data for the Query Analyzer, or you\ncan use the MySQL Proxy (plugs into the Agent) as in the previous 2.x\nreleases.\n\nIf you use the MySQL Proxy instead of the Plugins for Connectors to\ncollect data for the Query Analyzer, be aware that the proxy is\nsitting between your application and the MySQL server and please note\nthe following:\n\n  Depending upon your system load, it is possible to overload the\n  proxy or have the proxy/agent consume system resources needed by\n  mysqld itself.  In particular, the memory needed by the MySQL Agent\n  for basic monitoring is fairly small and consistent and depends on\n  the number of rules you have enabled.  However, when the Query\n  Analyzer is enabled, the Agent can use significantly more memory to\n  monitor and analyze whatever queries you direct through it.  In this\n  case, the amount of memory used depends on the number of unique\n  normalized queries, example queries and example EXPLAINs being\n  processed, plus the network bandwidth required to send this query\n  performance data to the Service Manager.  In general, the amount of\n  memory used for the Query Analyzer is well-bounded, but under heavy\n  load or, in some cases under older versions of Linux, RAM usage by\n  Query Analyzer may be too high for your environment and load.\n\n  Therefore we advise you to use the MySQL Proxy agent plugin\n  extensively in development, test and stage environments under load\n  for an extended period of time before considering usage in a\n  production environment.  For all deployments:\n\n  1) We recommend carefully monitoring the Agent\\\\\\'s resource\n     consumption using the \\\\\\&quot;Memory Usage - Agent\\\\\\&quot; graph available on\n     the Graph tab. You can also add an SMTP or SNMP notification to\n     the new Heat Chart rule \\\\\\&quot;MySQL Agent Memory Usage Excessive\\\\\\&quot;.\n\n  2) If the amount of memory consumed is too high, consider sampling\n     queries during non-peak hours or monitoring only a subset of\n     queries on this system.\n\nIf you experience any problems with Query Analyzer, please open a\nSupport issue right away.\n\nFor more information about the MySQL Enterprise Monitor and the\nAgent, refer to http://www.mysql.com/products/enterprise/monitor.html.\n\nWe really want to hear your feedback!  Please see the section at the\nend on how to report bugs and other feedback.\n\nNote that the source code for the LGPL components used in the Agent\ncan be found in the licenses/lpgl directory.\n---\n\nGETTING STARTED\n\nFor more information on installation and setup, see the \\\\\\&quot;Getting\nStarted\\\\\\&quot; guide and the Installation chapter in the  online help, both\nof which are linked in the Documentation section of the download page.\n\nPlease take special note of the following:\n\n1) The account the agent uses to login and collect information about\n   the server being monitored needs certain privileges to do its job\n   (e.g. SUPER), along with INSERT and SELECT privileges on the\n   mysql.inventory table (as well as CREATE, unless you choose to\n   create it yourself).  See the \\\\\\&quot;Installation\\\\\\&quot; chapter in the online\n   help for more information.\n\n2) Consult the Troubleshooting sections of the online documentation if\n   any of these occur:\n   \n   a) you have trouble starting your agent;\n   b) the agent starts but doesn\\\\\\'t show up in the MySQL Enterprise\n      Dashboard;\n   c) you\\\\\\'re using the Query Analyzer but no results are shown on the\n      Query Analyzer tab and you\\\\\\'ve already waited 5 minutes or more\n      for the query data to populate.\n\nContact Support at https://support.oracle.com/ if you continue to have\nproblems.\n\nIf you are upgrading from a previous version, see the UPGRADE NOTES\nbelow.\n---\n\nCHANGES SINCE LAST RELEASE\n\nNew features in this release include:\n\n  o Oracle branding:\n    - Removed \\\\\\&quot;time bomb\\\\\\&quot; (no more license keys or subscription\n      expiration)\n    - Query Analyzer, Replication monitoring and all rules and graphs\n      now available to all users\n    - Integration with My Oracle Support (see your open Oracle Service\n      Requests for MySQL issues)\n  o New Advisors and Graphs:\n    - MySQL Cluster\n    - InnoDB Plugin\n    - Network and Disk IO, disk space\n  o New Aggregator accepts Query Analyzer data from any source\n\nWe hope you\\\\\\'ll try it out and give us your feedback!  However, in\norder to take advantage of some of these features you must route your\nqueries through the Agent\\\\\\'s proxy port (6446 by default) instead of\ndirectly to your MySQL server, or use one of the new Connector\nPlugins.  See the \\\\\\&quot;Query Analyzer\\\\\\&quot; chapter in the documentation for\nmore information.\n\nPlease see \\\\\\&quot;MySQL Enterprise Monitor Change History\\\\\\&quot; appendix\nin the documentation or online help for a complete list of changes,\nincluding functionality added or changed as well as bugs fixed.\n---\n\nUPGRADE NOTES\n\nIf you have previously installed the MySQL Enterprise Monitor on your\nsystem, you may use one of our upgrade installers. Please note:\n\no The MySQL Proxy now has an officially registered port number: 6446\n  (see http://www.iana.org/assignments/port-numbers for details).\n  The Agent installers now default to port 6446 instead of 4040.\n\n  If you are installing the Query Analyzer for the first time, this\n  port change is completely transparent and will have no impact on\n  you.\n\n  However, if you have previously deployed the Query Analyzer and use\n  our upgrade installer to upgrade your Agents, they will preserve the\n  old value (i.e. either the old default of 4040 or whatever you\n  specified during the original installation).  If you subsequently\n  install new agents, in addition to upgrading existing ones, you may\n  get in a situation where some agents use port 4040 for the Query\n  Analyzer (the upgraded ones) and some use port 6446 (the newly\n  installed ones, unless you change the default recommended during\n  installation).  You can easily correct the situation by editing the\n  proxy-address parameter in the agent configuration file:  /etc/mysql-monitor-agent.ini.  In this case, you must restart\n  the agent for the change to take effect.\n\no If you are upgrading from our previous 1.3 release, the new 2.2\n  Service Manager requires the new Agent; make sure to upgrade all\n  your Agents as well (upgrade installers are provided).\n\no If you are upgrading from our previous 1.3.x release, note that the\n  Agent upgrade installer will delete the old items-mysql-network.xml\n  file.  If you have manually edited this file to customize any of its\n  data collection definitions, you should backup the file before\n  running the Agent upgrade installer so you can restore those\n  customizations after the upgrade installation is done.\n\no If you are upgrading from a previous 2.x release, the new 2.2\n  Service Manager does not require the new Agent.  However, we\n  strongly recommend that you upgrade all your Agents to the latest\n  version in order to get the most recent features, bug, and\n  performance fixes (e.g. to get error and warning counts in SQL\n  queries in the Query Analyzer).\n\no WARNING: Only use the 2.2.x upgrade installers to upgrade from 1.3.x\n  or later. To upgrade from a release earlier than 1.3.x, you must\n  first upgrade to release 1.3.\n\no Note that the format and location of the file used to define custom\n  data collection definitions has changed.  As of our 2.0 release, see\n  the new version in /share/mysql-proxy/items/items-\n  mysql-monitor.xml for the new location and format.  As of our 2.1\n  release we have added an extra file, /share/mysql-\n  proxy/items/custom.xml, where you can put any custom definitions you\n  create in addition to the ones we deliver with the Agent.  This file\n  will be preserved as-is on upgrade, whereas items-mysql-monitor.xml\n  will be overwritten.  If you have any questions about how to\n  recreate your customized data collection definitions, contact MySQL\n  Support.\n---\n\nKNOWN ISSUES\n\nIn order for replication topologies to be properly discovered, each\nagent must be running on the same machine as the MySQL server it is\nmonitoring (i.e. it cannot be monitoring the server remotely).\n\nSeveral replication *groups* installed on the same physical machine\nthat use \\\\\\&quot;localhost\\\\\\&quot; to identify the master host will confuse\nreplication topology discovery and result in incorrect groupings.\nQuestion: Is this a common or uncommon setup?\n---\n\nREPORTING ISSUES &amp; FEEDBACK\n\nTo report a problem or get help with an issue, please login to &lt;a href=&quot;\nhttps://support.oracle.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://support.oracle.com/&lt;/a&gt; and create an issue with the \\\\\\&quot;Main problem\narea\\\\\\&quot; set to \\\\\\&quot;MySQL Enterprise Tools\\\\\\&quot;.  Generally, it\\\\\\'s better to\ncreate a separate issue for each problem you\\\\\\'re reporting.\n\nWe are very interested in any comments or suggestions you can provide.\nWe are especially interested in any suggestions for new Advisor Rules\nor Graphs (or proposed modifications for fine-tuning the ones we\nprovide).  Feel free to combine a bulleted list or summary of your\nevaluation experience into a single issue (see above). We suggest \nyou make the Summary field \\\\\\&quot;Feedback.\\\\\\&quot;\n---\n\nThanks and Happy Monitoring!\n\n  - The MySQL Enterprise Tools Development Team\n\nCopyright Ã‚Â© 2010, 2011, Oracle and/or its affiliates. All rights reserved.\n\nThis software and related documentation are provided under a license\nagreement containing restrictions on use and disclosure and are\nprotected by intellectual property laws. Except as expressly permitted\nin your license agreement or allowed by law, you may not use, copy,\nreproduce, translate, broadcast, modify, license, transmit,\ndistribute, exhibit, perform, publish, or display any part, in any\nform, or by any means. Reverse engineering, disassembly, or\ndecompilation of this software, unless required by law for\ninteroperability, is prohibited.\n\nIf this software or related documentation is delivered to the U.S.\nGovernment or anyone licensing it on behalf of the U.S. Government,\nthe following notice is applicable:\n\nU.S. GOVERNMENT RIGHTS Programs, software, databases, and related\ndocumentation and technical data delivered to U.S. Government\ncustomers are \\\\\\&quot;commercial computer software\\\\\\&quot; or \\\\\\&quot;commercial technical\ndata\\\\\\&quot; pursuant to the applicable Federal Acquisition Regulation and\nagency-specific supplemental regulations. As such, the use,\nduplication, disclosure, modification, and adaptation shall be subject\nto the restrictions and license terms set forth in the applicable\nGovernment contract, and, to the extent applicable by the terms of the\nGovernment contract, the additional rights set forth in FAR 52.227-19,\nCommercial Computer Software License (December 2007). Oracle USA,\nInc., 500 Oracle Parkway, Redwood City, CA 94065.\n\nThis software is developed for general use in a variety of information\nmanagement applications. It is not developed or intended for use in\nany inherently dangerous applications, including applications which\nmay create a risk of personal injury. If you use this software in\ndangerous applications, then you shall be responsible to take all\nappropriate fail-safe, backup, redundancy, and other measures to\nensure the safe use of this software. Oracle Corporation and its\naffiliates disclaim any liability for any damages caused by use of\nthis software in dangerous applications.\n\nOracle is a registered trademark of Oracle Corporation and/or its\naffiliates. Other names may be trademarks of their respective owners.\n\nThis software and documentation may provide access to or information\non content, products, and services from third parties. Oracle\nCorporation and its affiliates are not responsible for and expressly\ndisclaim all warranties of any kind with respect to third-party\ncontent, products, and services. Oracle Corporation and its affiliates\nwill not be responsible for any loss, costs, or damages incurred due\nto your access to or use of third-party content, products, or\nservices.\n","torrent":{"xt":"urn:btih:4407df777ffe5b69a4a036a4b233818fd71d7b9f","amp;dn":"Mysql+Monitor+Agent-2.3.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4407df777ffe5b69a4a036a4b233818fd71d7b9f","infoHashBuffer":{"type":"Buffer","data":[68,7,223,119,127,254,91,105,164,160,54,164,178,51,129,143,215,29,123,159]},"announce":[],"urlList":[]}}