{"title":"Cecelia Ahern - Un posto chiamato qui [Pdf - Ita]","uid":12783830,"size":1412022,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:44c2bcdd93f63510535dc27bfd222e7c631ba099&amp;dn=Cecelia+Ahern+-+Un+posto+chiamato+qui+%5BPdf+-+Ita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vitolanz","files":1,"time":1447841885,"description":"Cecelia Ahern - Un posto chiamato qui [Pdf - Ita][TNTVillage]\r\n----------------------------------------\r\n.: Dettagli :.\r\n\r\nAutore: Ahern Cecelia \r\nTitolo: Un posto chiamato qui\r\nAnno: 2009\r\nLingua: Italiana\r\nTraduttore: Maffi M.\r\nGenere: Rosa \r\nDimensione del file: \r\nFormato del file: PDF \r\n----------------------------------------\r\n.: Trama :.\r\nDa quando una sua compagna di classe, anni prima, è scomparsa nel nulla, la protagonista è ossessionata dall’idea di perdere cose e persone: per questo è perennemente in fuga dai legami, siano l’affetto di genitori o l’amore del suo analista. Forse per questo ha deciso di dedicare la propria vita a cercare persone scomparse, offrendo ai familiari disperati un barlume di speranza. Poco prima di incontrare un uomo che da un anno non ha più notizie del fratello, scompare però anche lei: mentre fa jogging imbocca un sentiero poco tracciato in un bosco sconosciuto, e si ritrova in un luogo magico e reale al tempo stesso. Un posto chiamato Qui, dove finiscono tutte le cose e le persone che si sono smarrite, tutte le sensazioni, le voci, i suoni e gli odori che sono stati dimenticati. Un mondo parallelo dove Sandy ritrova i propri oggetti perduti e le persone che ha cercato per tutta la vita, dimenticando di cercare se stessa. E ora, lontana dai propri cari e dalla casa da cui per tanti anni è fuggita, Sandy vuole disperatamente una sola cosa: escogitare il modo per tornare indietro. Per la prima volta in vita sua è lei che vuole essere trovata.\r\n----------------------------------------\r\n.: Biografia dell'autore :.\r\n\r\nCecelia Ahern (Dublino, 30 settembre 1981) è una scrittrice irlandese, laureata in giornalismo e comunicazione.\r\nÈ figlia del primo ministro irlandese Bertie Ahern, e sua sorella, Georgina, è sposata con Nicky Byrne, membro del gruppo pop irlandese Westlife. Cecilia ha sposato David Keoghan il 12 giugno 2010 in Celbridge, Irlanda. Dal 2009 è madre di una bambina, Robin, e nel 2012 è nato il suo secondogenito, Sonny.\r\nHa scritto il suo primo romanzo, P.S. I love you, a soli 20 anni. È divenuto un bestseller in brevissimo tempo ed è stato tradotto in oltre 50 paesi. Ben presto la Warner Bros ne ha acquistato i diritti per farne un film, uscito nei cinema italiani il 1º febbraio 2008 col titolo P.S. I Love You, e che vede protagonisti Hilary Swank e Gerard Butler. Nel 2014, invece, è uscito il film tratto da Scrivimi ancora, il secondo omonimo romanzo di Cecelia.\r\nOltre ad aver pubblicato diversi romanzi, ha scritto alcuni brevi racconti, destinando il ricavato delle vendite in opere di beneficenza. Ha prodotto la serie TV Samantha chi?, con Christina Applegate, trasmessa dall'emittente americana ABC","torrent":{"xt":"urn:btih:44c2bcdd93f63510535dc27bfd222e7c631ba099","amp;dn":"Cecelia+Ahern+-+Un+posto+chiamato+qui+%5BPdf+-+Ita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44c2bcdd93f63510535dc27bfd222e7c631ba099","infoHashBuffer":{"type":"Buffer","data":[68,194,188,221,147,246,53,16,83,93,194,123,253,34,46,124,99,27,160,153]},"announce":[],"urlList":[]}}