{"title":"Robin de Ruiter ebooks","uid":14108630,"size":7160870,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:44d0b19e1bd27669c5986e3469bf932706bd765f&amp;dn=Robin+de+Ruiter+ebooks&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"holocen","files":4,"time":1459377395,"description":"Robin de Ruiter (1951 Enschede in the Netherlands born writer, largely grown up in Spain.) In Spain, he studied theology, history and Spanish in 1974 and earned his title. As a writer he began his career as a freelance writer for various Spanish-language magazines. His writing / working was that of politics and religion. \r\n\r\nLater would be more towards the writer of books, there is always a lot of research, particularly in Latin America is known to be defined by their exceptional ability. He was very famous for the book, The hidden power behind the Jehovah's Witnesses, as well as insight into the world of Jehovah's Witnesses. \r\n\r\nMost of De Ruiter's books sold well and were bestsellers. Several books published in more than 40 countries. One of the best of his was the book, George W. Bush and the myth of al-Qaeda - the hidden power behind the terrorist attacks of September 11, 2001, which he in 2005, the Frontier Award was given. In the book appeared in the Netherlands through a publisher that he had established himself after he could find no publisher wanted to publish the book. \r\n\r\n(Investigative journalism - awarded the FRONTIER AWARD 2005) \r\n\r\nRobin de Ruiter and Fritz Springmeier Worldwide Evil and Misery English\r\nRobin de Ruiter Die 13 satanischen Blutlinien German\r\nRobin de Ruiter Der 11. September 2001 Osama bin Laden German\r\nRobin de Ruiter Ko je ubio Slobodana Miloševića i zašto Serbian","torrent":{"xt":"urn:btih:44d0b19e1bd27669c5986e3469bf932706bd765f","amp;dn":"Robin+de+Ruiter+ebooks","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44d0b19e1bd27669c5986e3469bf932706bd765f","infoHashBuffer":{"type":"Buffer","data":[68,208,177,158,27,210,118,105,197,152,110,52,105,191,147,39,6,189,118,95]},"announce":[],"urlList":[]}}