{"title":"Expeditions - Conquistador (2-click run)","uid":8527830,"size":1093068655,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4564c1426b0fa95970ea8977f81766829add2d58&amp;dn=Expeditions+-+Conquistador+%282-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1370070164,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a '2-click run' version a better version.\n\nDiscover a new world In the middle of the 16th century Spanish  explorers\nand warriors reached the shores of  America,  the  famous  Conquistadores\n\nThey ventured into territory no European has entered before in the  search\nfor gold, fame and adventure. What they found was a world completly  alien\nto them - bringing civilization as well as war and terror  to  the  native\ntribes\n\nYou are one the conquistadores: Choose your path wisely Every action  has\nits consquences - you can choose to battle the savages  and  civilize  the\nvast green jungles, or you can side with  the  natives  and  defend  their\nhomeland against the foreign invasion\n\nEach battle will define your fate\n\nFeatures\n=========\nDiscover the new wordl Travel to legendary places in America and make\nyour way to the mysterious El Dorado\nCreate your own army Train your recruits and lead them into battle\nWatch them grow from inexperienced newbies into seasoned warriors\nIt takes all sorts to build an army: Make sure you have covered each\narea of expertise\nEach character in your troop is an unique character. If he or she dies\nit will tear a deep hole in your strategies\nTake care of supplies, trade cunningly and watch your enemies - and\nbeware of false friends\nGet through the main quest or engage in several side quests - more than\n150 quests await\nBrutal battles or peaceful diplomacy: Solve all encounters on the 50\nbattle grounds your way\nTravel a huge world map filled with authentic and legendary locations\nEngage your friends in multiplayer battles - either via hot seat or\nTCP/ICP\nAs retro as it gets: The best turn based strategy from yesteryears in a\nmodern look and feel\n\nSystem Requirements: \n\nOperating system: Windows XP / Vista / 7\nProcessor: Intel Core 2 Duo processor with a clock frequency of 2.6 GHz\nMemory: 4 GB\nHard drive space: 2 GB\nSound device: compatible with DirectX 9.0c\nVideo: 256 MB VRAM (nVidia GeForce 8600 GT / ATI Radeon X1800)","torrent":{"xt":"urn:btih:4564c1426b0fa95970ea8977f81766829add2d58","amp;dn":"Expeditions+-+Conquistador+%282-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4564c1426b0fa95970ea8977f81766829add2d58","infoHashBuffer":{"type":"Buffer","data":[69,100,193,66,107,15,169,89,112,234,137,119,248,23,102,130,154,221,45,88]},"announce":[],"urlList":[]}}