{"title":"Pain in Childbearing and its Control,2nd Edition{BBS}","uid":6770644,"size":3668649,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:45fb4f8a2f477dbec0ea74e91435bcc8b200f86b&amp;dn=Pain+in+Childbearing+and+its+Control%2C2nd+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1319563009,"description":"Focusing on the mother's experience of pain and her contribution to its control, this accessible text covers the background to historical and scientific understanding of pain and considers methods of researching and measuring pain.\n\nNow in its 2nd edition, Pain in Childbearing and its Control explores pregnancy, labour and puerperal pain, along with fetal and neonatal pain. As well as approaching the topic in considerable depth, the word 'pain' is interpreted broadly. Throughout the text, research-based theoretical approaches to pain and pain control are presented within the context of care. The possibility of caring interventions being iatrogenic, or aggravating the woman's pain, lends this book a perceptively political orientation. Pain in Childbearing and its Control will be invaluable to midwives and a wide range of care providers who seek to assist the woman in coping with her experience of childbearing and any associated pain.\nFrom the Back Cover\nPain in Childbearing and its Control will help midwives and others, such as childbirth educators and other health care providers, to understand this complex area. This understanding will form the basis for the midwife and the woman to decide the most appropriate ways to help the woman to cope with the pain inherent in childbearing.and --This text refers to an out of print or unavailable edition of this title.\nProduct Details\n\n    * Paperback: 216 pages\n    * Publisher: Wiley-Blackwell; 2 edition (March 1, 2011)\n    * Language: English\n    * ISBN-10: 1405195681\n    * ISBN-13: 978-1405195683","torrent":{"xt":"urn:btih:45fb4f8a2f477dbec0ea74e91435bcc8b200f86b","amp;dn":"Pain+in+Childbearing+and+its+Control%2C2nd+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45fb4f8a2f477dbec0ea74e91435bcc8b200f86b","infoHashBuffer":{"type":"Buffer","data":[69,251,79,138,47,71,125,190,192,234,116,233,20,53,188,200,178,0,248,107]},"announce":[],"urlList":[]}}