{"title":"EXPLOITED COLLEGE GIRLS - Charlotte - Sexy Young Squirter **NEW*","uid":10488280,"size":1068840064,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:46a9c4067d73cc32dfbe0f68858ed5be2e003678&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Charlotte+-+Sexy+Young+Squirter+%2A%2ANEW%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"beta2008x","files":1,"time":1404512418,"description":"\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=sbt2z_cht.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=sbt2z_cht.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=3jjhu_charlotte_sd_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=3jjhu_charlotte_sd_s.jpg&lt;/a&gt;\n\n\nIt turns out our girl Charlotte has done a little personal exploration with her &quot;neck massager&quot; and discovered that in addition to banishing an achey neck, it can give her intense squirting orgasms. Yes, of course Jay got it on camera. Yes, of course it's fantastic. Aside from being a squirter, Charlotte is an all around sex pot with BJ skills that are beyond compare and a banging' body that's absolutely built for fucking.\nYou can see right away that Charlotte is cute, sexy, comfortable and a little wild. In addition to her various threesomes she reveals that she's recently learned to give herself massive squirting orgasms with her Hitatchi. Sidenote - do you think the button-down, respectable Japanese businessmen that run Hitachi have any idea that at least 75% of Americans under 30 don't know anything about their brand beyond huge, gushy solo orgasms?\nAnyway, back to the good stuff. Jay starts this one off fast and dirty when he demands Charlotte drop to her knees and start sucking to prove her BJ skills are as good as she brags. Verdict? Hell yes. This girl knows her way around a dick. Things eventually get moved over to the bed and Jay asks a few more questions, but it's clear Charlotte wants to get started. When she strips out of her adorable bra and panty combo we find that she's already a little wet and excited from sucking Jay's cock. A little bit of finger banging and she's ready for the big Hitatchi show. Be sure to stay tuned for the replays, this is one intense, explosive orgasm.\nAfter Charlotte soaks herself, the bed (and a camera!) Jay has her repeat her amazing oral with a second blowjob. This one is even more intense than the first and Charlotte even gags herself as she tries to deep throat. From there Jay maneuvers her into doggy where he drills her from behind. After a bit more sex, including some really intense cowgirl, Charlotte gets to her knees again for a facial. This turns out to be one of the best we've featured on ECG - instead of Jay jacking it in the general direction of a his target's face, Charlotte takes control and gives herself a facial in a move we're thinking of calling 'the jizz suicide'. Enjoy.","torrent":{"xt":"urn:btih:46a9c4067d73cc32dfbe0f68858ed5be2e003678","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Charlotte+-+Sexy+Young+Squirter+%2A%2ANEW%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46a9c4067d73cc32dfbe0f68858ed5be2e003678","infoHashBuffer":{"type":"Buffer","data":[70,169,196,6,125,115,204,50,223,190,15,104,133,142,213,190,46,0,54,120]},"announce":[],"urlList":[]}}