{"title":"Scarlet 06 (2013)(2 covers)(1440&amp;2048px-HD)(theProletariat-N","uid":8112595,"size":116438632,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4789133b11646a36f339b3d55c6a694e5118c291&amp;dn=Scarlet+06+%282013%29%282+covers%29%281440%26amp%3B2048px-HD%29%28theProletariat-N&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackcanary","files":-1,"time":1360224324,"description":"This torrent includes both 1440px and 2048px-HD versions  \n*Note: You can download both or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software.  If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n========================================================\n\nEnglish | CBR | 35 Pages\n\nScarlet #6\nPublisher:  ICON\nPublication Date:  February 6, 2013\n\nWritten by Brian Michael Bendis\nPencils by Alex Maleev\nLetters/Production by Chris Eliopoulos\n\nTHE AWARD WINNING, BEST SELLING, POWERHOUSE CREATIVE TEAM BEHIND DAREDEVIL, HALO, AND THE AVENGERS UNLEASH THEIR BOLDEST PROJECT YET! SCARLET! This is the comic experience of the year! The first creator owned series by one of the most successful teams in all of modern comics. Scarlet is the story of a woman pushed to the edge by all that is wrong with the world. A woman who decides to stand up and fight back. A woman who will not back down. A woman who discovers within herself the power to start a modern American revolution!! In the vein of Alias, Powers, and Jinx, Scarlet debuts a fascinating new comics character that, with every issue, reveals new things about herself against a completely original backdrop of intrigue and drama. Get in on the ground floor of the first creator owned series by Bendis since Powers, and the first creator owned series by Maleev...ever. (and, yes, the trademark obnoxious Bendis letter column will be here too)\n\nScarlet's call to arms has been heard all over the world. And the world reacts. Can a modern revolution gain traction? And what will the government do to shut her down?\n\nThanks goes to theProletariat for this release.","torrent":{"xt":"urn:btih:4789133b11646a36f339b3d55c6a694e5118c291","amp;dn":"Scarlet+06+%282013%29%282+covers%29%281440%26amp%3B2048px-HD%29%28theProletariat-N","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4789133b11646a36f339b3d55c6a694e5118c291","infoHashBuffer":{"type":"Buffer","data":[71,137,19,59,17,100,106,54,243,57,179,213,92,106,105,78,81,24,194,145]},"announce":[],"urlList":[]}}