{"title":"Tom Rapp...Stardancer(1972)[FLAC]","uid":7017692,"size":192218025,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:486278df101b9553d632f1957b59ffdf01ae8eca&amp;dn=Tom+Rapp...Stardancer%281972%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":15,"time":1328719762,"description":"[img]http://ecx.images-amazon.com/images/I/51HIk6V2h2L._SL500_AA300_.jpg[/img]\n\n[color=Green] Stardancer [1972](2009) - Lemon / CDLEM 128[/color]\n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1 Fourth Day of July 4:55 \n2 For the Dead in Space 4:05 \n3 The Baptist 5:00 \n4 Summer of '55 2:13 \n5 Tiny Song 2:33 \n6 Stardance 5:42 \n7 Marshall 2:15 \n8 Why Should I Care 3:07 \n9 Touch Tripping 4:55 \n10 Les Ans 1:50 \n\nTom Rapp's first album for Blue Thumb was in some ways an improvement over the disappointing final pair of records he did for Reprise, but in others, it continued the downward slide. In title and cover art, it harked back to Pearls Before Swine's classic first two albums for ESP-Disk, complete with another painting by Breughel the Elder on the sleeve, but the album was produced in Nashville and features the usual local session crew: pianist David Briggs, fiddle player Buddy Spicher, multi-instrumentalist Charlie McCoy, and the like. They're undeniably fine players all, having worked with everyone from Elvis to Mike Nesmith, but Rapp is a special case. The best Pearls Before Swine songs were simply, almost starkly arranged, often with only guitar or harp, and sometimes with Rapp's delicate voice by itself. There are some excellent songs on Stardancer, particularly the mournful title track and &quot;For the Dead in Space&quot; (later the title of an excellent Tom Rapp tribute album), and &quot;Fourth Day in July&quot; is one of Rapp's most meaningful anti-war songs. However, the production (by longtime partner Peter Edmiston) is simply inappropriate, with far too many instruments and an uncomfortable level of slickness. 1973's Sunforest would come closer to the true Tom Rapp sound, but overall, Stardancer is a bit of a botch.\n\n[color=Blue]Pearls Before Swine was an American psychedelic folk band formed by Tom Rapp in 1965 in Melbourne, Florida. The group signed to ESP Disk and recorded One Nation Underground, a fairly successful release that was followed by the anti-war Balaklava (1968). In the next few years, Rapp often referred onstage, not quite seriously, to the group as &quot;the house band for the SDS.&quot; They continued to release albums and to tour until the 1970s, but Rapp retired in 1973 and became a lawyer, currently practicing in Florida.[/color]\n\ncd ripped by EAC\n\nplease seed\n\n[url]http://dickthespic.org/about/[/url]","torrent":{"xt":"urn:btih:486278df101b9553d632f1957b59ffdf01ae8eca","amp;dn":"Tom+Rapp...Stardancer%281972%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"486278df101b9553d632f1957b59ffdf01ae8eca","infoHashBuffer":{"type":"Buffer","data":[72,98,120,223,16,27,149,83,214,50,241,149,123,89,255,223,1,174,142,202]},"announce":[],"urlList":[]}}