{"title":"The Anthony Cumia Show 2015-03-26 MP4 MP3 combo","uid":11779032,"size":349783801,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:49750161c4ecf7daa7af90b47554dd93561d85a8&amp;dn=The+Anthony+Cumia+Show+2015-03-26+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mothergoose58","files":2,"time":1427476680,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Jim Norton, Von DeCarlo\n\nEpisode 135 - The week ends with Jim Norton joining Anthony to talk about Patrice O'Neal, how their comic friends have evolved over the years, language being policed in different situations, Jimmy wishing a nice ass fucking on Sheldon Silver, and they watch and comment on the public apology from the expelled fraternity student at University of Oklahoma. They get into a news story about John Boehner and one on Congresswoman Eleanor Holmes Norton's shit parking job, Von DeCarlo joins the guys to chat about men cock blocking, their opinions on drinking, and the concept and content of the Patrice O'Neal documentary &quot;Better than You&quot;. They share stories about Patrice, discuss his diabetes and illness, the contribution perks on the movie's Indiegogo page, Ant donates a new perk to the page, and Jimmy attempts to add his own &quot;special perk&quot;. They then talk about Patrice's fearlessness, play a clip of him on Fox News, weigh in on exercising freedom of speech, Patrice's ability to extract truth, Von talks about being questioned after Ant's firing, and somehow, they segue into ass eating. They watch a video of a pole dancing mama, wax about strip clubs, trips to Brazil, turning down roles, the end of Patrice's web series, and Louis C.K.. Ant tells Von about the SiriusXM &quot;Twitter beef&quot; that recently happened, they debate the ease of misinterpretation, Von expresses her gratefulness of the Patrice benefit and explains her involvement in it, Jimmy and Ant admit they need to work on communication, and the show ends with a bit of ribbing on each other and on Jesse Ventura. \n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:49750161c4ecf7daa7af90b47554dd93561d85a8","amp;dn":"The+Anthony+Cumia+Show+2015-03-26+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49750161c4ecf7daa7af90b47554dd93561d85a8","infoHashBuffer":{"type":"Buffer","data":[73,117,1,97,196,236,247,218,167,175,144,180,117,84,221,147,86,29,133,168]},"announce":[],"urlList":[]}}