{"title":"Fania All Stars - Fania All Stars With Hector Lavoe (1998)@flac","uid":11996119,"size":359280387,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4a96a7f67ea51859084ebd991e0c292fb41870b5&amp;dn=Fania+All+Stars+-+Fania+All+Stars+With+Hector+Lavoe+%281998%29%40flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alekow1","files":20,"time":1433666897,"description":"\nHector Lavoe\n\nHector Lavoe was born to sing. As Latin music evolved from the boogaloo of the late '60s to the salsa boom of the '70s, Lavoe was at its forefront and &quot;El Cantante&quot; (the singer) of some of its most representative songs. Born Hector Juan Perez in Ponce, Puerto Rico, on September 30, 1946, he was influenced by the Latin singers he heard on the radio, Daniel Santos and Chuito el de Bayamon, just to name a couple. As he grew more involved in music, he drew his inspiration from Puerto Rico's great sonero Ismael Rivera, as well as Cheo Feliciano. These influences are obvious in Lavoe's singing style: he attacks the son and montuno like the masters Rivera and Beny More, but Lavoe's natural talent for improvosation made him unique and very popular with salsa fans.\n\nAt the age of 17, Lavoe decided to quit music school in Ponce and set his sights on a singing career in New York City. By 1966, he found himself fronting Willie Colon's orquestra. Lavoe and Colon formed a partnership that would go on to span 14 albums, nearly all of which are gems in the world of Latin music. In 1973, Colon left Lavoe in charge of his orquestra, pushing Lavoe into his solo career. Without Colon, Lavoe's solo efforts only reconfirmed his singing ability and his inevitable rise to stardom. The pressures of being a huge salsa star were apparently too great for Lavoe. He had a difficult time handling his success and suffered a number of personal setbacks along the way. But Lavoe's fans never forgot about him and he always came back singing. In 1987, his final album, Strikes Back, was nominated for a Grammy.\n\nWith all the excess, fame, fortune, and tragedy from such humble beginnings, Lavoe's life has gone on to symbolize the salsa era of the '70s. With Colon, Lavoe helped shape the salsa sound of the '70s. As a solo artist, he defined the salsa sound of the '70s. And as one of the lead singers of the Fania All-Stars, Lavoe was the star among stars, &quot;El Cantante de los Cantantes.&quot; (AMG)\n\n\n\n\n\nI'm not Puerto-Rican, I don't speak spanish, but I love those songs and this is one of my most treasured CDs in my latin collection. \nWe've listened to it countlessly at home, for parties, I play it on the commute when I am tired, or as my wife say ''it's great moving music'' (during packing and moving). Or simply as a treat to sit down at the end of a long day and watch the sun set nursing a drink. It's got such energy and yet it just keeps flowing smoothly, with occasional jibes and dialogue by Hector and band. It's great stuff really. \nMoreover this is one of his best recordings, and there aren't that many of his still widely available (at least not while I was shopping for this item). Do yourself a favor and get it, if you so much as would like to have a salsa CD in your collection. You'll keep this one among your favorites long after you've explored the genre inside-out. (Customer from Amazon)\n\n &lt;a href=&quot;\nhttp://i.imgur.com/ZRN3eBC.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/ZRN3eBC.jpg&lt;/a&gt;\n\n\n01. Ublabadu    [5:56]\n02. Cuando, Cuando, Cuando    [2:51]\n03. Mi Gente (Live)    [7:34]\n04. El Rey De La Puntualidad    [6:46]\n05. Me Voy Pa' Moron    [4:14]\n06. Isla Del Encanto    [4:30]\n07. Semilla De Amor    [7:09]\n08. Siento    [6:32]\n\n\n\nProduced by Jerry Masucci\nLiner Notes by Chuck Herrmann\n\nLabel: Third\nReleased: 1998\nCatalogue: third 33343-2\n\nCodec: Flac\nCompression Level: 6\nQuality: High\n\n\nCD-rip by alekow (EAC and Flac)\nCovers Included (600dpi)\n\nEnjoy, Seed and Share","torrent":{"xt":"urn:btih:4a96a7f67ea51859084ebd991e0c292fb41870b5","amp;dn":"Fania+All+Stars+-+Fania+All+Stars+With+Hector+Lavoe+%281998%29%40flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a96a7f67ea51859084ebd991e0c292fb41870b5","infoHashBuffer":{"type":"Buffer","data":[74,150,167,246,126,165,24,89,8,78,189,153,30,12,41,47,180,24,112,181]},"announce":[],"urlList":[]}}