{"title":"Legend Complete Series with Richard Dean Anderson and John D Lan","uid":5295324,"size":5149835713,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4abf8279db4c8400dd2b5ee68eae5e5893b81ab2&amp;dn=Legend+Complete+Series+with+Richard+Dean+Anderson+and+John+D+Lan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mhandcock","files":25,"time":1264037014,"description":"Torrent from Demoniod:\n\nThis is a quirky, funny, Steampunk Sci-Fi Western series that is a gem which has been overlooked for too long in my opinion.I originally watched this show when it aired and loved it. I purchased some Video CDs off a friend years ago and decided to copy them down to AVI and share them. THESE ARE AT VIDEO CD/VHS QUALITY. There is nothing I can do about as that's the original source I have.\n\nThere hasn't been any hint about releasing this show to DVD even though Richard Dean Anderson spoke favorably of it and his time producing and acting in it. This is before Stargate SG-1 was on television and this features Richard Dean Anderson and John De Lancie's return to Television! If you enjoy the show please spread the word about it, seed the torrent and contact Richard Dean Anderson or Paramount about getting it on DVD. ENJOY AND SEED!\n\nFrom Wikipedia:\n\nLegend was a science fiction Western television show that ran on UPN from April 18, 1995 until August 22, 1995, with one final re-airing of the pilot on July 3, 1996. It was Richard Dean Anderson's first major role after the successful MacGyver series, and also starred John de Lancie, best known for his role as &quot;Q&quot; in Star Trek: The Next Generation.","torrent":{"xt":"urn:btih:4abf8279db4c8400dd2b5ee68eae5e5893b81ab2","amp;dn":"Legend+Complete+Series+with+Richard+Dean+Anderson+and+John+D+Lan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4abf8279db4c8400dd2b5ee68eae5e5893b81ab2","infoHashBuffer":{"type":"Buffer","data":[74,191,130,121,219,76,132,0,221,43,94,230,142,174,94,88,147,184,26,178]},"announce":[],"urlList":[]}}