{"title":"Victor Thorn's explosive book 9-11 on Trial","uid":4293078,"size":733488,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ba282270a299a17fdd1a75c76bdfd8b8a925bd0&amp;dn=Victor+Thorn%5C%27s+explosive+book+9-11+on+Trial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"darkdata","files":2,"time":1215979409,"description":"Victor Thorn&amp;#039;s explosive book 9-11 on Trial - The World Trade Center Collapse\n\nFile Type:\nAdobe pdf\n\nFiles:\nThorn - 9-11 on Trial - The World Trade Center Collapse (2006).pdf\n\nDiscuss This: &lt;a href=&quot;\nhttp://darkdata.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://darkdata.net/&lt;/a&gt;\n\n\n\nThis is Victor Thorn&amp;#039;s explosive book 9-11 on Trial - The World Trade Center Collapse (2006) which systematically \nimplodes the myth that the WTC towers were destroyed by kamikaze plane impacts or burning jet fuel. Thorn uses \nthe approach of a tough prosecutor in a courtroom in crafting this work that offers a different speeding bullet \nevery chapter. The prosecution theories are developed in a question and answer format based on information culled \nfrom 48 listed sources. During the discourse he flattens the pancake theory of the World Trade Center tragedies \nthat has become the current equivalent of the magic bullet theory regarding the assassination of US president Kennedy, \nvulnerable but being promoted by powerful political forces because some kind of answer was needed. The pancake theory \nhas been presented by believers in the conventional government theory that was further buttressed by the official 9/11 \nCommission Report, which critics denounced for its failure to interview critics of the government&amp;#039;s view and accompanying \nfailure to look beyond superficial alleged supportive evidence. A theory was needed to embrace a rapid-fire collapse of \nskyscrapers resulting from crashing airplanes and resultant fires in the impacted buildings. The pancake theory loomed \nas a chain reaction choice explaining how the buildings collapsed. Thorn flattens the pancake theory by pointing out \nsome convincing facts about the construction and composition of the World Trade Center buildings. For one thing, there \ndid not appear to be significant fire damage to bring the buildings down. It is pointed out that a Madrid skyscraper had \nendured after days of burning without collapsing. So did buildings in Los Angeles and Philadelphia following hours of fire \ndamage. Firemen on the scene at the WTC were quoted as stating that the fires were not of particularly significant strength \nwhile one telltale photo was taken of a woman waving out the window from one of the buildings amid fire activity. Another \nsignificant argument refuting the pancake theory resides in the potent composition of buildings constructed to endure in\n the wake of the sternest tests from nature and other elements. The strongly reinforced concrete and sturdy layers of steel \n made the buildings invulnerable to destruction in the manner described. Another point intelligently raised is that the \n telltale damage at ground level is consistent with explosive detonation rather than fire. Respected Protestant clergyman \n Reverend Robert Schuller commented in an interview after visiting Ground Zero that he observed tremendous amounts of dust \n on the ground. This is consistent with decimation by explosion rather than piles of charred rubble, which would have \n resulted had fire been the cause of the buildings&amp;#039; collapse. Numerous comments from on the scene witnesses ranging from \n first responders to occupants of the destroyed buildings who escaped to safety, as well as nearby bystanders, described \n explosions. 9-11 on Trial puts out an enormous but organized amount of important information, most of which was previously \n difficult to find, into a very readable book - one that proves beyond a reasonable doubt that the official story about the \n collapse of the WTC is one big lie. 175 pages, some pictures. A must read for everyone.\n\n\n&quot;Knowledge is power&quot; More information at http://DarkData.net","torrent":{"xt":"urn:btih:4ba282270a299a17fdd1a75c76bdfd8b8a925bd0","amp;dn":"Victor+Thorn%5C%27s+explosive+book+9-11+on+Trial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ba282270a299a17fdd1a75c76bdfd8b8a925bd0","infoHashBuffer":{"type":"Buffer","data":[75,162,130,39,10,41,154,23,253,209,167,92,118,189,253,139,138,146,91,208]},"announce":[],"urlList":[]}}