{"title":"The Assassination of Martin Luther King, Jr [1993] Denis Mueller","uid":6956246,"size":644939798,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4bd4ba49372a80c89b106742437679e1c0337e11&amp;dn=The+Assassination+of+Martin+Luther+King%2C+Jr+%5B1993%5D+Denis+Mueller&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1326588383,"description":" &lt;a href=&quot;http://bayimg.com/bAljhAAdo&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/bAljhAAdo&lt;/a&gt;\n\nThe Assassination of Martin Luther King, Jr [1993]\n\nTO COMMEMORATE MARTIN LUTHER KING DAY I ATTEPTED TO CREATE SOME RELEVANT TORRENTS ABOUT DR KING AND FOUND TO MY DISMAY THAT THE SHARE NETWORKS AND MY LOCAL LIBRARY HAD NO MATERIAL ABOUT DR KING OR HIS ASSASINATION, EXCEPT THIS ONE.\n\n\nThe killing of Martin Luther King Jr. remains an enduring and troubling mystery. There is significant evidence that King's most powerful opponent was the FBI's J. Edgar Hoover. Hoover had King's personal life rifled for negatives; tapped his phone; and was said to have sworn to &quot;get&quot; King.\n\nAlthough James Earl Ray confessed to King's murder, it appears that Ray was being &quot;run&quot; by sources with possible links to the CIA, FBI, and a host of Right Wing organisations infiltrated by Federal agents.\n\nThe tape includes footage of King speaking and many interviews with people close to both sides of the King killing. A must see for anyone interested in America's long battle for racial equality. A penetrating analysis of the Security State operations which targeted the man who remains one of the great figures of the 20th century.\n\nThe Assassination of Martin Luther King Jr. documents the untimely death of the American civil rights leader. The 1968 shooting of King in Memphis, TN, rocked the world. This video provides an examination of the details surrounding the shooting and includes an interview with the first reporter to talk to convicted assassin James Earl Ray. Ray initially confessed to the shooting, but later retracted his statement. The crime continues to raise controversy. King's final days, his murder, and some of the many theories associated with his death are investigated. The Assassination of Martin Luther King Jr. was re-released to commemorate the death of Ray, following King's widow's request to reopen the case. \n\nThe assassination of Dr. Martin Luther King, Jr. was one of the opening acts which plunged 1968 into a year of turmoil. Coming on the heels of the Tet Offensive which showed the war in Vietnam to be in disarray, and President Johnson's decision not to seek re-election, King's assassination was itself soon followed by the murder of Robert Kennedy, violence at the Democratic National Convention, and a general unraveling of the country into a period of violence and despair. \n\nLike the other assassinations of the 1960s, the King murder had its &quot;lone nut,&quot; in this case James Earl Ray, an escaped convict who purchased the rifle found near the assassination scene and was caught in flight two months later. But, also like the other assassinations, evidence of conspiracy was easily found, despite being ignored by government investigators. \n\n","torrent":{"xt":"urn:btih:4bd4ba49372a80c89b106742437679e1c0337e11","amp;dn":"The+Assassination+of+Martin+Luther+King%2C+Jr+%5B1993%5D+Denis+Mueller","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bd4ba49372a80c89b106742437679e1c0337e11","infoHashBuffer":{"type":"Buffer","data":[75,212,186,73,55,42,128,200,155,16,103,66,67,118,121,225,192,51,126,17]},"announce":[],"urlList":[]}}