{"title":"Von Dach H Major - Total Resistance - Der totale Widerstand","uid":6847450,"size":80790717,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4c93cc712ae10bc610ac1dd3b36cca34c755e6e9&amp;dn=Von+Dach+H+Major+-+Total+Resistance+-+Der+totale+Widerstand&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"naba888","files":6,"time":1322401817,"description":"Total Resistance - Der totale Widerstand - Major H. von Dach\n\nThis is a legendary work by the famed Swiss expert on guerrilla warfare, Major H. von Dach. Survivalists have rediscovered this important study on resistance and underground operations, some making it the keystone of their libraries. Well-written and illustrated with easy-to-understand drawings, Total Resistance analyzes and overviews the techniques needed to overcome an invading force, formation of guerrilla units, weapons, food and medical considerations, ambushes, sabotage and much more.\n\nPlease take note that the American 173 page edition has been seriously crippled compared to the original German 257 page edition. Does the US editor want to keep the American public stupid? Check it out for yourself.\n\nHÃƒÂ¤tten die Juden im Dritten Reich dieses Buch besessen, dann hÃƒÂ¤tten sie effektiv Widerstand leisten kÃƒÂ¶nnen und es wÃƒÂ¤re ihnen so manches Leid erspart geblieben.\n\nlanguages, Sprachen: english and german editions, deutsche und englische Ausgaben\n\ntags: guerilla, war, resistance, partisan, rebel, liberty, freedom, nwo, patriot, militia, revolution, survival, underground, Krieg, Widerstand, Untergrund, Kampf, Freiheit","torrent":{"xt":"urn:btih:4c93cc712ae10bc610ac1dd3b36cca34c755e6e9","amp;dn":"Von+Dach+H+Major+-+Total+Resistance+-+Der+totale+Widerstand","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c93cc712ae10bc610ac1dd3b36cca34c755e6e9","infoHashBuffer":{"type":"Buffer","data":[76,147,204,113,42,225,11,198,16,172,29,211,179,108,202,52,199,85,230,233]},"announce":[],"urlList":[]}}