{"title":"Coast to Coast AM 2012.02.09 GMO Foods, The Nephilim","uid":7029206,"size":55815395,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:4d34cef49f9ce86d2a2d8e858fd3a26c2abe0fd6&amp;dn=Coast+to+Coast+AM+2012.02.09+GMO+Foods%2C+The+Nephilim&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ViViDSOL","files":5,"time":1329173960,"description":"Coast to Coast AM 2012.02.09 GMO Foods, The Nephilim\n\nHost: \tGeorge Noory\nGuests: Jeffrey M. Smith, Scotty Roberts\n\nIn the first half, food expert Jeffrey Smith discussed the dangers of genetically modified foods and how pervasive these GMOs have become throughout the world. He noted a litany of newly emerging digestive and reproductive ailments that may be caused by GMOs and even suggested that the explosion in autism and Morgellons disease could also have sprung from the ongoing genetic modification of our food supply. Additionally, Smith said, farmers have noticed strange behavior, like agitation or listlessness, exhibited by their livestock that have a GMO-based diet. Fortunately, Smith reported that many doctors and veterinarians have seen dramatic improvement in the health of their patients upon the cessation of GMO foods. For more on the transformative nature of eliminating processed foods, see this video clip: \n &lt;a href=&quot;\nhttp://www.coasttocoastam.com/videos/?uri=channels/455280/1600517&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.coasttocoastam.com/videos/?uri=channels/455280/1600517&lt;/a&gt;\n\nprovided by Smith.\n\nBeyond just the health implications of GMOs, Smith stressed that these genetically modified seeds have begun to contaminate the larger agricultural infrastructure of the planet. He pointed to studies on allegedly non-GMO canola oil seeds as well as the indigenous corn crops of Mexico which reveal that they contain elements of genetic modification. Chillingly, he claimed that this is not accidental and that &quot;contamination is really the hidden agenda of the biotech industry and their enforcement wing in Washington.&quot; Donating only GMO foods to starving nations as well as introducing genetically modified mosquitos in African countries are other ways in which the industry aims to spread their wares across the globe. &quot;If we don't stop this,&quot; he warned, &quot;they could be replacing nature.&quot;\n\n-------------------------------------\n\nIn the second half, paranormal investigator and author Scotty Roberts his research into the Nephilim and their origins. He explained that his investigation of the infamous entities focused on the language of the original Hebrew texts where they are described. As such, he dismissed the popular notion that the Nephilim were &quot;fallen angels,&quot; since the entities are never given that moniker. Rather, they are said to be the result of a union between &quot;watchers&quot; and humans. Roberts theorized that the creation of the Nephilim could be traced all the way back to the Garden of Eden and a dalliance between Eve and an entity metaphorically called a &quot;serpent.&quot; As to the origins of these &quot;visitors&quot; who played a hand in creating the Nephilim, he acknowledged that they could have been spiritual beings, &quot;minor Gods,&quot; or even extraterrestrials.\n\nUltimately, Roberts said, these Nephilim are blamed for corrupting the human race by sharing forbidden knowledge with them, a theme appears in many creation stories. In light of this corruption, he surmised, the great flood of Noah's Ark lore was orchestrated not to punish the corrupt humans, but to wipe away the presence of the Nephilim on Earth. However, Roberts suggested that the Nephilim may still be on the planet as what we call &quot;demons.&quot; He cited a passage in the book of Enoch which says that the &quot;spirits&quot; of the Nephilim that died in the flood remained on Earth in a ghostly form to &quot;wreak the same havoc, from a spirit form, on humanity that they wreaked while in physical form.&quot;\n\nWebsite(s):\n &lt;a href=&quot;\nhttp://responsibletechnology.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://responsibletechnology.org&lt;/a&gt;\n &lt;a href=&quot;\nhttp://seedsofdeception.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://seedsofdeception.com&lt;/a&gt;\n &lt;a href=&quot;\nhttp://nongmoshoppingguide.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nongmoshoppingguide.com&lt;/a&gt;\n &lt;a href=&quot;\nhttp://intrepidmag.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://intrepidmag.com&lt;/a&gt;\n\nBook(s):\n\nGenetic Roulette: The Documented Health Risks of Genetically Modified Foods\n &lt;a href=&quot;\nhttp://www.amazon.com/exec/obidos/ASIN/0972966528/c2cam-20&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/exec/obidos/ASIN/0972966528/c2cam-20&lt;/a&gt;\n\t\nSeeds of Deception\n\t &lt;a href=&quot;\nhttp://www.seedsofdeception.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.seedsofdeception.com/&lt;/a&gt;\n\t\nThe Rise and Fall of the Nephilim\n\t &lt;a href=&quot;\nhttp://www.amazon.com/Rise-Fall-Nephilim-Extraterrestrial-Origins/dp/1601631979/c2cam-20&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Rise-Fall-Nephilim-Extraterrestrial-Origins/dp/1601631979/c2cam-20&lt;/a&gt;\n\t\n\nBecome A Coast Insider: \n &lt;a href=&quot;\nhttp://www.coasttocoastam.com/coastinsider&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.coasttocoastam.com/coastinsider&lt;/a&gt;","torrent":{"xt":"urn:btih:4d34cef49f9ce86d2a2d8e858fd3a26c2abe0fd6","amp;dn":"Coast+to+Coast+AM+2012.02.09+GMO+Foods%2C+The+Nephilim","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d34cef49f9ce86d2a2d8e858fd3a26c2abe0fd6","infoHashBuffer":{"type":"Buffer","data":[77,52,206,244,159,156,232,109,42,45,142,133,143,211,162,108,42,190,15,214]},"announce":[],"urlList":[]}}