{"title":"Dosso Dossi - Court Painter in Renaissance Ferrara (Art Ebook)","uid":12691162,"size":57485233,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d49ae976a8c9920f9529a9404a668fdc285ba09&amp;dn=Dosso+Dossi+-+Court+Painter+in+Renaissance+Ferrara+%28Art+Ebook%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1446673522,"description":"Humfrey, Peter, &amp; Mauro Lucco, &quot;Dosso Dossi: Court Painter in Renaissance Ferrara&quot;\r\nMetropolitan/Abrams | 1998 | ISBN: 0810965305 | Eng | PDF | 350 pages | 54.82 Mb\r\n\r\nImagination, sensual delight, a sharp wit—these qualities were enormously prized in sixteenth-century Ferrara, where one of the most cultured and powerful courts of the High Renaissance held sway. Dosso Dossi was the idiosyncratic, brilliant painter most responsible for turning those values into a glorious artistic reality. Dosso's rich color schemes are akin to those of his fellow North Italian Titian; he learned something about innovative composition from Raphael and about the force of the body from Michelangelo. But his paintings have a very individual appeal. In leafy natural surroundings containing an array of animals and heavenly bodies, events unfold that are often enigmatic, enacted by characters whose interrelationships elude definition. Dosso's painted world shares the spirit of contemporaneous epic poetry—such as Ariosto's Orlando Furioso—imbued as it is with mystery and transformation, energy and invention.\r\n\r\nAlong with his predecessor Giorgione, Dosso was one of the first painters to improvise on the canvas. Rather than following careful preparatory drawings, he composed and recomposed as he painted—a remarkably free process that is clearly revealed in new x-ray and infrared photographs. Dosso's virtuosic painting performance was thus itself a kind of magical invention. The play of his imagination is evident not only in the many pictures representing mythological or literary subjects but also in his religious paintings, which are lyrical and original, filled with spectacular visual effects and touches of humor","torrent":{"xt":"urn:btih:4d49ae976a8c9920f9529a9404a668fdc285ba09","amp;dn":"Dosso+Dossi+-+Court+Painter+in+Renaissance+Ferrara+%28Art+Ebook%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d49ae976a8c9920f9529a9404a668fdc285ba09","infoHashBuffer":{"type":"Buffer","data":[77,73,174,151,106,140,153,32,249,82,154,148,4,166,104,253,194,133,186,9]},"announce":[],"urlList":[]}}