{"title":"How We Test Software at Microsoft (2009)","uid":4811990,"size":2934731,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d83de8a90404d078a0a627d59cb52a3af263a9b&amp;dn=How+We+Test+Software+at+Microsoft+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bugzbunny","files":1,"time":1238371465,"description":"PUBLISHED BY Microsoft Press A Division of Microsoft Corporation, 2009\n\nAuthors-Alan Page; Ken Johnston; Bj Rollison \n\nDiscover how Microsoft implements and manages the software-testing process company-wide with guidance and insights direct from its test managers. Organizing any testing program the people, processes, and tools can be challenging and resource intensive. Even when the necessary tradeoffs are made, no development team can test every scenario. This book explains how a worldwide leader in software, services, and solutions staffed with 8,000 testers implements and manages its testing process effectively company-wide.\n\nWhether you re a tester or test manager, you ll gain expert insights on effective testing techniques and methodologies including pros and cons of various approaches. For interesting context, the book also shares such facts as the number of test machines at Microsoft, how the company uses automated test cases, and bug statistics. It answers key testing questions, such as who tests what, when, and with what tools. And it describes how test teams are organized, when and how testing gets automated, testing tools, and feedback with illuminating insights for software-development organizations of all kinds.\n\n","torrent":{"xt":"urn:btih:4d83de8a90404d078a0a627d59cb52a3af263a9b","amp;dn":"How+We+Test+Software+at+Microsoft+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d83de8a90404d078a0a627d59cb52a3af263a9b","infoHashBuffer":{"type":"Buffer","data":[77,131,222,138,144,64,77,7,138,10,98,125,89,203,82,163,175,38,58,155]},"announce":[],"urlList":[]}}