{"title":"Red Rider - Neruda [1983][1987][320 KBPS]","uid":9699033,"size":146952030,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4d9b0e10d531460df818a6ee21073b8fe2a52d87&amp;dn=Red+Rider+-+Neruda+%5B1983%5D%5B1987%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LameDuck69","files":20,"time":1393968461,"description":"Red Rider - Neruda [1983][1987]\n\n\n\n\n01 Light In The Tunnel\n02 Power [Strength In Numbers]\n03 Human Race\n04 Can't Turn Back\n05 Napoleon Sheds His Skin\n06 Walking The Fine Line\n07 Winner Take All\n08 Sights On You\n09 Crack The Sky [Breakaway]\n10 Work Out\n\n11 Light In The Tunnel/Human Race [Bonus Track]\n12 White Hot [Bonus Track]\n13 Lunatic Fringe [Bonus Track]\n \n\n\n\n\n320 KBPS [CBR]\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nRed Rider are a Canadian rock band popular in the 1980s. While the band achieved great success in Canada, the band never had a song in the Top 40 in the US, even though &quot;Lunatic Fringe&quot; became a hit on AOR radio.\n\nIn 1978, Tom Cochrane joined up with Rob Baker on drums, Jeff Jones on bass, Peter Boynton on keyboards and Ken Greer to form Red Rider. They were signed to Capitol Records and released their first album Don't Fight It in 1980. With the singles &quot;White Hot&quot; and &quot;Don't Fight It&quot;, the album quickly reached gold status. Their second album As Far as Siam was released in 1981 and featured the hit &quot;Lunatic Fringe&quot; which was used in the 1985 movie Vision Quest and which is now a mainstay on American classic rock radio. The song also saw high rotation on the United States cable network MTV. Boynton was replaced by keyboardist Steve Sexton on Red Rider's third album Neruda, released in 1983. The track &quot;Napoleon Sheds His Skin&quot; would become one of the more popular songs from the album.\n\nFor their 1984 album Breaking Curfew, John Webster replaced Sexton on keyboards. The album did not sell as well as Neruda and a dispute with Capitol Records over the future direction of the band resulted in Red Rider being dropped from the record label later in 1984.\n\nThe band subsequently signed with RCA. In what became a strong signal regarding the future of the band, they officially became known as Tom Cochrane and Red Rider, and released their self-titled fifth album in 1986 which included Ken &quot;Spider&quot; Sinnaeve on bass.\n\nIn 1987, Capitol released a compilation CD titled Over 60 Minutes with Red Rider, covering the band's first four albums. Also in 1987 the band who had been nominated 11 times for Juno awards finally was awarded one for group of the year.\n\nIn the fall of 1988, the band released their sixth album Victory Day which contained the track &quot;Big League,&quot; about the death of a young hockey player. The young man's father approached Cochrane on the day of a concert, mentioning that his son was a big fan of Red Rider's song, &quot;Boy Inside The Man.&quot; Cochrane asked the man if his son was going to be attending the concert, and the man responded that his son had recently died in a car accident. Another note about &quot;Big League&quot; is that Cochrane and Greer played it at GM place at the start of the 08/09 hockey season to commemorate the passing of Luc Bourdon, a member of the Vancouver Canucks. The song was featured in a segment on CBC Television's Hockey Night in Canada.\n\nRed Rider's final album, The Symphony Sessions, was released in 1989 and saw the band performing with the Edmonton Symphony Orchestra, as Procol Harum had done seventeen years before. Cochrane's solo career was taking off and the band broke up shortly after the album was released.\n\nThe three-CD box set Ashes to Diamonds, which includes material by both Red Rider and Cochrane as a solo artist, was released in 1993. Professional wrestler Kurt Angle uses an instrumental version of Lunatic Fringe as his entrance music in TNA. UFC fighter and former Pride Champion Dan &quot;Hendo&quot; Henderson uses Lunatic Fringe as his intro song.\n\nCochrane, Greer and Jones reunited in 2002, and have been touring as Tom Cochrane and Red Rider since.\n\n-----------------------------------------------------------------------------------\n\nNeruda is the third studio album by the Canadian rock band Red Rider, released in 1983. The album was recorded at Metalworks Studios in Toronto, Ontario. The figure on the album cover was inspired by Denise Sexton. The instrumental track &quot;Light In The Tunnel&quot; and &quot;Power&quot; have been used to open Cochrane's concerts on several tours. Neruda became Cochrane's 3rd straight Platinum album in Canada with Red Rider selling more than 100,000 copies.\n\nNeruda reached #66 on Billboard's Pop Albums chart in 1983 assisted by the singles &quot;Crack The Sky (Breakaway)&quot; and &quot;Power (Strength In Numbers)&quot; which reached #39 and #13 respectively on Billboard's Mainstream Rock chart. &quot;Human Race&quot; reached #29 in Canada.\n\nThe album is named after Chilean poet Pablo Neruda.\n\n-----------------------------------------------------------------------------------\n\nTom Cochrane: lead vocals, guitars, arrangements\nKen Greer: guitars, vocals, arrangements\nRob Baker: drums, percussion\nJeff Jones: bass guitar, vocals\nSteve Sexton: synthesizers, piano\n","torrent":{"xt":"urn:btih:4d9b0e10d531460df818a6ee21073b8fe2a52d87","amp;dn":"Red+Rider+-+Neruda+%5B1983%5D%5B1987%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d9b0e10d531460df818a6ee21073b8fe2a52d87","infoHashBuffer":{"type":"Buffer","data":[77,155,14,16,213,49,70,13,248,24,166,238,33,7,59,143,226,165,45,135]},"announce":[],"urlList":[]}}