{"title":"Stefan Molyneux - On Truth - The Tyranny of Illusion audiobook","uid":10404309,"size":104277901,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4e056f392ff64c52422875c1ab153f19141a2044&amp;dn=Stefan+Molyneux+-+On+Truth+-+The+Tyranny+of+Illusion+audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FDRURL","files":-1,"time":1403433448,"description":"We are born to truth, yet everywhere we are enmeshed in error. Superstition, irrationality and patriotism all work to cripple our natural affinities to rationality and empiricism.\n\nThis book, by Stefan Molyneux, host of Freedomain Radio, examines and explodes all the propaganda that stands between you and the simple truth of life, the universe and everything. All the truths that you were born with, that were scrubbed out of your mind for the profit and fun of your elders, will be reawakened in this short but powerful book.\n\nBegin the process of reclaiming your own reason, pick up this book, hold on for the ride, and arrive at the truth.\n\nAbout the author:\nStefan Molyneux is a Canadian philosopher, author, speaker, and host of Freedomain Radio. Molyneux's areas of focus include libertarian political philosophy, voluntaryism based on the strict application of the non-aggression principle, secular ethics, strong atheism, cryptocurrency (Bitcoin), history, non-violent parenting, and familial relationship issues. He has written and self-published eight non-fiction books, and his essays have been published on libertarian websites such as LewRockwell.com and antiwar.com. He is a frequent public speaker at political and technology conferences and has appeared on television, radio, and podcasts to discuss his views. His online philosophy show, Freedomain Radio, has independently produced over 1,500 videos and 2,700 podcasts as of June 2014. Jeffrey Tucker of the Ludwig von Mises Institute described Molyneux as &quot;one of the single most influential libertarian thinkers of our times&quot;\nMore of his books can be found here:  &lt;a href=&quot;\nhttps://freedomainradio.com/free/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://freedomainradio.com/free/&lt;/a&gt;","torrent":{"xt":"urn:btih:4e056f392ff64c52422875c1ab153f19141a2044","amp;dn":"Stefan+Molyneux+-+On+Truth+-+The+Tyranny+of+Illusion+audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e056f392ff64c52422875c1ab153f19141a2044","infoHashBuffer":{"type":"Buffer","data":[78,5,111,57,47,246,76,82,66,40,117,193,171,21,63,25,20,26,32,68]},"announce":[],"urlList":[]}}