{"title":"My Mum's biography ebook recompiled by KiwiSue49 mobi epub","uid":14722009,"size":6502236,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e738c8d8cbbdf277008439d01f1f4f1ebf50103&amp;dn=My+Mum%27s+biography+ebook+recompiled+by+KiwiSue49+mobi+epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KiwiSue49","files":3,"time":1464513703,"description":"Ok here goes.\r\n\r\n\r\nOne of the reasons for uploading this short biography of my Mum’s was to inspire / encourage others to do the same for themselves, friend, family member, etc.\r\n\r\nThe other reason is that it’s a nice enjoyable simple read, and wanted to share with you.\r\n\r\n\r\nPreface from inside the book:\r\n\r\nHello, my life story was written with the assistance of Andrea Buckland from the Biography Service Mary Potter Hospice, Kapiti, New Zealand, September 2013. I passed away from MND in January 2014. My daughter thought the biography was an enjoyable read and wished to share with others around the world so has recompiled it into an ebook for you.\r\n\r\n\r\n\r\n\r\n\r\nNotes: I took the originally compiled pdf (included in download) and reconstructed it in the epub creator program Sigil.\r\nThe epub opens up in Calibre for PC, Moonplus Reader for Android, and ibooks for ipads. The mobi which was created by converting the epub into a mobi with Kindle Previewer opens up in Kindle for Android, Kindle for PC, and Kindle on ipads..\r\n\r\nFor me when using Moonplus Reader on the Samsung tablet I found that the front cover displays better when in portrait mode. It also displays in the Navigation Menu ‘Front Cover’, but not in the Kindle app. Grr Kindle.\r\n\r\nMy tpb friend managed to import the mobi from Calibre on his PC to his Kindle device. Have seen online you can use itunes to get an ebook onto an ipad","torrent":{"xt":"urn:btih:4e738c8d8cbbdf277008439d01f1f4f1ebf50103","amp;dn":"My+Mum%27s+biography+ebook+recompiled+by+KiwiSue49+mobi+epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e738c8d8cbbdf277008439d01f1f4f1ebf50103","infoHashBuffer":{"type":"Buffer","data":[78,115,140,141,140,187,223,39,112,8,67,157,1,241,244,241,235,245,1,3]},"announce":[],"urlList":[]}}