{"title":"Lupin III vs Detective Conan","uid":5315542,"size":1040780437,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4ee187910d9964f7c14153a2c54dd4879c3480e4&amp;dn=Lupin+III+vs+Detective+Conan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"piden68","files":-1,"time":1264699847,"description":"Something is rotten in the Kingdom of Vespania. Queen Sakura and her son Prince Gill have died in a suspicious hunting accident. Such shocking tragedy become widespread on the news around the world. Of course, it even couldn't escape from the ears of ArsÃƒÂ¨ne Lupin III and Conan Edogawa either. The death of Queen Sakura and Prince Gill means that her first daughter, Princess Mira, is next to take the throne, but she refuses to do so since she hears the tragic news.\n\nMeanwhile, during Princess Mira's visit in Sakura Saku Hotel in Japan, Conan Edogawa and Ran Mouri get involved in an intriguing incident. Conan Edogawa discovers that someone is after Princess Mira and tries to poison her. Also, when Princess Mira tries to escape from her bodyguard, she runs into Ran Mouri, who so coincidentally resembles her. Mira wants to be free for one day, and Ran wants to become a princess. Therefore, they exchange clothes in order to realize their respective desires. Also, Lupin plans to steal the Queen's Crown in Vespania, which gets the attention of Inspector Koichi Zenigata of Interpol.\n\nDuke Keith of Vespania decides to conceal the news of missing Mira, and taken Ran Mouri back to Vespania as Mira's double. When Conan Edogawa hears about the news, he sneaks aboard Vespania's royal jet plane, and follows Ran Mouri, in order to find out the truth. He soon discovers that the death of Queen Sakura and Prince Gill has been no accident at all.","torrent":{"xt":"urn:btih:4ee187910d9964f7c14153a2c54dd4879c3480e4","amp;dn":"Lupin+III+vs+Detective+Conan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ee187910d9964f7c14153a2c54dd4879c3480e4","infoHashBuffer":{"type":"Buffer","data":[78,225,135,145,13,153,100,247,193,65,83,162,197,77,212,135,156,52,128,228]},"announce":[],"urlList":[]}}