{"title":"Chaos Head +18, English, VN","uid":7556057,"size":1679228525,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:501ca950cdbe04557672c825f455543df24946fa&amp;dn=Chaos+Head+%2B18%2C+English%2C+VN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BZant","files":5,"time":1345612450,"description":"FIRST- I want you to know this is not an H-game. But it does have sever violent content. You were warned.\n\n\nI'd like to say, I only decided to upload this game (visual novel) because the only torrent i could find of this game was a non seeded one. And everyone on it was stuck at 70.3%. Which is disgusting imo. If you make a torrent, or use one, you should seed. So I decided (after tirelessly downloading the rar parts of chaos head) to upload this in a torrent.\n\nIm not going to bother to list any instructions as the torrent comes with a file text. YOU MUST READ THIS. You can not install the game correctly without reading it. Do not worry about any files the text may say you must download, since im nice and all (not really), I decided to include EVERY file needed to install it in english. \n\nWhats included-\nThe game (obviously) \nEnglish patcher\nCrass\nHow to txt\nAnd lastly the crack.\n\n\nOnce again I will iterate, you MUST follow install instructions to the letter. Otherwise you WILL probably get errors when trying to play. \n\nReason why you must replace crass folder-\n\nThe crass is a folder thats used with the english patcher. But the one thats automatically used with the patcher is corrupt. You must replace the folder with the crass folder I listed. It auto generates when the patcher is started. So dont worry that its not in the directory from the start.\n\n\nAnyways Once Again I'd like to say I take no credit for this nice game. Nor the translate. If you'd like to find a tons more awesome vns visit erogedownload(.)com\n\nThis is the site I get the majority of the games that do not have torrents. Lovely site. ","torrent":{"xt":"urn:btih:501ca950cdbe04557672c825f455543df24946fa","amp;dn":"Chaos+Head+%2B18%2C+English%2C+VN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"501ca950cdbe04557672c825f455543df24946fa","infoHashBuffer":{"type":"Buffer","data":[80,28,169,80,205,190,4,85,118,114,200,37,244,85,84,61,242,73,70,250]},"announce":[],"urlList":[]}}