{"title":"Despierto.(Awake).[DvDrip.Spanish.XviD-AC3.5.1].by.SDG","uid":4128467,"size":732483813,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5073f437854b09cc4ea07efaa64ee3a70667f6fd&amp;dn=Despierto.%28Awake%29.%5BDvDrip.Spanish.XviD-AC3.5.1%5D.by.SDG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blisson8","files":1,"time":1207919307,"description":"Reparto: Hayden Christensen, Jessica Alba, Lena Olin, Terrence Howard, Christopher \n         McDonald, Fisher Stevens \n\nDirector: Joby Harold \n\nProductor: Joana Vicente, Jason Kliot, John Penotti, Fisher Stevens \n\nDuracion: 01:24:00\n\nEstreno: viernes 28 marzo 2008 \n\nGenero: Terror, Thriller\n\nPais: EE.UU.\n\nSuenos\n\nClay Beresford es un hombre rico y bueno que quiere ser como su padre querido, muerto hace ya tiempo. Tiene una novia guapa y amorosa. Pretende hacer un negocio con unos japoneses porque de esa manera conseguira miles de trabajos para las honradas familias norteamericanas\n\nPor que nos resulta vomitivo el principio de este cuento de hadas desmelenado? Pues, sencillamente, porque los espectadores no soportamos los cuentos de hadas. El agente Smith se lo dijo a Morfeo oido cuando cuando lo drogaba para conseguir los codigos de Sion: ::La primera Matrix fue disenada para ser un mundo perfecto, donde nadie sufriera, donde todos consiguieran ser felices. Fue un desastre. Nadie acepto ese programa. Se perdieron cosechas enteras de humanos.::\n \nLas madres abnegadas, amores fieles y padres ideales son ficciones que nos hacen despertar de esa Matrix que es la sala de cine. El principio de ::Despierto:: hubiera ganado mucho si todo no hubiera sido tan perfecto. Si el millonario se hubiera encontrado algun piquete de huelga en la puerta del despacho, o si la novia tuviera caries. En fin esas cosas que nos pasan a todos todo los dias y nos hacen recordar que no estamos en un mundo ideal fabricado por maquinas para extraer nuestra energia mientras sonamos.\n\nEl resto de ::Despierto:: funciona bien. Esta lleno de giros inesperados. La han construido de atras alante, como hay que hacer las cosas. De modo que cada detalle intrascendente de la primera mitad es una pista que tiene un sentido cardinal cuando uno hace la segunda lectura. Por lo que leo, parece que no le gusta a nadie. Los espectadores ya nos sabemos todos los giros posibles y no hay quien nos sorprenda. O quiza nos estamos cansando de ir a ver giros y queremos que nos den cine. En cualquier caso, ::Despierto:: no esta tan mal. Vayan a verla y vuelvan quejandose si no estan de acuerdo, asumo responsabilidades.","torrent":{"xt":"urn:btih:5073f437854b09cc4ea07efaa64ee3a70667f6fd","amp;dn":"Despierto.%28Awake%29.%5BDvDrip.Spanish.XviD-AC3.5.1%5D.by.SDG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5073f437854b09cc4ea07efaa64ee3a70667f6fd","infoHashBuffer":{"type":"Buffer","data":[80,115,244,55,133,75,9,204,78,160,126,250,166,78,227,167,6,103,246,253]},"announce":[],"urlList":[]}}