{"title":"Wafa Sultan - A God Who Hates (mobi, epub)","uid":6925528,"size":632334,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5163a3fe998c7103e600075ebea50a695de1d470&amp;dn=Wafa+Sultan+-+A+God+Who+Hates+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Premio","files":2,"time":1325474203,"description":"A God Who Hates: The Courageous Woman Who Inflamed the Muslim World Speaks Out Against the Evils of Islam \n\nOn Feb. 21, 2006, the Syrian-born and raised Wafa Sultan gave one of the most provocative interviews ever given by a Muslim woman on the Al Jazeera network.  In the middle of the interview she told her male Muslim interviewer that it was her turn to speak.  And, she did.  She told him to &quot;shut up.&quot; This simple, yet radical, act of a Muslim woman asserting herself in the face of a Muslim man, catapulted her to fame. Now, for the first time, Wafa Sultan tells her story and airs her provocative views in a book that pulls no punches in looking clearly at Islam and the threat it poses for the rest of the world.  Her viewpoint and opinions were hard won: As an intelligent young girl who would someday become a psychiatrist, she grew up in Syria under the thumb of a culture ruled by a god who hates women and all they represent.  It is from this kernel of female hatred at the heart of Islam that Wafa Sultan builds her case against the mullahs and their followers bent on destroying the West. A God Who Hates is a fiery book that will remind readers why, even at a time when we are reaching out to others, we must be ever-vigilant about the threat Islam poses towards the West.\n\n&quot;Wafa Sultan experienced firsthand the immense contempt of human dignity Islam harbours, and the unimaginable cruelty Muslim women have to endure on a daily basis, resulting from it. Her compelling book is a touching life story filled with bone chilling examples of what it is like to live in a society that is ruled by Islam and how valuable our Western freedom truly is. It is because brave women like Wafa Sultan have the courage to speak out against this doctrine of hate that we in the West have been forewarned. I hope that everyone reads this book and takes note of the important message it contains. We must defend our precious liberties, our Western freedom and never give in to Islam.&quot;-- Geert Wilders, member of the Dutch Parliament and leader of the Party for Freedom\n\nAuthor: Wafa Sultan\nPublisher: St. Martin's Griffin\nPublication Date: Reprint edition (April 26, 2011)\n\nFormats:\n.ePub (compatable with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n.Mobi (compatable with Amazon Kindle, etc.)\n\nFree Calibre eBook reader: http://calibre-ebook.com/download\n","torrent":{"xt":"urn:btih:5163a3fe998c7103e600075ebea50a695de1d470","amp;dn":"Wafa+Sultan+-+A+God+Who+Hates+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5163a3fe998c7103e600075ebea50a695de1d470","infoHashBuffer":{"type":"Buffer","data":[81,99,163,254,153,140,113,3,230,0,7,94,190,165,10,105,93,225,212,112]},"announce":[],"urlList":[]}}