{"title":"[Clips4Sale / Family-Therapy] Tiffany Bannister (Dr. Sisterlove","uid":13675223,"size":675167414,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:51cc6fa0f75961ef00b3f584f00417525f3b67e3&amp;dn=%5BClips4Sale+%2F+Family-Therapy%5D+Tiffany+Bannister+%28Dr.+Sisterlove+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ImgSnaps","files":1,"time":1456392717,"description":"[Clips4Sale / Family-Therapy] Tiffany Bannister (Dr. Sisterlove or How I Learned to Stop Worrying and Love My Brother) 480p [Roleplay]\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/image/kUY\r\n \nhttp://imgsnaps.com/image/kUa\r\n\r\nI. Brother Blackmails Cheating Sister - FUCK!!! I'm tired of fapping to my little sister's dirty panties and spying on her in the shower. SHE FUCKS EVERYBODY ELSE IN THE NEIGHBORHOOD!!! It's my turn, Goddamn it! I don't care if I'm a sick pervert. I've taken care of her for years, I think I've earned the right to a little pussy from her once in awhile... And now I've finally figured out how to get it. I went though my sister's phone and found a bunch of dirty texts and naked pics she sent to some random guy. I'm pretty sure her boyfriend wouldn't be very happy if I forwarded him the texts. My little sister is doing yoga in her room right now. I think I'll stop by and let her know my good news. I'm sure we'll be able to work something out.... II. Psycho Brother Won't Stop - My little Sister hasn't been as compliant as I had hoped for... Once I blackmailed her and fucked her, I was convinced she would fall in love with me rather quickly. It's been over a week and my sister Tiffany barely looks at me when I enter a room, and just walks away when I try to explain my actions or apologize. I know some would consider my methods cruel, possibly insane, but I have a greater purpose in mind... If I could just get my little sister to see that we're perfect for each other... I've chain smoked out on the porch too long thinking about this over and over. I know it's very late, but I think I'll go to Tiffany's room and try one more time to make this work.... III. Sister's Warm Welcome - My Brother has been gone for almost six months. I didn't even say bye to him before he left for college. I hated him so much. Blackmailing and manipulating me into having sex with him, he was such a bastard. He's lucky I never got pregnant. I tried to resist him, but he just kept pushing over and over again. And then I started hating myself because part of me liked it, and didn't want it to stop... A few months after he left I finally started to come to terms with what happened between us, and my feelings about it. And I realized that I missed my brother more than anything. I know it was fucked up that he made me have sex with him in the first place, but I don't care anymore. I want it to happen again. Now I know I love my brother just as much as he loved me. He got home from college a few hours ago for spring break. I think he's watching TV right now. It's about time to go have a little talk with my brother, I have some good news for him.... ***Starring Tiffany Bannister &amp; 2 REAL creampies + 1 facial from her psycho/loving brother***","torrent":{"xt":"urn:btih:51cc6fa0f75961ef00b3f584f00417525f3b67e3","amp;dn":"%5BClips4Sale+%2F+Family-Therapy%5D+Tiffany+Bannister+%28Dr.+Sisterlove+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51cc6fa0f75961ef00b3f584f00417525f3b67e3","infoHashBuffer":{"type":"Buffer","data":[81,204,111,160,247,89,97,239,0,179,245,132,240,4,23,82,95,59,103,227]},"announce":[],"urlList":[]}}