{"title":"Judaism: An Introduction","uid":6656988,"size":3052199,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53144619990eeb28a37dc13588e57aeba7ccb48e&amp;dn=Judaism%3A+An+Introduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1315358541,"description":"The story of Judaism is a story of paradox. It is the story of how a small cluster of desert tribes gave birth to a monotheistic doctrine that profoundly shaped the history of human civilization. It is the story of how that initially obscure desert doctrine came to be codified into the Hebrew Bible, one of the world's greatest works of literature. It is the story of how a small minority came to be viewed by the majority as disproportionately powerful and, following pogrom and Holocaust, were driven to the edge of extinction. And it is the story of how a displaced people, globally dispersed throughout other nations for two-and-a-half millennia, came to forge a modern, secular Israeli state which many Jews believe to have been granted an explicitly divine mandate. Oliver Leaman carefully and creatively explores the nature of these apparent contradictions. He discusses the origins of the Jewish Bible; recounts the history of the Jewish people from the era of Patriarchs and Prophets through the Middle Ages up to the contemporary era; outlines the Jewish liturgical calendar and its major rites and modes of worship; and considers the great variety of Jewish literatures (including modern post-Holocaust writers like Primo Levi and Elie Wiesel), art, food and culture. Further chapters examine such topics as mysticism and kabbalah; modern Hebrew; interfaith relations; and the highly contested question, &quot;Who is a Jew?&quot;.\n \nIB Taurus\n2010","torrent":{"xt":"urn:btih:53144619990eeb28a37dc13588e57aeba7ccb48e","amp;dn":"Judaism%3A+An+Introduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53144619990eeb28a37dc13588e57aeba7ccb48e","infoHashBuffer":{"type":"Buffer","data":[83,20,70,25,153,14,235,40,163,125,193,53,136,229,122,235,167,204,180,142]},"announce":[],"urlList":[]}}