{"title":"Bashar - Accelerating ET Contact","uid":4086236,"size":61642378,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:539fbd308ac0d450d5444deaaa70563c465785ca&amp;dn=Bashar+-+Accelerating+ET+Contact&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hspinc","files":44,"time":1205828227,"description":"4 CD-set: &lt;a href=&quot;\nhttp://www.bashar.org/catalog/recent.html#accelerating_ET_contact&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bashar.org/catalog/recent.html#accelerating_ET_contact&lt;/a&gt;\n\n\n10-29-06 New York, NY\n\nThis New York workshop is powerful and amazing! Bashar takes us to the next step in transforming our limitations and accelerating the process of meeting the ET&amp;#039;s. He explores our journey of remembering and the reasons we incarnated into the Earth experience. As we approach the end of the &quot;Cycle of Forgetting&quot; we have the opportunity to move away from the experience of extreme negative and positive polarity and transform the darkness into light. This is a time of increased awareness of other civilizations, other dimensions and other intelligences. Bashar discusses his perspective of change and how we can more effectively work with the reality we create. He explores working with fears you may have about ET contact. How following your excitement accelerates your potential for ET contact and enhances your ability to inter dimensional communication. He explores powerful tools like the power of paradox and the symbolism of synchronicity to help guide you on your journey. As we approach the end of the &quot;cycle of limitation&quot; The tools and concepts Bashar shares can help you in choosing which parallel Earth you will experience in the future. If you choose ET contact, then applying the techniques and changes that Bashar shares will assist you in being psychologically ready for the experience. Bashar takes us through a wonderful VISUALIZATION EXERCISE you can do on a daily basis. The visualization is designed to alter your consciousness and help develop greater sensitivity to other dimensional frequencies as well as increase your ability to be more conductive of higher energies. Bashar expands on the stages of ET contact and how we can accelerate the process. He shares specific suggestions for preparing for contact. During this session, we are also treated to a surprise communication from another member of Bashar&amp;#039;s civilization!\n\nQ&amp;A: Feeling isolated and finding others that appreciate the importance of accelerating consciousness. Getting in touch with the definitions that are creating the experience you are having of life. What is the effect of computers and technology on our children and how can we help children feel more connected. Improving one&amp;#039;s ability to stay present and focused. Transforming inertia and feeling stuck into action. Bringing one&amp;#039;s ability to channel into fruition. How channeling relates to electricity. Experiencing suffering and not being able to find a way to transform it. The positive side of being in touch with negativity and personal suffering. An in depth discussion of death: the choices we have once we have died, where we go, what we do and what it is like. Why we fear death. How Bashar&amp;#039;s civilization experiences death. Communication with deceased loved ones. How much control do we have over our own death? The concept of being perfect and what Bashar means when he says he is perfect. Understanding the impact our existence creates. Using the feeling of being with Bashar to experience communication with him. and ultimately bring him into our presence. The risk of a nuclear event in New York. How resistance to our natural self can bring about various symptoms. Communication between mother and unborn child. Struggling to resolve the different viewpoints of the heart and the mind and how to transform that struggle. The process of ascension and the perspective that represents. Using your imagination to fully realize your own unique creative expression. What we can learn from being in the &quot;light body state of being&quot;. The art of teleportation. Connecting with your future self and improving your connection with your own source energy. Does Bashar exist in physical reality? The relationship between human and Essasani incarnations. Imposing the time space continuum onto omnipresence. Do the Essassani people play sports? All about spirals, what they symbolize and how we can use them. Will our loved ones be with us if we choose ET contact even if they don&amp;#039;t believe? What is the relationship between the various ET civilizations and do they collaborate? A discussion of Atlantis, how and when it was destroyed and how we are currently effected. The name of the Essassani galaxy. A description of the &quot;Twilight Zone&quot;. A discussion of New York--will New York still be a world capital as our planet evolves and how will it participate in future contact. Balancing and neutralizing the energies of the Orion Gateway. What crystals and and using them to accelerate your vibration. How do I know when I am channeling and when I am just making things up? The symbolism of seeing airplanes in dreams and seeing shapes in clouds. Where is Bashar&amp;#039;s ship? What is the day in the life of a Sassani being like? Do they experience fear and limitation at all? What do they look like? Do they eat? Do they need shelter? Do they have an economy? Do they experience greed? New development in Bashar&amp;#039;s experience of the alien beings the &quot;Thook&quot;. What is the purpose of the Middle East at this time in our evolution of consciousness.\n","torrent":{"xt":"urn:btih:539fbd308ac0d450d5444deaaa70563c465785ca","amp;dn":"Bashar+-+Accelerating+ET+Contact","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"539fbd308ac0d450d5444deaaa70563c465785ca","infoHashBuffer":{"type":"Buffer","data":[83,159,189,48,138,192,212,80,213,68,77,234,170,112,86,60,70,87,133,202]},"announce":[],"urlList":[]}}