{"title":"Coast to Coast AM March 17 2013","uid":8271317,"size":57071776,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:54070b95ce1c67de535b909558d3a1effa5ad408&amp;dn=Coast+to+Coast+AM+March+17+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1363619922,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t03-17-13\nHost: \tGeorge Knapp\nGuests: \tDavid Paulides, Bob Miller\n\nDavid Paulides, a former lawman turned investigative journalist and Bigfoot researcher, joined George Knapp to discuss more missing person cases from national parks and forests that government agencies seem to be less than interested in seriously investigating. At this point, he's looked at some 600-650 disappearances from national parks and open spaces in North America, and found around 34 clusters, which involve three or more people missing in geographical proximity to each other. The cases often involve children, who sometimes disappear along with a dog-- many times if they are found alive, they can't speak or recall what happened to them.\n\nHe recounted the case of &quot;John Doe&quot; which involved a child who disappeared near a creek river in 2010 near Mount Shasta. He was found after five hours, and described being taken into an underground cave by a woman he thought was his grandmother. In the cave were people who like looked robots, and eventually he concluded his 'grandmother' was also one of the robots.\n\nPaulides reported that the cases don't show evidence or disturbances that would be associated with animal attacks or a crime scene, which search and rescue dogs would typically uncover. One of the the new clusters he's found is in the Mount Rainier area, and he detailed a case involving a Yale graduate Eagle Scout who went birdwatching along a trail in 1999, and was never seen again. While the disappearances remain mysterious, Paulides has concluded they involve abductions of some kind. By way of precaution, he noted that while some of the missing persons were armed, and some had locater beacons, none of the people in the cases ever had both.\n\nAt the top of his appearance, he commented on the Bigfoot DNA findings recently presented by Dr. Melba Ketchum-- Paulides was part of the group that brought in samples for Ketchum's study. He believes her conclusions are sound and rigorous, but the doubts raised by many Bigfoot researchers stem from her finding that the creature was human rather than ape-like, which goes against their preconceptions.\nLas Vegas Memoir\n\nFirst hour guest, former Nevada governor Bob Miller talked about his new memoir Son of a Gambling Man, which details his life as the son of a casino owner in the days when the mob ran Las Vegas. His father, who'd been a bookie in Chicago, bought the Riviera Hotel back in 1955. During his stretch as governor, Miller said he helped transition the mob out of Las Vegas-- the city outgrew organized crime, as corporations began buying and building casinos, he explained.\nWebsite(s):\n\n    nabigfootsearch.com\n    canammissing.com\n\nBook(s):\n\n    Missing 411- North America and Beyond\n    Missing 411-Eastern United States\n    Missing 411\n    Son of a Gambling Man\n\n","torrent":{"xt":"urn:btih:54070b95ce1c67de535b909558d3a1effa5ad408","amp;dn":"Coast+to+Coast+AM+March+17+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54070b95ce1c67de535b909558d3a1effa5ad408","infoHashBuffer":{"type":"Buffer","data":[84,7,11,149,206,28,103,222,83,91,144,149,88,211,161,239,250,90,212,8]},"announce":[],"urlList":[]}}