{"title":"Jim White - No Such Place [2001] [EAC/FLAC]","uid":11739357,"size":381091009,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:553130c96f9d592fe1efe1f5e2f4226b3da62641&amp;dn=Jim+White+-+No+Such+Place+%5B2001%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":20,"time":1425709573,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Luaka Bop #LBCD 31\nCountry: USA\nYear: February 13, 2001\nGenre:americana\nFormat:CD\n\n01 - Handcuffed To A Fence In Mississippi \n02 - The Wound That Never Heals \n03 - Corvair \n04 - The Wrong Kind Of Love \n05 - 10 Miles To Go On A 9 Mile Road \n06 - Christmas Day \n07 - Bound To Forget \n08 - God Was Drunk When He Made Me \n09 - King Of The Road \n10 - Ghost-Town Of My Brain \n11 - Hey! You Going My Way??? \n12 - The Love That Never Fails \n13 - Corvair Reprise \n\nJim White's sophomore release on David Byrne's Luaka Bop imprint comes four years after the release of Wrong-Eyed Jesus!, an album that introduced him as a quirky, yet clever master of Southern gothic storytelling and lo-fi folk music. No Such Place is a brilliant follow-up and reveals White at his best. It's a bluesy, atmospheric-laced collection of songs about loners, ghosts, devils, love, and angels. Well skilled at providing listeners with a detailed look into his psyche, White simultaneously, and almost undetectably, provokes introspection throughout the album's 13 tracks. His songwriting is best exhibited when the album flows between gentle, dark, and spacy tunes like &quot;Corvair&quot; and &quot;The Wrong Kind of Love,&quot; to all-out stompers like &quot;10 Miles to Go on a 9 Mile Road,&quot; &quot;Handcuffed to a Fence in Mississippi,&quot; and his unique cover of Roger Miller's &quot;King of the Road.&quot; No Such Place is a classic storytelling affair. Continuing to draw from a lifetime's worth of experiences, including stints as a religious fanatic, drug addict, taxi driver, fashion model, and professional surfer, White generously offers up a collage of deeply personal thoughts and feelings. Although comparable to Beck's Mutations and Shawn Mullins' Beneath the Velvet Sun, No Such Place breaks new ground by pairing White's unique lyrical twists and vocal stylings with the slick production of Morcheeba, Sweetback co-founder and Sade musician Andrew Hale, DJ/producer Q-Burns Abstract Message, and Sohichiro Suzuki (formerly of Yellow Magic Orchestra and currently with World Standard). The result is a cohesive effort that's bold, bizarre, and beautiful. His tales, often witty and dipped in irony, stream underneath samples of crickets, howls, sirens, whistles, and an ample filling of ambient clings and clangs. White is a master of exposing his world, while singing the majority of his songs under the guise of a third-person narrator. Combining banjos, harmonicas, and jaw harps with thick lo-fi beats, record scratches, and samples, No Such Place is an exciting and fresh collection of music. Add to the mix White's tongue-in-cheek storyteller talents and the result is a strong album that proves that he's closer to finding peace with his past and optimistic about the journey ahead","torrent":{"xt":"urn:btih:553130c96f9d592fe1efe1f5e2f4226b3da62641","amp;dn":"Jim+White+-+No+Such+Place+%5B2001%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"553130c96f9d592fe1efe1f5e2f4226b3da62641","infoHashBuffer":{"type":"Buffer","data":[85,49,48,201,111,157,89,47,225,239,225,245,226,244,34,107,61,166,38,65]},"announce":[],"urlList":[]}}