{"title":"Big Fish - Daniel Wallace","uid":11094995,"size":4939507,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5580e8077e5ec53c66a34219b5e1dfa364d24104&amp;dn=Big+Fish+-+Daniel+Wallace&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1411579098,"description":"When his attempts to get to know his dying father fail, William Bloom makes up stories that recreate his father's life in heroic proportions.\n\nReview\n\nIn Big Fish, Daniel Wallace angles in search of a father and hooks instead a fictional debut as winning as any this year. From his son's standpoint, Edward Bloom leaves much to be desired. He was never around when William was growing up; he eludes serious questions with a string of tall tales and jokes. This is subject matter as old as the hills, but Wallace's take is nothing if not original. Desperate to know his father before he dies, William recreates his father's life as the stuff of legend itself. In chapters titled &quot;In Which He Speaks to Animals,&quot; &quot;How He Tamed the Giant,&quot; &quot;His Immortality,&quot; and the like, Edward Bloom walks miles through a blizzard, charms the socks off a giant, even runs so fast that &quot;he could arrive in a place before setting out to get there.&quot; In between these heroic episodes, Bloom dies not once but four times, working subtle variations on a single scene in which he counters his son's questions with stories--some of which are actually very witty, indeed. After all, he admits, &quot;...if I shared my doubts with you, about God and love and life and death, that's all you'd have: a bunch of doubts. But now, see, you've got all these great jokes.&quot; The structure is a clever conceit, and the end product is both funny and wise. At the heart of both legends and death scenes live the same age-old questions: Who are you? What matters to you? Was I a good father? Was I a good son? In mapping the territory where myth meets everyday life, Wallace plunges straight through to fatherhood's archaic and mysterious heart. --Mary Park\n\nFrom Publishers Weekly\n\n&quot;People mess things up, forget and remember all the wrong things. What's left is fiction,&quot; writes Wallace in his refreshing, original debut, which ignores the conventional retelling of the events and minutiae of a life and gets right to the poetry of a son's feelings for and memories of his father. William Bloom's father, Edward, is dying. He dies in fact in four different takes, all of which have William and his mother waiting outside a bedroom door as the family doctor tells them it's time to say their goodbyes. He intersperses the four takes with stories (all filtered through William's mind and voice) about the elusive Edward, who spent long periods of time on the road away from home and admitted once to his son that he had yearned to be a great man. The father and son deathbed conversations have son William playing earnest straight man, while his father is full of witticisms and jokes. In a plainspoken style dotted with transcendent passages, Wallace mixes the mundane and the mythical. His chapters have the transformative quality of fable and fairy tale, and the novel's roomy structure allows the mystery and lyricism of the story to coalesce. Agent, Joe Regal; author tour. (Oct.) FYI: Wallace is an illustrator who designs T-shirts, refrigerator magnets and greeting cards.\nCopyright 1998 Reed Business Information, Inc.","torrent":{"xt":"urn:btih:5580e8077e5ec53c66a34219b5e1dfa364d24104","amp;dn":"Big+Fish+-+Daniel+Wallace","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5580e8077e5ec53c66a34219b5e1dfa364d24104","infoHashBuffer":{"type":"Buffer","data":[85,128,232,7,126,94,197,60,102,163,66,25,181,225,223,163,100,210,65,4]},"announce":[],"urlList":[]}}