{"title":"Tyler Ramsey - The Valley Wind [2011] [EAC/FLAC]","uid":11704787,"size":215094670,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:558a58bdcf50b38b2fa3b624529fc26f07142167&amp;dn=Tyler+Ramsey+-+The+Valley+Wind+%5B2011%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":13,"time":1424080040,"description":" FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Fat Possum #12522\nCountry: USA\nYear: September 27, 2011\nGenre: americana\nFormat: CD\n\n1. Raven Shadow\n2. The Valley Wind\n3. 1000 Blackbirds\n4. The Nightbird\n5. Stay Gone\n6. The Time Is A Changing Line\n7. Angel Band\n8. When It's Done\n9. All Night\n\nI've always found that the best solo projects are not the ones that adhere to the artist's main gig nor the one's that veer completely away (I'm looking at you Julian Casalbancas). No the most successful ones to my ears are usually the ones that take the main band's sound and take it in directions that are slightly different or more adventurous.\n\nThat's certainly what we get with The Valley Wind the forthcoming album from Band Of Horses guitarist Tyler Ramsey. The record, Ramsey's third, comes out on September 27th.\n\nWhat Ramsey does is take the indie roots rock of Band Of Horses and simplify it. He strips out many of the harmonies and arena rock guitar elements and distills his songs down to a minimalist, yet highly refined melodic folk rock.\n\nIn fact, at times Ramsey sounds more like Neil Young than Band Of Horses (his vocals are much more akin to Young's than they are to Ben Bridwell's). There's an undeniable Neil Young folk sound and structure to a song like &quot;The Valley Wind&quot;, while &quot;When It's Done&quot; edges ever so slightly towards the Young folk/rock threshold.\n\nLyrically, similarities between Ramsey and Young can be found as well. Ramsey's songs are full of imagery of the natural world, in both it's beautiful and violent forms. Those images and the sentiment of weariness and reaching the end of one's rope make &quot;The Nightbird&quot; one of 2011's best written laments.\n\nYou can definitely still here elements of Band Of Horses on the album. However, only on the more rounded &quot;1000 Blackbirds&quot; does he ever venture close to the band's sonic territory.\n\nIn all The Valley Wind is both an outstanding record and a blueprint for how artists should approach their solo work.\n\nBest tracks: &quot;The Nightbird&quot;, &quot;When It's Done&quot;","torrent":{"xt":"urn:btih:558a58bdcf50b38b2fa3b624529fc26f07142167","amp;dn":"Tyler+Ramsey+-+The+Valley+Wind+%5B2011%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"558a58bdcf50b38b2fa3b624529fc26f07142167","infoHashBuffer":{"type":"Buffer","data":[85,138,88,189,207,80,179,139,47,163,182,36,82,159,194,111,7,20,33,103]},"announce":[],"urlList":[]}}