{"title":"woman in a dressing-gown (1957).mpg","uid":5146586,"size":835807948,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5592d0005dcccc8b6a2290755acf01bee121946f&amp;dn=woman+in+a+dressing-gown+%281957%29.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ruthd7274","files":1,"time":1257292076,"description":"File type: \nVideo: mpeg1 \nAudio: mp3 \n\nWoman in a Dressing Gown (1957) \n\n35mm, 92 min, black &amp; white \n\nDirector: J. Lee Thompson \nProduction Company: Godwin-Willis \nProductions Corporation: Associated British Picture \nProducers: Frank Godwin; J. Lee Thompson \nScreenplay: Ted Willis \nCinematography: Gilbert Taylor \n\nCast: \n\nYvonne Mitchell... Amy \nAnthony Quayle... Jim \nSylvia Syms... Georgie \nAndrew Ray... Brian \nCarole Lesley... Hilda \n\nDevoted housewife Amy is distraught when her husband, Jim, announces he is leaving her for another woman. \nWoman in a Dressing Gown has been described by film historian Jeffrey Richards as &quot;a Brief Encounter of the council flats&quot;, taking the scenario of an extra-marital relationship and relocating to a less middle-class setting. However, writer Ted Willis described it more simply, as a film about &quot;good honest fumbling people caught up in tiny tragedies&quot;. \n\nAs its female-focused title suggests, the film spends a lot of time on Amy, the wife whose husband wants to leave her, and Yvonne Mitchell's bravura performance in the role was awarded with the Berlin Film Festival's Silver Bear for best actress. Amy is anything but the model '50s housewife: she burns food, never finishes the housework, always has the radio on too loud, and rarely finds the time to get dressed properly. But the film allows us to see some of the reasons why she might have become that way (grief, loneliness, boredom), rather than simply demonising her, and as such it might be considered as an inchoate expression of some of the problems with the housewife role to which feminists would return in subsequent decades. Nonetheless, the film is not unfairly biased towards the abandoned wife: it gives time and space to the dilemmas faced by husband Jim (Anthony Quayle) and 'other woman' Georgie (Sylvia Syms) as they struggle with their feelings for each other and their guilt about the hurt they are inflicting on others. \n\nWoman in a Dressing Gown is an important reminder that postwar British realism did not begin with the New Wave, and that the 1950s were not devoid of socially engaged cinema, as is sometimes suggested. Indeed, in the field of gender politics, one could argue that this film is considerably more progressive than the New Wave that superseded it, in its focus on the travails of a middle-aged housewife rather than those of a virile young man. As Sylvia Syms put it: &quot;There are certain films of that period that have gained enormous fame, the obvious one is Saturday Night and Sunday Morning. It was a wonderful film, full of brilliant performances, but it's about a man, and men have always been more important than women. Yvonne Mitchell did not go on to become a big international star as Albert Finney did, but Woman in a Dressing Gown precedes it by some time.&quot; \n","torrent":{"xt":"urn:btih:5592d0005dcccc8b6a2290755acf01bee121946f","amp;dn":"woman+in+a+dressing-gown+%281957%29.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5592d0005dcccc8b6a2290755acf01bee121946f","infoHashBuffer":{"type":"Buffer","data":[85,146,208,0,93,204,204,139,106,34,144,117,90,207,1,190,225,33,148,111]},"announce":[],"urlList":[]}}