{"title":"Andrew Hill - 2005 - Mosaic Select 16 (67-70) FLAC","uid":8862425,"size":1219510557,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:570c7b264a5de867db79b101da2c0b3124d7e408&amp;dn=Andrew+Hill+-+2005+-+Mosaic+Select+16+%2867-70%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1377810263,"description":"Andrew Hill - 2005 - Mosaic Select 16 (67-70)\n\nOf all the volumes in the Mosaic Select series, this one, and the Big John Patton box, are the most satisfying, though for very different reasons. This one is a true collector's gem. For starters, all but six of the 31 cuts on this three-CD box are previously unreleased. For Hill fans who knew there was more in the can, this is a most welcoming find. The material here was completely composed by Hill and was recorded in five sessions between 1967 and 1970. The pianist and composer is found in three different settings, from trio to sextet and septet with some octet sides. The personnel here varies, too. The sextet sessions feature Hill with Bennie Maupin, Pat Patrick, Charles Tolliver, Ron Carter, and either Paul Motian or Ben Riley on drums. These are the earliest cuts here and they are solid as solid can be. They are tight compositions that come out of both modal and hard bop and push the envelope with fine improvising from each player. They move, jump, and in their own way, swing. There are at least two sessions here with string quartets and different personnel. Some contain Carlos Garnett with Freddie Watts and Richard Davis, while others feature Maupin, Carter, and Mickey Roker. The music here is dark, swirling, and edgily dissonant while never departing form the authoritative use of the tradition that has been Hill's trademark since Black Fire. Again, elements of swing are ever present as are the blues -- check &quot;Monkash,&quot; or &quot;Soul Mate&quot; for examples of each band -- split at the end of disc one and the beginning of disc two. The classical vibe added by the string quartet is one that is far from overbearing, but plays a great anchor role during the other group improvisation.\nOther sessions here, like the trio sides with Carter and Teddy Robinson, are fluid, streamlined and extremely direct while still lyrical. The septet music contains two versions of &quot;Oriba,&quot; and the personnel here includes Sam Rivers, Woody Shaw, Robin Kenyatta, and Howard Johnson for a stellar horn section with the rhythm section of Herbie Lewis and drummer Teddy Robinson. The final band, where the horn section shrinks to just Rivers and Kenyatta, is subsequently expanded in the bottom end with bassist Cecil McBee and Spaulding Givens on percussion. These five cuts with their fiery rhythmic drive end the proceedings on a decidedly different note than where they began, but some elements remain: Hill's sense of melody and harmonic extrapolation are ever expansive without losing their center of gravity, the rhythms are always circular, and the sound of the tradition is never far away. The track to listen for here is &quot;Yomo.&quot; This is a fine set to complement the previous Mosaic Blue Note set of unreleased material, and rounds out and extends the seemingly ever more expansive portrait of Hill as a composer, a pianist, and a bandleader. (AllMusic)\n\nTrack list:\nCD 1\n01 - Without Malice\n02 - Ocho Rios\n03 - Diddy Wah\n04 - Ode To Infinity\n05 - The Dance\n06 - Satin Lady\n07 - Ocho Rios 2nd version\n08 - Monkash\n09 - Mahogany\nCD 2\n01 - Illusion\n02 - Poinsettia\n03 - Fragments\n04 - Soul Mate\n05 - Illusion (Alt take)\n06 - Interfusion\n07 - Resolution\n08 - Chained\n09 - MOMA\n10 - Nine At The Bottom\n11 - Six At The Top\n12 - Nine At The Bottom (Alt take)\nCD 3\n01 - For Blue People Only\n02 - Enamorado\n03 - Mother's Tale\n04 - Oriba (First Version)\n05 - Oriba (2nd version)\n06 - Awake\n07 - Now\n08 - I\n09 - Yomo\n10 - Prevue\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:570c7b264a5de867db79b101da2c0b3124d7e408","amp;dn":"Andrew+Hill+-+2005+-+Mosaic+Select+16+%2867-70%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"570c7b264a5de867db79b101da2c0b3124d7e408","infoHashBuffer":{"type":"Buffer","data":[87,12,123,38,74,93,232,103,219,121,177,1,218,44,11,49,36,215,228,8]},"announce":[],"urlList":[]}}