{"title":"The Outfield - Since You've Been Gone  (2nafish)","uid":5271257,"size":152748036,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:57fabb763be1a9bf5b0f7b71a8c88577fece252e&amp;dn=The+Outfield+-+Since+You%5C%27ve+Been+Gone++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1263170816,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThe Outfield are a British pop rock/power pop band based in London. They began recording during the mid-1980s, and released their first album, Play Deep in 1985. The album went triple platinum in America. The Outfield are unusual for a British band in that they enjoyed commercial success in the US, but never reached the album or singles charts in their homeland. They continued to record into the early 1990s, before a hiatus during the middle of that decade. They resumed touring in 1998, and thereafter released two live albums via their web site. The band's latest album, Any Time Now, was released by Sidewinder Records in March, 2006. In mid 2009, The Outfield entered a London studio to begin recording their 7th studio album.\n\nFormed in London's East End under the name The Baseball Boys, bassist/singer Tony Lewis, guitarist/keyboardist and songwriter John Spinks, and drummer Alan Jackman performed in and around London until a demo got them signed to Columbia/CBS Records in 1984.\n\nTheir debut album, Play Deep, produced by William Wittman, was issued in 1985, and was a success. The album would go on to reach triple platinum sales status and the Top 10 in the US album charts; it also featured a Top 10 single entry with &quot;Your Love&quot;, which peaked at #6. The band toured extensively, opening for Journey and Starship.\n\n1986 saw the release of their second album, Bangin'. This album did not achieve the acclaim of Play Deep, but it did spawn two minor hit singles, &quot;Since You've Been Gone&quot; (not to be confused with the 1970s Rainbow and Head East hit of the same name) and &quot;No Surrender&quot;, and the album was certified Gold in the U.S.. A US summer tour opening for Night Ranger followed.\n\nFor the group's third album, 1989's Voices of Babylon, a new producer (David Kahne) and sound was evident. The title track and &quot;My Paradise&quot; were mid-sized album-rock hits, but overall the group's popularity continued to decline.\n\nAfter the Babylon LP, Alan Jackman parted ways with the band and was replaced for a concert tour by Paul Reed.\n\nBangin' is an album by British band The Outfield, which yielded one Top 40 hit, &quot;Since You've Been Gone&quot; (not to be confused with identically-titled songs that were hits for both Rainbow and Head East in the 1970s, and Kelly Clarkson in the 2000s.)\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:57fabb763be1a9bf5b0f7b71a8c88577fece252e","amp;dn":"The+Outfield+-+Since+You%5C%27ve+Been+Gone++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57fabb763be1a9bf5b0f7b71a8c88577fece252e","infoHashBuffer":{"type":"Buffer","data":[87,250,187,118,59,225,169,191,91,15,123,113,168,200,133,119,254,206,37,46]},"announce":[],"urlList":[]}}