{"title":"Nine Inch Nails - 1990 - Head Like a Hole","uid":3467734,"size":54577068,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:58f50c2e7c427bf2bc637af3861c8573f294920e&amp;dn=Nine+Inch+Nails+-+1990+-+Head+Like+a+Hole&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KindTorrents","files":11,"time":1144408551,"description":"[b]Cover:[/b]\n\n[img]http://images.amazon.com/images/P/B000000GQ2.01.LZZZZZZ\n\nZ.jpg[/img]\n\n[b]Artist:[/b]\n\nNine Inch Nails\n\n[img]http://image.allmusic.com/00/amg/pic200/drp200/p238/p23\n\n8086wslv.jpg[/img]\n\n[b]Album:[/b]\n\nHead Like A Hole\n\n[b]Bio:[/b]\n\nNine Inch Nails was the most popular industrial group ever \n\nand was largely responsible for bringing the music to a mass \n\naudience. It isn&amp;#039;t really accurate to call NIN a group; the \n\nonly official member is \n\nsinger/producer/multi-instrumentalist Trent Reznor, who \n\nalways remained solely responsible for NIN&amp;#039;s musical \n\ndirection (he was, however, supported in concert by a \n\nregular backing band). Unlike the vast majority of \n\nindustrial artists, Reznor wrote melodic, traditionally \n\nstructured songs where lyrics were a focal point. His pop \n\ninstincts not only made the harsh electronic beats of \n\nindustrial music easier to digest, but also put a human face \n\non a style that usually tried to sound as mechanical as \n\npossible. While Ministry crossed over to heavy metal \n\naudiences, NIN built up a large alternative rock fan base \n\nright around the time of Nirvana&amp;#039;s mainstream breakthrough. \n\nAs a result, Reznor became a genuine star and his \n\nnotoriously dark, brooding persona and provocateur instincts \n\nmade him a Jim Morrison-esque sex symbol for the &amp;#039;90s. A \n\nlong period of inactivity and writer&amp;#039;s block followed, which \n\ngave virtually every alternative metal band of the late &amp;#039;90s \n\na chance to rip off elements of NIN&amp;#039;s sound. By the time \n\nReznor&amp;#039;s five-year hiatus finally ended, he was still a \n\npopular figure but his commercial momentum had slowed \n\nsomewhat.\n\nMichael Trent Reznor was born May 17, 1965, in the small \n\ntown of Mercer, PA; he went by his middle name to avoid \n\nconfusion with his father Michael. At age five, Reznor&amp;#039;s \n\nparents divorced and he wound up being raised mostly by his \n\nmaternal grandparents; even so, Reznor stated repeatedly \n\nthat his childhood was mostly happy. He began playing the \n\npiano at age five, studying classical music, and later \n\nlearned tenor sax and tuba in the school band; he also acted \n\nin musicals and became an avid Kiss fan. Reznor spent a year \n\nstudying music and computers at Allegheny College, but \n\ndropped out after a year to pursue music full-time; he soon \n\npacked up and moved to Cleveland with high school friend \n\nChris Vrenna. Around the same time, he was discovering new \n\nwave and assorted underground music; he was most fascinated \n\nwith early industrial, since it offered an edgy, aggressive \n\nway to use electronic instruments. At age 19, he \n\nsuccessfully auditioned to join an AOR band called the \n\nInnocent, which released one album, Livin&amp;#039; in the Streets \n\n(Reznor&amp;#039;s picture does appear on the jacket). He quit the \n\nInnocent after just three months and subsequently gigged \n\nwith local bands; he also worked in a keyboard store and as \n\na janitor in the local Right Track recording studio. \n\nEventually, he became a studio engineer, teaching himself \n\nvarious computer applications and working on his own \n\nmaterial during off hours. In 1987, Reznor appeared in the \n\nMichael J. Fox/Joan Jett film Light of Day, where he played \n\nkeyboards with a trio dubbed the Problems during a bar \n\nscene.\n\nAs Nine Inch Nails, Reznor began recording his own Ministry \n\nand Skinny Puppy-influenced compositions in 1988, playing \n\nall the instruments himself. At first, he simply hoped to \n\nrelease a 12&quot; single on a small European label, but when he \n\nsent demo tapes to around ten American labels, nearly every \n\none offered him a deal. He wound up signing with TVT, which \n\nreleased NIN&amp;#039;s debut album, Pretty Hate Machine, in 1989 \n\n(after having rejected an initial effort called Industrial \n\nNation). Reznor quickly assembled a backing band and toured \n\nwith Skinny Puppy for a short time, but soon tired of \n\nplaying for strictly industrial artists. With a tighter \n\noutfit featuring Chris Vrenna on drums and Richard Patrick \n\non guitar (plus several revolving-door keyboardists), he \n\nconsciously chose to open for alt-rock acts (including, \n\nearly on, the Jesus &amp; Mary Chain and Peter Murphy), partly \n\nfor the challenge of winning over fans who might not have \n\nliked industrial music. The strategy helped expand Nine Inch \n\nNails&amp;#039; fan base substantially; the single &quot;Down in It&quot; got \n\nsome airplay in dance clubs, reaching Billboard&amp;#039;s dance and \n\nmodern rock charts, and MTV later picked up on the video for \n\nthe more rock-oriented &quot;Head Like a Hole.&quot; In 1991, after \n\nsettling on keyboardist James Woolley, Nine Inch Nails \n\nbecame part of the inaugural Lollapalooza tour, which \n\nexpanded their fan base by leaps and bounds. Pretty Hate \n\nMachine&amp;#039;s momentum kept building slowly and although it \n\nnever climbed higher than number 75, it spent over two years \n\non the album charts and eventually sold over a million \n\ncopies -- one of the first indie-label rock albums to do so.\n\nTVT had a massive hit on their hands and to ensure that \n\nReznor would produce another one, they attempted to take \n\ncontrol of the follow-up&amp;#039;s creative direction. Enraged by \n\nthe outside meddling, Reznor tried to secure a release from \n\nhis contract, leading to a vicious court battle. His only \n\nrecording outlets were side projects; in 1990, he co-wrote \n\nand sang on &quot;Suck,&quot; a track on Pigface&amp;#039;s debut album, Gub, \n\nand also sang on the Al Jourgensen-led 1000 Homo DJs cover \n\nof Black Sabbath&amp;#039;s &quot;Supernaut.&quot; (TVT ordered Reznor&amp;#039;s vocals \n\nremoved from the track, but Jourgensen actually just altered \n\nthem slightly and said he&amp;#039;d re-recorded it.) Eventually, he \n\nwas able to sign with Interscope, which helped him set up \n\nhis own label, the Cleveland-based Nothing imprint. Reznor \n\nhad been recording new material on the sly and in 1992, \n\nNothing released the EP Broken, as well as a concurrent \n\nremix disc titled Fixed. Broken featured more (and heavier) \n\nguitars than Pretty Hate Machine, partly in response to \n\nNIN&amp;#039;s live sound and partly as a sonic evocation of Reznor&amp;#039;s \n\nboiling frustration in the wake of the legal wars; it also \n\nfeatured two bonus cuts, a version of &quot;Suck&quot; and the Adam \n\nAnt cover &quot;(You&amp;#039;re So) Physical,&quot; a nod to Reznor&amp;#039;s new wave \n\nroots. Despite many reviews characterizing the EP as a \n\nharrowing, difficult listen, Broken -- supported by NIN&amp;#039;s \n\nnow-considerable fan base -- debuted in the Top Ten and the \n\nfirst single/video, &quot;Wish,&quot; won a Grammy for Best Heavy \n\nMetal Performance. Reznor enhanced his reputation as a \n\nprovocateur with a widely banned clip for &quot;Happiness in \n\nSlavery,&quot; which depicted S&amp;M performance artist Bob Flanagan \n\nbeing torn apart by a machine; there was also a long-form \n\nclip for Broken that was never released commercially due to \n\nits graphic content (a torture victim is dismembered while \n\nviewing NIN videos).\n\nReznor moved to Los Angeles to craft the second full-length \n\nNIN album, assembling a studio in the house where actress \n\nSharon Tate was murdered by Charles Manson&amp;#039;s associates. The \n\nDownward Spiral was a highly ambitious work, a concept album \n\nindebted to progressive rock that featured the most \n\ndetailed, layered studiocraft of any NIN album yet. Hugely \n\nanticipated, the album debuted at number two and became one \n\nof the bleakest multi-platinum albums ever. Richard Patrick \n\nhad departed the touring band to form Filter and Reznor \n\nrevamped the group with drummer Vrenna, keyboardist Woolley, \n\nguitarist Robin Finck, and bassist Danny Lohner. NIN caused \n\na sensation at that summer&amp;#039;s 25th-anniversary Woodstock \n\nconcert, performing a ferocious set after horsing around and \n\ncovering themselves in mud just before hitting the stage. \n\nMeanwhile, MTV had put an edited version of the video for \n\n&quot;Closer&quot; in heavy rotation and NIN scored one of the year&amp;#039;s \n\nunlikeliest hits: a song whose chorus began &quot;I want to f*ck \n\nyou like an animal,&quot; which helped make Reznor one of \n\nalternative rock&amp;#039;s biggest sex symbols. The subdued ballad \n\n&quot;Hurt&quot; gained some further airplay, even though it lacked \n\nthe titillating shock value of &quot;Closer.&quot; Later in the year, \n\nReznor assembled the soundtrack of Oliver Stone&amp;#039;s \n\ncontroversial Natural Born Killers, editing the songs \n\ntogether to create an innovative collage; he also guested on \n\n&quot;Past the Mission,&quot; a track on Tori Amos&amp;#039; second album Under \n\nthe Pink. In 1995, with new keyboardist Charlie Clouser, \n\nNine Inch Nails hit the road with David Bowie, whose \n\nlate-&amp;#039;70s albums (along with Pink Floyd) had been a major \n\ninfluence on The Downward Spiral. He also contributed a \n\ncover of Joy Division&amp;#039;s &quot;Dead Souls&quot; to the soundtrack of \n\nThe Crow and issued the remix album Further Down the Spiral, \n\nwhich nearly reached the Top 20 (a testament to his \n\npopularity).\n\nUsing money from The Downward Spiral, Reznor built a \n\nstate-of-the-art studio in New Orleans in a building that \n\nhad once been a funeral home. While pondering his next move \n\nin the wake of his sudden stardom, he produced Nothing \n\nsignee Marilyn Manson&amp;#039;s second album, Antichrist Superstar, \n\nwhich did indeed make him a superstar. In 1997, longtime \n\nfriend Vrenna had a falling out with Reznor and eventually \n\nwas replaced by Jerome Dillon; Reznor&amp;#039;s maternal grandmother \n\nalso passed away that year and his friendship with Manson \n\nsoon deteriorated. Even so, he produced another movie \n\nsoundtrack for David Lynch&amp;#039;s Lost Highway, and contributed \n\nthe new single &quot;The Perfect Drug,&quot; which flitted \n\nunpredictably between several different rhythm tracks. \n\nThough &quot;The Perfect Drug&quot; kept him in the public eye for a \n\ntime, Reznor was still unsure what kind of statement would \n\nbe an appropriate follow-up to The Downward Spiral; that \n\nuncertainty resulted in a severe case of writer&amp;#039;s block. In \n\nthe meantime, NIN was proving vastly influential on a new \n\ncrop of bands; major labels signed up industrial metal \n\noutfits like Filter and Stabbing Westward, and an assortment \n\nof alternative metal bands started grafting industrial \n\nproduction flourishes onto their music; Guns N&amp;#039; Roses lead \n\nsinger Axl Rose even fired the rest of his band and holed up \n\nin a studio to pursue a more NIN-influenced direction.\n\nNine Inch Nails finally returned in 1999 with the double-CD \n\nopus The Fragile. It debuted at number one, with massive \n\nfirst-week sales, but slipped down the charts rather quickly \n\nafterwards, perhaps because the musical climate had changed \n\na great deal over the past five years. The remix album \n\nThings Falling Apart followed a year later, as did an \n\nextensive world tour. An album of live performances culled \n\nfrom the tour, And All That Could Have Been, was released in \n\nearly 2002. Reznor was largely quiet during the next three \n\nyears, until re-emerging in 2005 with another chart-topper, \n\nWith Teeth. Touring continued into 2006, where NIN spent the \n\nspring and summer on the road with various support acts \n\nincluding Saul Williams, Bauhaus, TV on the Radio, and \n\nPeaches. The EP, Every Day is Exactly the Same, appeared in \n\nApril 2006; it contained the title track and five various \n\nremixes (all originally from With Teeth).   \n\n[b]Tracks:[/b]\n\n   1.  Head Like A Hole (Slate)\n   2. Head Like a Hole (Clay)\n   3. Terrible Lie (Sympathetic Mix)\n   4. Head Like A Hole (Copper)\n   5. You Know Who You Are\n   6. Head Lika A Ho","torrent":{"xt":"urn:btih:58f50c2e7c427bf2bc637af3861c8573f294920e","amp;dn":"Nine+Inch+Nails+-+1990+-+Head+Like+a+Hole","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58f50c2e7c427bf2bc637af3861c8573f294920e","infoHashBuffer":{"type":"Buffer","data":[88,245,12,46,124,66,123,242,188,99,122,243,134,28,133,115,242,148,146,14]},"announce":[],"urlList":[]}}