{"title":"Dionne Warwick - Soulful (1969) (Rhino Handmade)","uid":9434323,"size":487574527,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:592ea2fff78373540b5db2e7f129ee5d4ccd19b5&amp;dn=Dionne+Warwick+-+Soulful+%281969%29+%28Rhino+Handmade%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Coltbear50","files":-1,"time":1388868567,"description":"this is a proper eac rip with artwork cue and log\n\nIn the late '60s, it was briefly in vogue for woman singers known more for pop than for soul to go to Memphis, Miami, or Muscle Shoals to record and get funky. Dusty Springfield, Petula Clark, Lulu, and Cher all did this, and so did Dionne Warwick, with 1969's Soulful. And although it was actually a big commercial success, reaching number 11 on the pop charts and number two on the R&amp;B listings, it's not too well remembered. Rhino Handmade's expanded edition of Soulful virtually makes it over into a whole new release, more than doubling its length by adding a dozen tracks in a similar mold from the late '60s and early '70s that appeared on the 1972 double-LP compilation From Within, along with a previously unreleased cover of &quot;Put a Little Love in Your Heart.&quot; Those who think of Warwick as a lightweight pop-soulster with a far greater bent for soft Bacharach-David pop than soul might be surprised at how well she handles purer soul material, both on the Soulful LP and the bonus tracks. But although she sounds good and the backing (Soulful was recorded at American Sound Studios in Memphis) is strong, all of the material is comprised of covers of well-known soul and rock hits. The interpretations range from the Beatles (the deliberately dragged-out renditions of &quot;We Can Work It Out&quot; and &quot;A Hard Day's Night&quot; are not among the highlights), Aretha Franklin, and Motown to Sly &amp; the Family Stone and &quot;You've Lost That Lovin' Feeling&quot; (the last of which did give Warwick a big hit). She does this stuff well, but she was neither the first nor the best to cover such songs, which makes it less stylistically distinctive than her more renowned covers of Bacharach-David songs. Still, no serious Warwick fan should be without this record, as it shows a different side of her talents than is evident from most of the recordings from her prime. [This CD is only available for purchase over the Internet, from www.rhinohandmade.com.] ","torrent":{"xt":"urn:btih:592ea2fff78373540b5db2e7f129ee5d4ccd19b5","amp;dn":"Dionne+Warwick+-+Soulful+%281969%29+%28Rhino+Handmade%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"592ea2fff78373540b5db2e7f129ee5d4ccd19b5","infoHashBuffer":{"type":"Buffer","data":[89,46,162,255,247,131,115,84,11,93,178,231,241,41,238,93,76,205,25,181]},"announce":[],"urlList":[]}}