{"title":"Livingston-Spiritual Communism(British Israel)(1980)","uid":4650451,"size":166518,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a4efe643e73b3b8e81d0fc328e0e3554151ed53&amp;dn=Livingston-Spiritual+Communism%28British+Israel%29%281980%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1232030467,"description":"This is Bob Livingston's amazing booklet Spiritual Communism (1980) which exposes British-Israelism as part of a greater Anglophobic plot to subvert Christianity. The Israel or Identity Message can be recognized easily as anytime one hears a Bible interpretation which says Jesus Christ is going to return to establish His earthly kingdom and that this world government will be administered through the Jews and/or Anglo Saxons, he is hearing Communism. In fact this is Spiritual Communism because Christianity is being used to promote world government. Any sort of idea that Christ is to have a political or material government on earth in the future is Communism disguised as Christianity. British-Israelism teaches that the Biblical tribe of Ephriam settled in what is today the United Kingdom and some followers then believe that they are God's true chosen people. Some further believe that British global conquest is not merely a case of Social Darwinism but a Divine Right. The author asserts that the British-Israel plot is operated by &quot;The City&quot;, the notorious London banking section. Critics of anglophobic theories often charge that the derision of the British is only a cover for antisemitism. This is mostly due to classical stereotypes involving money conspiracies and also the terminology surrounding any kind of nationalism. Livingston on the other hand accuses British-Israelism of being a form of ethnic Zionism. As he claims, there is an international conspiracy and it's origin is not political, economic or military but rather spiritual. Spiritual Communism criticizes several distinct trends in Christianity and draws them into a large conspiracy plot that is using all sorts of &quot;end of the world&quot; scenarios to manipulate millions of people all around the world. 45 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:5a4efe643e73b3b8e81d0fc328e0e3554151ed53","amp;dn":"Livingston-Spiritual+Communism%28British+Israel%29%281980%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a4efe643e73b3b8e81d0fc328e0e3554151ed53","infoHashBuffer":{"type":"Buffer","data":[90,78,254,100,62,115,179,184,232,29,15,195,40,224,227,85,65,81,237,83]},"announce":[],"urlList":[]}}