{"title":"The Sound of Music NTSC DVD (4.35GB) Miss Julie Andrews","uid":5166547,"size":4681243573,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5a72348e32161c354b9578299a2d6071ce5d7c22&amp;dn=The+Sound+of+Music+NTSC+DVD+%284.35GB%29+Miss+Julie+Andrews&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"mrizzo2","files":-1,"time":1258435060,"description":"This is a re-launch of this torrent with only a couple of added jpgs\nshowing the DVD cover images (please remove them from the main folder\nprior to creating your disc). Thank you. (You can join this seed if\nyou previously downloaded this version, by just adding these jpgs from this\ntorrent).\n\n\nWe have 2mb bandwidth dedicated to the re-launch. Please share your seed\nto complete your download as qucikly as possibly. We can do this overnight\nif everyone co-operates to share. with thanks\n\nAudio: English French Spanish\nSubtitles (incl karaoke style sing-a-long) English French Spanish\n\nThis is a single layer format (4.35GB) DVd created from the the full 7.8GB DVD\ntorrent with only the movie and sing-along-features included. The interviews,\ntrailers and the like are not included or not set to be displayed\n\n&quot;The Sound of Music&quot; speaks singularly to the abusive stance taken by the\nindustry that cares not one bit for our children. A cruelly criminally deranged\nprice of thirty bucks is still being demanded of kids half a century after\nraking in the dough for this movie at this pace that has never stopped! It\nseems to me that an industry that can often afford to throw a way a movie\nsimply based on changing tastes in the executive boardroom in Hollywood (they\nsimply decide when they don't like a movie as much anymore and &quot;throw it into\nthe trashcan, depriving those that would even pay for it, any DVD access at all\n- I am referring to movies that had great successes in their time - like &quot;Last\ndays of disco&quot; and &quot;White mischief&quot;) could just as easily stop playing the game\nas Microsoft does and simply say to the kids that this movie is for everyone\nand that enough had been paid for it collectively that it would be\nunconscionable to charge for it any further, let alone price gouge as they are\n(you'd think they were selling a barrel of oil to our folks, for crissakes). In\nToronto Canada alone, some 500 families at a time wait to borrow a copy of this\nmovie from the library system, for their kids to learn from and be edified by,\nlet alone more rightly entertained. That's a shameful situation for a country\nthat spends billions on foreign aid instead of rather dubious integrity and\nreturn to the good folks that pay taxes here. These hollywood merchants simply\nseem to lack any connection to our values similarly it would appear.\n\n&quot;The Sound of music&quot; instills children with a spirit of appreciating beauty in\nour thoughts and in our sense of values, as we engage music in our aid\nespecially, along with the right mentors most of all in this formula for true\ngreatness in our midst.\n\nThis DVD (40 anniversary special widescreen presentation) even has &quot;karaoke\nlike&quot; subtitles to sing along to the songs.\n\nLets reach every child in Europe and in America too! Why not a million this\nvery week! Nothing would warm my heart more as the fondest fan of Julie Andrews\nas a teacher to our children in place of what is now going on instead.\n\n\nMichael Rizzo Chessman\nPlease see my reviews at moviesbyrizzo.info\n\n\nMany DVD writers on the market come with a free copy of Nero software\nthat will create the disc for you from these movie files. Or perhaps\nyou could download Nero on the net for free somewhere.\n\n\nWhy not from Nero.com !!\nhttp://www.nero.com/eng/downloads-nero9-free.php\n\n\nBecause this is single layer format DVD size, you are able to burn this movie\nto a cheap twenty cent single layer DVD disc to share with your neighbours kids\nthis christmas! No pesky copyright slogans appear on screen - its not a good\nexample for the kids to be preached to by the morally illiterate! Always burn\ndiscs at lower speed settings for the burning process, and make sure the\nprocessor is set to high speed for the program without anything else running\nwhile you burn and verify the data on the disc as a good burn. Dual layer discs\ntend to be finicky and must be carefully burned at lower speed settings to\navoid defects showing up when the verification takes place immediately after\nburn (using a program such as Nero particularly, as it does verify after burn\nif you set it to, and you certainly should).\n\n\n\n\nOptional Note: This is a multi-tracker torrent\nIf you use utorrent software, simply highlight the mounted torrent, then\nclick on &quot;trackers&quot; in your software, next, right click on the tracker that\nis showing, and select &quot;add tracker&quot; You should then then see all the trackers\nthat are alreay included atthe outset. Place a space (blank line) between each\ntracker showing, then click &quot;ok&quot; Your trackers will now show status and update\nmore easily when required (if desired, right click manually, on a selected\ntracker/DHT and select &quot;update&quot; for a better read).\n\nPS If you enable &quot;show alternating background color&quot; in your preferences\nmenu for &quot;UI settings&quot;, you'll find your screen easier on the eye and more\npleasing to read. Enjoy!","torrent":{"xt":"urn:btih:5a72348e32161c354b9578299a2d6071ce5d7c22","amp;dn":"The+Sound+of+Music+NTSC+DVD+%284.35GB%29+Miss+Julie+Andrews","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a72348e32161c354b9578299a2d6071ce5d7c22","infoHashBuffer":{"type":"Buffer","data":[90,114,52,142,50,22,28,53,75,149,120,41,154,45,96,113,206,93,124,34]},"announce":[],"urlList":[]}}