{"title":"Ping Pong BRRip 1080p","uid":7682523,"size":5532412626,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:5a7ef9f6456c3aaee14fdfd87af910ad18bb70e7&amp;dn=Ping+Pong+BRRip+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prisonnet","files":-1,"time":1348858534,"description":"Ping Pong\nJapan 2002\nBlu-Ray Rip 1080p x264\t\nJapanese audio. English subs\n\nIMDB: http://imdb.com/title/tt0328258/\n\nScreens: http://bayimg.com/LaDloaaED\n\n.:: S T O R Y ::.\nTwo best friends, Peco and Smile, have been playing ping pong since they were little kids. \nWhile Peco plays to win and completely loves the sport, Smile only plays because he looks up \nto Peco and does it to kill time with his friend (even though he obviously has the potential to \nbeing one of the best players around).\n\n.:: A B O U T ::.\n Famous for his madcap, screwy style, Taiyo Matsumoto's manga of the same name became a hit \nwith readers as it explored the world of ping pong like never before. And the film adaptation by \nMasuri is no different. PING PONG analyzes the spirituality of competition and inter-personal \nrelationships between team players and rivals. To them, ping pong was their livelihood and \nthey only knew the color of their blood when it stained the handles of their paddles. Even in the \ncontext of the fantastic, surreal attitude of the film, the characters come to life through their \ndeterminations and ambitions.\n\nWhile one might mistakenly compare PING PONG to many other extreme sports films, it just isn't \nso. For example, SHAOLIN SOCCER uses CENTRO DIGITAL'S artistry to paint and overwhelm the \npicture with beautiful, dynamic action, but for PING PONG'S dreamlike atmosphere, CG is used \nintermittently throughout, but is extremely subtle in execution, ranging from dragonflies over \nping pong tables, butterfly wings on a character or even the rapid fast ping pong balls zipping \nback and forth in mid matches. It is this delicate and faint styling that gives PING PONG its edge.\n","torrent":{"xt":"urn:btih:5a7ef9f6456c3aaee14fdfd87af910ad18bb70e7","amp;dn":"Ping+Pong+BRRip+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a7ef9f6456c3aaee14fdfd87af910ad18bb70e7","infoHashBuffer":{"type":"Buffer","data":[90,126,249,246,69,108,58,174,225,79,223,216,122,249,16,173,24,187,112,231]},"announce":[],"urlList":[]}}