{"title":"14_Degrees-A_Paranormal_Documentary.2007.360p.x264.HQwebrip.HDso","uid":11319507,"size":467307645,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5a81ea32758e1903fc0594e28324609e7166e82b&amp;dn=14_Degrees-A_Paranormal_Documentary.2007.360p.x264.HQwebrip.HDso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"psspss","files":1,"time":1414591096,"description":"14_Degrees-A_Paranormal_Documentary.2007.360p.x264.HQwebrip.HDsource_2h18m mp4\n\n\nEmbark on a journey of discovery and delve into the fascinating, mysterious and, at times, controversial world of paranormal investigation. Based mainly in New England, New Gravity Media touches base with some of the regions most respected paranormal researchers, mediums, scientists, skeptics, and of course... ghosts to bring you an in depth &quot;behind the scenes&quot; look at the subject that has the world afraid to sleep alone. Press Release: On October 17th, New Gravity Media released their latest production &quot;14 Degrees - A Paranormal Documentary.&quot; Hosted by Mark Veau (Oldies 98.9 WORC), the film touches base with some of the most respected names in paranormal research and features such notables as Steve Gonsalves, Keith Johnson (Sci-Fi's Ghost Hunters) and John Zaffis (ABC, Discovery Channel, TV Land, World News Now, Unsolved Mysteries) to present an informative &quot;behind-the scenes&quot; look at the history and modern methods of paranormal investigation. During this two year production, the New Gravity Media team immersed themselves in the paranormal world and not only interviewed, but followed independent research teams on over two dozen paranormal investigations throughout the northeast. Michael Baker, the writer and director of the film explains: &quot;To get an honest perspective of what this subject is all about we needed to become a part of it, so we not only went out with investigation teams, we also joined a group of our own and in essence became paranormal investigators. It was the best way to really understand the field and give the film the perspective it needed.&quot; The film crew traveled over 6,000 miles across 4 states, spoke to over 60 paranormal researchers, and shot over 280 hours of footage all of which has been condensed in to this 2 hour feature film\n\n\n\nHelp seed if grabbing cheers","torrent":{"xt":"urn:btih:5a81ea32758e1903fc0594e28324609e7166e82b","amp;dn":"14_Degrees-A_Paranormal_Documentary.2007.360p.x264.HQwebrip.HDso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a81ea32758e1903fc0594e28324609e7166e82b","infoHashBuffer":{"type":"Buffer","data":[90,129,234,50,117,142,25,3,252,5,148,226,131,36,96,158,113,102,232,43]},"announce":[],"urlList":[]}}