{"title":"Dean Koontz - Winter Moon (by tucky man)","uid":4614612,"size":489430943,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5b816595a3542700b39f455b901de611b06cc366&amp;dn=Dean+Koontz+-+Winter+Moon+%28by+tucky+man%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"m26us","files":-1,"time":1230771899,"description":"From Publishers Weekly\nA brush with death prompts L.A. policeman Jack McGarvey to move wife Heather and son Toby up to Quartermass Ranch, a Montana estate bequeathed to them by Eduardo Fernandez, the father of Jack's former partner. The McGarveys settle in, dismissing strange noises and smells, as well as weird trances that seem to grip Toby from time to time, as the embodiment of common fears of urbanites confronted by open spaces. It seems Eduardo had had uninvited visitors: the Givers, creatures from another dimension who came for an incomprehensible, apparently evil purpose. Scared out of his wits, Ed succumbed to a heart attack, but not before scrawling his discovery on a legal pad and stashing it in the freezer. These Givers are actually takers, assuming control of bodies and corpses to use them as vehicles in which to create mayhem. And now they want control of Toby. Bestselling author Koontz ( Hideaway ) exploits and occasionally skewers many horror novel and film conventions--including telepathic mind control games and the obligatory &quot;surprise&quot; blizzard during the climatic battle--to great effect while building tension in this gripping parable about the real cost of &quot;getting away from it all.&quot;","torrent":{"xt":"urn:btih:5b816595a3542700b39f455b901de611b06cc366","amp;dn":"Dean+Koontz+-+Winter+Moon+%28by+tucky+man%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b816595a3542700b39f455b901de611b06cc366","infoHashBuffer":{"type":"Buffer","data":[91,129,101,149,163,84,39,0,179,159,69,91,144,29,230,17,176,108,195,102]},"announce":[],"urlList":[]}}