{"title":"Talk Talk - Today [promo].VOB","uid":7964888,"size":247312384,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5c1f350ad0732cc61c584ef683e4a524a9dfce9b&amp;dn=Talk+Talk+-+Today+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1356668370,"description":"Talk Talk - Today [promo].VOB\n\n\nVery HQ rare promo music video from a promo DVD. &quot;Today&quot; is a song from The Party's Over, the debut album by Talk Talk. It was released in 1982 and produced by Colin Thurston, who was a former engineer for David Bowie but was better known for producing Duran Duran's first two albums. \n\nIn the United Kingdom, the album's single &quot;Today&quot; was a top twenty hit. The remixed version of the single &quot;Talk Talk&quot; reached #1 in South Africa in 1983 (and #23 in the UK). In the United States, the album entered the Billboard Top 200 reaching #132, while the single &quot;Talk Talk&quot; peaked at #75. \n\nIn New Zealand, the album was a hit, peaking at #8, due to the success of &quot;Today&quot; which reached there #10 in 1983. \n\nTalk Talk began as a quartet consisting of Mark Hollis (vocals), Simon Brenner (keyboards), Lee Harris (drums) and Paul Webb (bass guitar). They were generally associated with the New Romantic movement; more specifically, in their early years, they were often compared with Duran Duran, as both bands sported a name which was a single word repeated twice, a Roxy Music-inspired musical direction, and shared the same record label (EMI) and producer (Colin Thurston). \n\nIn their later years the band's commercial appeal receded, but their critical reputation increased as they moved from synthpop to a more experimental form. Their final two albums, Spirit of Eden and Laughing Stock, were highly acclaimed and remain influential to experimental alternative rock genres, especially post-rock. \n\nTalk Talk's influence upon musicians has exceeded the band's visibility among the general public. Along with the band Slint, Talk Talk are credited with inventing post-rock in their last two albums, Spirit of Eden and Laughing Stock. Sigur Ros has played Talk Talk songs before their shows. \n\nBands and artists that have claimed to be influenced by and/or a fan of Talk Talk include Portishead, Bark Psychosis, The Catherine Wheel, Lights, Radiohead and DJ Shadow. The band Weezer covered their song &quot;Life's What You Make It&quot; and No Doubt scored a hit with a cover of &quot;It's My Life&quot; in 2003. John Taylor of Duran Duran also has expressed fondness for the group; Talk Talk opened for Duran Duran back in 1982. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Party%27s_Over_(Talk_Talk_album)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Party%27s_Over_(Talk_Talk_album)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/pAHfcAAEm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/pAHfcAAEm&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x576 (4:3) 25fps 9800kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:03:28\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.5\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:5c1f350ad0732cc61c584ef683e4a524a9dfce9b","amp;dn":"Talk+Talk+-+Today+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c1f350ad0732cc61c584ef683e4a524a9dfce9b","infoHashBuffer":{"type":"Buffer","data":[92,31,53,10,208,115,44,198,28,88,78,246,131,228,165,36,169,223,206,155]},"announce":[],"urlList":[]}}