{"title":"Cities In Motion - Design Quirks","uid":8287708,"size":767388,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5c8d49bf872c96b8f369733e363ec7e1b1b28535&amp;dn=Cities+In+Motion+-+Design+Quirks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JUSTIN166","files":-1,"time":1363974340,"description":"One of each of vehicle type, but with a twist! Instead of helicopter take a pleasant ride in a hot air balloon, or  perhaps a tram that's been built like a boat to sail the city streets. These innovative vehicles will add a whole new level to the game and keep your company afloat with their high attractiveness.\n\nFeatures\n\nHot air balloon - The balloon is an exciting way to get around the city. The sights are fabulous and the going is slow so the passengers have plenty of time to enjoy them. There are no complicated mechanical parts, so the balloon is reliable and doesn't need much maintenance.\n\nAmphibus - The extraordinary Amphibus is a great invention. Looks like a bus, but glides on water elegantly! It carries a decent amount of passengers and movess speedily on water. It offers superb travelling with cushioned seats\n\nCaterpillar - The Caterpillar is an unique vehicle. It's a powerful metro train, and looks like a funky caterpillar! It has plenty of room and while the engine isn't top notch, it doesn't consume much fuel, making it a very efficient vehicle\n\nLucitania - This fancy tram was designed to be used in parades, but since it was very popular, more were produced. Cleverly disguised as a boat, this tram actually has lots of seats and a decent engine hidden inside\n\nSight-seeing Bus- The sight-seeing bus is built to look like a small train. While bringing joy to people by adding a cheerful touch to the cityscape, and also has a very low energy consumption. It's well-rounded vehicle, and very nice looking","torrent":{"xt":"urn:btih:5c8d49bf872c96b8f369733e363ec7e1b1b28535","amp;dn":"Cities+In+Motion+-+Design+Quirks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c8d49bf872c96b8f369733e363ec7e1b1b28535","infoHashBuffer":{"type":"Buffer","data":[92,141,73,191,135,44,150,184,243,105,115,62,54,62,199,225,177,178,133,53]},"announce":[],"urlList":[]}}