{"title":"Chris Brown - Yo (Excuse Me Miss)   (2nafish)","uid":5278424,"size":159121412,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5cf2a8c3dd1cd26f76eabc06b05a528d046f8b26&amp;dn=Chris+Brown+-+Yo+%28Excuse+Me+Miss%29+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1263463776,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Yo (Excuse Me Miss)&quot; is the second single from Chris Brown's debut album Chris Brown, released in 2005 in the U.S. and 2006 worldwide. &quot;Yo (Excuse Me Miss)&quot;, produced by Dre &amp; Vidal, became Brown's second top ten hit in the U.S., peaking at number seven on February 7, 2006. It has been certified platinum by the RIAA. In other countries, the song reached number thirteen in the United Kingdom and number ten in Australia.\n\nIt features Dre (AndrÃƒÂ© Merit) who sings the chorus' background vocals.\n\nThis song has appeared on the videogame Dance Dance Revolution Hottest Party.\n\nThe song also appears on the episode of One on One Season 5's &quot;Recipe For Disaster&quot; March 27, 2006.\n\nIn the music video, directed by Erik White, Brown sees a girl that catches his attention. He then follows the girls while dancing. After arriving at a basketball court, he begins to dance with two other guys. Brown then gets inside a car with the girl and sings to her as she tries to make out with him. He then gives her his phone number. He soon dances on a car and at the end of the video he beings to dance with a crowd of people. The video features the first verse of &quot;Gimme That&quot; at the end. Lil' JJ, Trey Songz, and DeRay Davis make cameo appearances in the video.\n\nChris Brown is the self-titled debut album by American R&amp;B singer Chris Brown, released on November 29, 2005 in the United States on Jive Records. It was a commercial success, certified double Platinum by the Recording Industry Association of America (RIAA) for scanning two million in the United States and sold over three million copies worldwide.\n\nIn 2006 a CD/DVD set entitled Chris Brown's Journey was released, featuring behind-the-scenes footage and commentary from Brown. Chris Brown was also released twice in DualDisc format.\n\nThe album's lead single was &quot;Run It!&quot;, which features rapper Juelz Santana and was produced by Scott Storch. It received continuous airplay(topping the Billboard Hot 100 Airplay), and reached number one on the Billboard Hot 100, where it stayed for five weeks. It replaced &quot;Gold Digger&quot; by Kanye West featuring Jamie Foxx, and was itself replaced by Mariah Carey's &quot;Don't Forget About Us&quot;. It also topped Billboard Pop 100. Other singles released from the album include &quot;Yo (Excuse Me Miss)&quot;, another U.S. top ten hit for Brown, as well as &quot;Gimme That&quot;, released as a remix featuring rapper Lil Wayne, and the fourth single, &quot;Say Goodbye&quot;, which peaked at number ten in the U.S. The fifth and final single from the album, &quot;Poppin'&quot;, charted outside the U.S. top forty.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:5cf2a8c3dd1cd26f76eabc06b05a528d046f8b26","amp;dn":"Chris+Brown+-+Yo+%28Excuse+Me+Miss%29+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cf2a8c3dd1cd26f76eabc06b05a528d046f8b26","infoHashBuffer":{"type":"Buffer","data":[92,242,168,195,221,28,210,111,118,234,188,6,176,90,82,141,4,111,139,38]},"announce":[],"urlList":[]}}