{"title":"Legion of the Lost: The True Experience of An American in the Fr","uid":9838037,"size":422568,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d69a7a2b1c2e1bee2f1e8c8ec6b4504ea8da6d5&amp;dn=Legion+of+the+Lost%3A+The+True+Experience+of+An+American+in+the+Fr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"leeatwater","files":1,"time":1395943315,"description":"Legion of the Lost - The True Experience of an American in the French Foreign Legion\n\nWritten by Jaime Salazar, Book Release: August 2005\n\nKindle File (AZW)\n\nSince 1831, the French Foreign Legion has been a renowned symbol of discipline and solidarity. Made up completely of foreign volunteers, the French Foreign Legion gives men a new lease on life, and a chance to test their limits both physically and mentally. And in 1999, the Foreign Legion was just what American Jaime Salazar was looking for.\n\nFrom the harrowing physical rigors of Legion basic training to his posting in the 2e REG outside of the tiny village of Saint Christol, from his fierce competitiveness and pride to his ultimate disillusionment with the French Foreign Legion and desertion, this is the story of Salazar's quest for honor and sacrifice. Legion of the Lost is a compelling, first-hand account of the contemporary French Foreign Legion, sure to dispel myths while, at the same time, add to the legend of the finest trained army of mercenaries the world has ever seen.\n","torrent":{"xt":"urn:btih:5d69a7a2b1c2e1bee2f1e8c8ec6b4504ea8da6d5","amp;dn":"Legion+of+the+Lost%3A+The+True+Experience+of+An+American+in+the+Fr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d69a7a2b1c2e1bee2f1e8c8ec6b4504ea8da6d5","infoHashBuffer":{"type":"Buffer","data":[93,105,167,162,177,194,225,190,226,241,232,200,236,107,69,4,234,141,166,213]},"announce":[],"urlList":[]}}