{"title":"Iron Maiden - A Matter of Life and Death 2006","uid":3607766,"size":114134005,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5f1fe0db94b46e4fe9e9ce7649d5cab85aada2b0&amp;dn=Iron+Maiden+-+A+Matter+of+Life+and+Death+2006&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"addflo","files":15,"time":1170275275,"description":"The band started writing songs at the end of 2005 after a short break from their hugely successful festival appearances in Europe and the USA. After Christmas the songs were completed and rehearsed when the band then got together with producer Kevin &amp;#039;Caveman&amp;#039; Shirley at Sarm West Studios in London to start work on recording the backing tracks.\n\nKevin Shirley has now co-produced three of the bands studio albums alongside Steve Harris, as well as two of their recent Live DVD&amp;#039;s and albums. From this the working relationship between Kevin and the band seems to get stronger and stronger. Says Kevin, &amp;#039;The Beast is back! I feel from the outset we all clicked on this one. We spent two months in the studio, from Go to Whoa - from Nicko&amp;#039;s &amp;#039;tubs up&amp;#039; to final mixes and sequenced master! That&amp;#039;s a tiny gestation period for an album. Producing Iron Maiden is like sitting in the head and driving one of those mammoth automatons from Star Wars or Saturday morning cartoons! And there&amp;#039;s nothing that can stop it!&amp;#039;\n\n&amp;#039;I feel incredibly privileged to have been around to see this album born and breathe life. There have been only a couple of occasions in my career when the ENTIRE process of recording felt so complete - and it is on display here.&amp;#039;\n\nAs on previous projects all of the tracks were performed live and together in one room. No click tracks or computer tightening or manipulation has happened at any stage of the recording.\n\nSays Steve Harris,&amp;#039; I think in many ways this has been the easiest album in terms of recording that we&amp;#039;ve ever done. The whole process of writing through to recording was very natural. I think in terms of the material we&amp;#039;ve also pushed our boundaries yet again and I think it will please our fans but also really surprise a lot of people as well. The sound we&amp;#039;ve managed to get is very powerful for a Maiden record and all of us have pushed ourselves in our own ways to create something that we&amp;#039;re all immensely proud of and I think working as quickly as we did with Kevin really was part of that process. We simply can&amp;#039;t wait to take this out on the road. We&amp;#039;ve played some great shows and had a lot fun recently introducing some of our older songs to a new generation of fans. However for us personally we&amp;#039;re incredibly excited about getting out and performing these new tracks.&amp;#039;\n\nSays Bruce Dickinson,&amp;#039;This album has to be our best since working with Kevin. There is such a wide scope of musicianship on this album and in parts this album is truly epic. I thought with the likes of Paschendale from the last studio album that we could only hope to surpass that but having now heard the album back as well as sitting with a few select people and hearing their reactions as well I truly believe we have managed it. Every one of us has put everything into this record and it&amp;#039;s really paid off. However we&amp;#039;ve had such fun making it that it&amp;#039;s almost difficult to believe what we&amp;#039;ve managed to achieve in the time it took.&amp;#039;\n\nThe full track listing is as below.\n\nA MATTER OF LIFE AND DEATH\n\n1. Different World (Smith/Harris) 4.17\n2. These Colours Don&amp;#039;t Run (Smith/Harris/Dickinson) 6.52\n3. Brighter Than a Thousand Suns (Smith/Harris/Dickinson) 8.44\n4. The Pilgrim (Gers/Harris) 5.07\n5. The Longest Day (Smith/Harris/Dickinson) 7.48\n6. Out Of the Shadows (Dickinson/Harris) 5.36\n7. The Reincarnation of Benjamin Breeg (Murray/Harris) 7.21\n8. For The Greater Good of God (Harris) 9.24\n9. Lord Of Light (Smith/Harris/Dickinson) 7.23\n10. The Legacy (Gers/Harris) 9.20\n\nwww.ironmaiden.com","torrent":{"xt":"urn:btih:5f1fe0db94b46e4fe9e9ce7649d5cab85aada2b0","amp;dn":"Iron+Maiden+-+A+Matter+of+Life+and+Death+2006","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f1fe0db94b46e4fe9e9ce7649d5cab85aada2b0","infoHashBuffer":{"type":"Buffer","data":[95,31,224,219,148,180,110,79,233,233,206,118,73,213,202,184,90,173,162,176]},"announce":[],"urlList":[]}}