{"title":"The Truth About Butterflies; Nancy Stephan (Mobi, Epub)","uid":7507411,"size":470580,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5fa3c5bcd8143fa13bf45d8f98cba9ddfc5e9d69&amp;dn=The+Truth+About+Butterflies%3B+Nancy+Stephan+%28Mobi%2C+Epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lynnrlou","files":1,"time":1344220877,"description":"They belong to each other, Nancy and Nicole--mother and daughter. They're two halves of a whole, two facets of the same breath--until the day Nicole exhales. . . and never inhales again. \n\nAfter the death of her daughter, and quickly losing her own battle with grief, Nancy decides to move from the house she can no longer bear to live in. While packing, she comes across a box in the attic. Inside this box, Nancy uncovers treasures she didn't know existed and evidence that her and her daughter's lives had been more divinely entwined than she could've imagined.\n\nThe Truth About Butterflies is a true story of grief, hope, and transformation, and a single enduring truth: Life cannot be restrained by death.\n\nOnce you've read the book, meet the people who make up Nancy's story. Scroll down and visit her Amazon author page or watch the video on YouTube, &quot;Meet the Characters: The Truth About Butterflies&quot;*\n\nReview\n\nNancy Stephan was named Georgia Author of the Year at the 48th annual Georgia Author of the Year Awards Banquet. Stephan's book, &quot;The Truth About Butterflies&quot;, won in the &quot;Memoir&quot; category. 105 authors were nominated in 12 categories. \n\nThe GAYA (Georgia Author of the Year Award) has the distinction of being the oldest literary awards in the Southeastern United States. The Awards have grown in prestige and participation since its inception in 1964 by the Dixie Council of Authors and Journalists.\n\nFrom the Author\n\n&quot;Thank you&quot; to all who've read my story. I hope you've found something of value within its pages.","torrent":{"xt":"urn:btih:5fa3c5bcd8143fa13bf45d8f98cba9ddfc5e9d69","amp;dn":"The+Truth+About+Butterflies%3B+Nancy+Stephan+%28Mobi%2C+Epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fa3c5bcd8143fa13bf45d8f98cba9ddfc5e9d69","infoHashBuffer":{"type":"Buffer","data":[95,163,197,188,216,20,63,161,59,244,93,143,152,203,169,221,252,94,157,105]},"announce":[],"urlList":[]}}