{"title":"ME - Ricky Martin autobiography (2010) audiobook version","uid":6075861,"size":172323172,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5fc06b1405f8b5adf0b20fdc1a63e6d18dfd5c02&amp;dn=ME+-+Ricky+Martin+autobiography+%282010%29+audiobook+version&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rubusdemonoid","files":-1,"time":1293835096,"description":"Please help to seed this torrent when you are completed as my ISP has a monthly limit that I always max out on since I have over 60 torrents that I seed for you all. My ISP is going to terminate my service if I max out my monthly limit, so I just can\\'t continue to seed all by myself so often. PLEASE help to seed. Thank you.  :)\n\nI had to downgrade my internet connection, so my upload speed is terrible, so I apologize for that in advance and thank you for your patience.\n\n\nRipped at 48kbit - 44100Hz Mono, MP3\n\nRead by Jonathan Davis\n\nFrom Amazon:\nReview\nIn the process of revealing the human being behind the artist, Ricky Martin offers us a testimony of exemplary honesty and greatness of soul. While I was reading, I remembered a verse from the Persian poet Hafez, 'Not even seven thousand years of joy can justify seven years of repression.' Paulo Coelho Ricky Martin has written an extraordinary memoir, the story of a tortured soul who healedhimself by returning to the state of innocence and authenticity. His story will speak to you,because it is, in a sense, the story of humanityoof the sacred and the profane, of forbidden lust and unconditional love. It takes courage to be so ruthlessly honest and transparent, but it is only this kind of courage and this kind of love that can heal the world. Bravo!\n\nProduct Description\nInternational superstar, Ricky Martin, who has sold more than 60 million albums worldwide, opens up for the first time about memories of his early childhood, experiences in the famed boy band Menudo, struggles with his identity during the Livin' la Vida Loca phenomenon, reflections on coming to terms with his sexuality, relationships that allowed him to embrace love, and life-changing decisions like devoting himself to helping children around the world and becoming a father. Me is an intimate memoir about the very liberating and spiritual journey of one of the most iconic pop-stars of our time.\n\nAbout the Author\nJoining Latin pop group Menudo at the age of 12 as lead singer, Ricky Martin had scored countless #1 singles globally prior to making his mark in the US with his worldwide hit, &quot;Livin' La Vida Loca.&quot; Throughout his 25-year musical career, he has sold over 60 million albums and has won numerous GRAMMY awards, American Music Awards and Billboard Awards. Martin is also a devoted humanitarian, having established The Ricky Martin Foundation. He lives between Miami and San Juan, Puerto Rico.\n\n\n\n\n\nMore of my music &amp; movie downloads that you may find of interest are located here: &lt;a href=&quot; http://thepiratebay.se/user/rubusdemonoid/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/rubusdemonoid/&lt;/a&gt;\n\n\n\n\n","torrent":{"xt":"urn:btih:5fc06b1405f8b5adf0b20fdc1a63e6d18dfd5c02","amp;dn":"ME+-+Ricky+Martin+autobiography+%282010%29+audiobook+version","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fc06b1405f8b5adf0b20fdc1a63e6d18dfd5c02","infoHashBuffer":{"type":"Buffer","data":[95,192,107,20,5,248,181,173,240,178,15,220,26,99,230,209,141,253,92,2]},"announce":[],"urlList":[]}}