{"title":"The Blackwell Encyclopedic Dictionary of Finance","uid":4883924,"size":22300150,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:61046715308b1bdf3805fe9ff5c0caa0e9c96f49&amp;dn=The+Blackwell+Encyclopedic+Dictionary+of+Finance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VasiaZozulia","files":-1,"time":1241553977,"description":"The Blackwell Encyclopedic Dictionary of Finance provides clear, concise, up to the minute and highly informative definitions and explanations of the key concepts covering the whole of the fast changing field of contemporary finance. Bringing together specially commissioned and carefully edited entries from an international team of the world's best known and respected finance scholars and teachers, this will become the standard reference for students, researchers, academics and practitioners. The Dictionary has been carefully designed to give both the expert and the newcomer overviews and succinct presentations of the most important concepts, terms and techniques in modern finance. With entries ranging from extended explorations of major topics to short definitions of key terms, this major reference work gives the user:Authoritative and comprehensive coverage of the whole field.A fully indexed and cross-referenced for detailed research with relevant citations for further study.Definitive entries covering the very latest development in finance.A completely international perspective and author base. This dictionary is part of the Blackwell Encyclopedia of Management which contains ten further volumes covering each of the key areas of management science developed under the editorship of Professor Cary Cooper from the Manchester School of Management and Professor Chris Argyris of Harvard Business School.","torrent":{"xt":"urn:btih:61046715308b1bdf3805fe9ff5c0caa0e9c96f49","amp;dn":"The+Blackwell+Encyclopedic+Dictionary+of+Finance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61046715308b1bdf3805fe9ff5c0caa0e9c96f49","infoHashBuffer":{"type":"Buffer","data":[97,4,103,21,48,139,27,223,56,5,254,159,245,192,202,160,233,201,111,73]},"announce":[],"urlList":[]}}