{"title":"Sandrine Gasq-Dion - The Medicine and the Mob (The Santorno Stor","uid":9991891,"size":761565,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:612b832770498c24648733ebfc20ae7cca3601da&amp;dn=Sandrine+Gasq-Dion+-+The+Medicine+and+the+Mob+%28The+Santorno+Stor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"krystine","files":-1,"time":1397860822,"description":"Stefan Sanders knows two things: He never wants to be like his father. He's going to die if someone doesn't remove the tumor in his head.\nStefan is the son of a notorious and ruthless mobster, which effectively scares off any doctor he'd let anywhere near his brain. Enter pompous, rude Jordan Youngblood, a gifted neurosurgeon who isn't afraid of anyone and loves a good challenge. The doctor is his own biggest fan, and lacks even a passable bedside manner - but if he get's the job done, who is Stefan to complain?\nJordan Youngblood knows one thing: He's never going to get close to a patient again. Ever. That rule works well until Damon Santorno walks into his office. Jordan's a genius, and it doesn't take one to figure out that Damon means business. His son is dying of a brain tumor and even with all his power and money, Damon can't save him. But Jordan can.\nWith a not-so-gentle nudge from the older Santorno, Jordan agrees to take on Stefan's case. He expects one more notch on his brilliant scalpel, not a dimpled patient who is completely sweet and impossible to avoid. Things get complicated as Jordan strives to save Stefan's life and his own heart.\nThey say the apple doesn't fall far from the tree. Stefan and Jordan find that there really are plenty of shades of gray between black and white, right and wrong.","torrent":{"xt":"urn:btih:612b832770498c24648733ebfc20ae7cca3601da","amp;dn":"Sandrine+Gasq-Dion+-+The+Medicine+and+the+Mob+%28The+Santorno+Stor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"612b832770498c24648733ebfc20ae7cca3601da","infoHashBuffer":{"type":"Buffer","data":[97,43,131,39,112,73,140,36,100,135,51,235,252,32,174,124,202,54,1,218]},"announce":[],"urlList":[]}}