{"title":"Audio Editor Gold 9.2.15","uid":4966102,"size":19004531,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:614710d240363486d7ad147f8db8a5c88dab994f&amp;dn=Audio+Editor+Gold+9.2.15&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"daxon7","files":-1,"time":1245534981,"description":"Audio Editor Gold 9.2.15\n\n\nAudio Editor Gold is an advanced and powerful, full-featured digital audio editing software. You can use it to \nrecord your own music, voice, or other audio, edit it, mix it with other audio or musical parts, add effects like\nReverb, Chorus, and Echo, and master it so that you can burn it to a CD, post it on the World Wide Web, or e-mail\nit. It provides an intuitive, easy-to-use interface and enables you to perform a lot of operations without any \ndifficulties! Audio Editor Gold supports all major audio file formats. If you're using audio for anything - Websites\n, PowerPoint presentations, Flash animations, It will take your creations to the next level!\nUse Audio Editor Gold to record your own music, voice or other sounds, import and export lots of audio files \nformats\n, including Windows PCM (WAV), MP3, Ogg Vorbis, WMA 9 and AIFF, play it, mix it, edit audio files visually using \nCut\n, Copy, Paste and applying more than 20 effects and filters, including: Cut, Paste, Move, Delete, Fadein/Out,\n Crossfade, Vibrato, Delay, Normalize, Fade, Flanger, Amplify, Invert, Insert Silence, and more.\n\nFeatures:\n********\n- Open, create, and save audio files in any of the supported formats (can also save any portion of a loaded file \nto disk as a new file);\n- Display audio data waveform (Zoom Full, Zoom In, Zoom Out, Zoom Vertical);\n- Record audio data from a microphone or any other available input device (You can record audio from DVD / VCD / CD\n Player, Tapes\nand LP's, MP3 Player, RealPlayer, Windows Media Player, Web Page, Internet Conversation, Internet News, Internet \nRadio Station and more);\n- Edit audio files visually (Cut, Copy, Delete Selection, Delete Silence, Paste, Paste From File, Mix, Mix From \nFile);\n- Apply various effects (Amplify, Compressor, Delay, Equalize, Fade In and Fade Out, Flanger, Invert, Normalize,\n Phaser, Reverb, Reverse, Silence, Shrink, Stretch, Vibrato, etc.);\n- Apply different filters to any selected portion of audio files (BandPass Filter, FFT Filter, HighPass Filter, \nHighShelf Filter,LowPass Filter, LowShelf Filter, Notch Filter);\n- Convert an audio file from one format to another;\n- Use marker to locate the selected part or special part of the audio data;\n- Add and edit extra information to your audio files (Album, Artist, Comments, Copyright, Genre, Title, Year).","torrent":{"xt":"urn:btih:614710d240363486d7ad147f8db8a5c88dab994f","amp;dn":"Audio+Editor+Gold+9.2.15","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"614710d240363486d7ad147f8db8a5c88dab994f","infoHashBuffer":{"type":"Buffer","data":[97,71,16,210,64,54,52,134,215,173,20,127,141,184,165,200,141,171,153,79]},"announce":[],"urlList":[]}}