{"title":"Paradigm","uid":8405207,"size":361706172,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:61801f9f77c96da926a6132c55b67102e854b9b6&amp;dn=Paradigm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1366790756,"description":"Issues 1-12 of 'Paradigm'\n\nImage Comics, 2002-2003, 44 pages per issue\n\nWritten by Matthew Cashel\nIllustrated by Jeremy Haun\n\nParadigm is an experiment in encompassing all the strange, quirky, and wild happenings currently taking place in the world around us. A way to catalogue not only the history of mankind through pop-culture, but through the hidden and fantastic worlds that surround us. And when unexpected behavior and events begin to occur with alarming regularity, it becomes apparent that a new way of thought has overtaken the city of Bogsdale, and perhaps, the world. This Issue Chris Howells had it all: a beautiful girlfriend of two years, a TV and digital satellite, a job with weekends off; a perfectly ordinary life. But when Wednesday's &quot;date night&quot; arrived, it brought with it more than the usual dinner and a movie. A strange and unexpected event occurred that evening in the city of Bogsdale, in a dark and secluded parking lot behind the old movie house, an event that would leave Chris Howells and the reality in which he believed forever changed.\n\n\nParadigm showcases a world very familiar, a world of arguing couples, sitcoms, and 9-5 jobs. A world we all know and understand, a world in hiding. It is within those shadows, however, that the real world of paradigm is waiting. Waiting for a time when the shroud can be thrown back, and the last generation of mankind can truly begin its final years. The evolution has begun, and no one gets out alive. Except for those, perhaps, who embrace the &quot;POP&quot;!\n\n\nThe Concept A soap-opera charting the final generation of mankind where every scene counts and the status-quo of times past is forgotten. A comic-series that allows the everyday to take the forefront of gonzo world-changing events. An epic tale of an ensemble cast that attempt to remember the past in a new world where passions, under-city dwellers, trolls, fairies, conspiracies, and talking cats thrive. Paradigm is an experiment-in-progress.\n\n\nDrama, comedy, adventure, sci-fi, horror, and fantasy. Talking cats, trolls, nutballs with big guns, and the seemingly ordinary men and women who populate our everyday lives. Paradigm is a time capsule full of history and future prophesies intended to change the world. Read carefully.\n\n\nThis series went on &quot;hiatus&quot; in 2004 with an back page announcing issue 13. If only that were true. I have no idea why it didn't continue or has never made a return, but I would certainly love for it to do so.","torrent":{"xt":"urn:btih:61801f9f77c96da926a6132c55b67102e854b9b6","amp;dn":"Paradigm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61801f9f77c96da926a6132c55b67102e854b9b6","infoHashBuffer":{"type":"Buffer","data":[97,128,31,159,119,201,109,169,38,166,19,44,85,182,113,2,232,84,185,182]},"announce":[],"urlList":[]}}