{"title":"Judas Priest - Priest...Live! (resequenced &amp; expanded by }{e","uid":9239768,"size":784645441,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6222bcf9dad2f5f3c5d5474173da7d582da8a8bb&amp;dn=Judas+Priest+-+Priest...Live%21+%28resequenced+%26amp%3B+expanded+by+%7D%7Be&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"}{eywood","files":33,"time":1385240418,"description":"Priest...Live! was recorded at two shows on the 1986 Fuel For Life tour: Atlanta on June 15th and Dallas on June 27th.  Through careful side by side comparison I find that most of the CD version is from the Atlanta show as compared with the DVD, which is entirely from the Dallas show.  This was a good decision because Rob is slightly better at the Atlanta gig, a bit less pitchy and more confident with longer and stronger high notes.  There were, however, some variations in his vocals in the Dallas show that I really liked, so I punched a few lines in here and there. All songs are from Atlanta (and sourced from the CD) except:\n\nIn &quot;Out In The Cold&quot;, the second bridge is from Dallas (Where are you now...I feel as though I'm out in the cold), and the explosion in the second chorus is added in from Dallas also.\n\n&quot;Locked In&quot; is from the Dallas show off the DVD.\n\nin &quot;Heading Out To The Highway&quot; the &quot;C'mon!&quot; yell at the start is punched in from Dallas. So are the ad lib lines &quot;I want you to sing along with me, c'mon&quot; before the first chorus. \n\n&quot;Breaking The Law&quot; is the same on both CD and DVD and is therefore from Dallas.\n\nIn &quot;Love Bites&quot; I added the explosion when the band comes in from the Dallas show (explosions kick ass).\n\nIn &quot;The Sentinel&quot; the line &quot;The knives fly out like bullets upon their deadly course&quot; is from Dallas. So is the introduction.\n\n&quot;Desert Plains&quot; is not on the CD and is therefore from Dallas, flown in from the DVD.\n\n&quot;Rock You All Around The World&quot; is from the CD, and is the same as the DVD, so Dallas.\n\nIn &quot;Freewheel Burning&quot; the introductory lines &quot;We're gonna keep the octane fueled up right now because we're gonna go...&quot; are added in from Dallas.\n\nFrom the line &quot;We blaze with scorching heat&quot; thru to the start of the second chorus of &quot;Freewheel Burning&quot; is from Dallas.\n\n&quot;Green Manalishi&quot; and &quot;Parental Guidance&quot; are from Dallas, the first is from the DVD and the second from the CD.","torrent":{"xt":"urn:btih:6222bcf9dad2f5f3c5d5474173da7d582da8a8bb","amp;dn":"Judas+Priest+-+Priest...Live%21+%28resequenced+%26amp%3B+expanded+by+%7D%7Be","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6222bcf9dad2f5f3c5d5474173da7d582da8a8bb","infoHashBuffer":{"type":"Buffer","data":[98,34,188,249,218,210,245,243,197,213,71,65,115,218,125,88,45,168,168,187]},"announce":[],"urlList":[]}}