{"title":"Senser - Stacked Up (1994)@flac","uid":5936091,"size":494582101,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:62bd9e2e0553f7d46307fddf08a9b3968fb13e71&amp;dn=Senser+-+Stacked+Up+%281994%29%40flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"alekow1","files":27,"time":1288962948,"description":"\n\nBefore the combination of rap and rock became a played-out cliche in the late 1990s, Senser's 1994 release Stacked Up exploded across both sides of the Atlantic with newfound energy. \nOne of the reasons why Senser's music is so effective is that it is generally very effectively arranged. \nOn the opener, &quot;States of Mind,&quot; for example, the bass dramatically drops out for a verse near the end of the song, allowing the metal guitar and funky drums to buoy the raps. \nAnother thing about this record is that Senser varies the dynamic levels of the songs; it's not all full-throttle, go-for-the-throat from beginning to end. \nThere are elements of bands such as Gong and Ozric Tentacles in some of the almost spacey instrumentation (and judging by the band's shout-out to the Ozrics, this isn't too far of a stretch). Producer Haggis has aided the band in creating an extremely dense album without sounding busy or detracting from the groove. In that sense, it is similar in sound and spirit to Public Enemy's records from the early '90s. \nIf there is one weak point to this band, it is in the vocals. When rapper Heitham Al-Sayed exhorts the listener to &quot;pump it up&quot; in &quot;Switch,&quot; the listener's most instinctive response is along the lines of, &quot;Uh, no.&quot; \nThankfully, the rest of the music is so varied and good that his weaknesses as a vocalist aren't the worst thing in the world. (AMG)\n\n\n'The perfect mixture of metal, hip-hop and techno'\n\n\n\n\n01. States Of Mind\n02. The Key\n03. Switch\n04. Age Of Panic\n05. What's Going On\n06. One Touch One Bounce\n07. Stubborn\n08. Door Game\n09. Peanut Head\n10. Peace\n11. Eject\n12. No Comply\n13. Worth:\n\n\n\nSenser are:\nNick Michaelson (guitar), Heitham Al-Sayed (vocals), Kerstin Haigh (vocals), John Morgan (drums), James Barrett (bass), Haggis (engineer, producer, programmer).\n\n\n\nLabel: The Ultimate Recording Company\nReleased: 1994\n\n\n\nCodec: Flac\nCompression Level: 5\nQuality: High\n\n\nCD-rip by alekow (EAC and Flac)\nCovers Included (400dpi)\n\n\n\n\n\n\n\nEnjoy, Seed and Share","torrent":{"xt":"urn:btih:62bd9e2e0553f7d46307fddf08a9b3968fb13e71","amp;dn":"Senser+-+Stacked+Up+%281994%29%40flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62bd9e2e0553f7d46307fddf08a9b3968fb13e71","infoHashBuffer":{"type":"Buffer","data":[98,189,158,46,5,83,247,212,99,7,253,223,8,169,179,150,143,177,62,113]},"announce":[],"urlList":[]}}