{"title":"Lioness (2008) documentary of women in combat","uid":13423831,"size":670494727,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:63a5daae49101cca4563fd6a93d124046574226f&amp;dn=Lioness+%282008%29+documentary+of+women+in+combat&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"loninappleton","files":9,"time":1454573661,"description":"Lioness (2008)\r\ndirected by Meg McLagan and Daria Sommers \r\n\r\nThe fileshare includes extras previously omitted as well as &quot;Team Lioness On Capitol Hill&quot;\r\n\r\nIMDb ref:/tt1202749\r\n\r\nFrom the website description:\r\n\r\nSynopsis\r\n\r\nLioness tells the story of a group of female Army support soldiers who were part of the first program in American history to send women into direct ground combat. Without the same training as their male counterparts but with a commitment to serve as needed, these young women fought in some of the bloodiest counterinsurgency battles of the Iraq war and returned home as part of this country’s first generation of female combat veterans. Lioness makes public, for the first time, their hidden history.\r\n\r\nTold through intimate accounts, journal excerpts, archival footage, as well as interviews with military commanders, the film follows five Lioness women who served together for a year in Iraq. With captivating detail, this probing documentary reveals the unexpected consequences that began by using these Army women to defuse tensions with local civilians, but resulted in their fighting alongside Marine combat units in the streets of Ramadi. Together the women's candid narratives describing their experiences in Iraq and scenes from their lives back home form a portrait of the emotional and psychological effects of war from a female point of \r\n\r\nDiretor's statement--\r\n\r\nWhen we first met up with the Lioness women, they had already been back in the U.S. for over a year and it was clear that what they had experienced in Iraq was only part of the story. The rest was unfolding in their lives as they confronted the reality that they were called upon to do the one thing they were told they could never do: engage in direct combat. And they were asked to do so precisely because they were female.\r\n\r\nBecause neither of us come from military backgrounds, we approached our subjects with an attitude of discovery. We did not assume that we knew what life was like for them and remained open to understanding their world and its logic. As we listened to their combat stories, what emerged was a tale that touches on the universal horror of war but one told from a female perspective. \r\n\r\nThe website which can find with Google &gt; 'Lioness movie'  also contains information about awards for the film and a teaching guide for use in schools.\r\n\r\nMy previous notes (2013)\r\n\r\n  I have torrented this film before and it seemed to be received well on file shares.  But no one of the many downloaders over at demon* have kept it going nor can it be found elsewhere on torrents using the most common search engines.\r\n   At this moment of January 2013 the Joint Chiefs of Staff have given approval for women in combat positions. It is rightly stated that women have been doing this for ten years.  Team Lioness consists of women fully trained in battle whose express purpose is to assist in searches of women who are captured in the war in Iraq. \r\n   \r\nThis film is not about whether the US should be in Iraq searching women for weapons.  What it is about is a group of women who, as the dvd tagline says were 'there for the action but missing from history.'\r\n\r\n   Film shows both combat and stateside portraits of these women.\r\n\r\n   You see, these women do not get full combat pay, treatment for PTSD or battle ribbons for outstanding service.  The testimony given to Congress addresses these issues.  &quot;Team Lioness on Capitol Hill&quot; is a short clip of the procedings at about 15 minutes.\r\n\r\n   Many issues have come to the fore as to why women should be given full rank and duty with men.  &quot;Lioness&quot;  presents many of the reasons why and perhaps that testimony 5 years ago took this long to be adopted by the military.\r\n\r\n   When I first fileshared Lioness I concluded with one phrase that still holds true: whether you are man or woman, war will change you.\r\n\r\nNotes written January 2013\r\n==\r\n\r\nNotes on the new Torrent  \r\n\r\n  I made this more complete version of Lioness due to the news stories about women now completing advanced field training for the US military.  These stories made it sound like there were no female combat veterans previously.  Lioness (2008) tells that story. The majority of the extras are now included in this torrent.  See the Lioness website and get the film and teaching materials for your schools-- everywhere.\r\n\r\nUpdated February 5th 2016","torrent":{"xt":"urn:btih:63a5daae49101cca4563fd6a93d124046574226f","amp;dn":"Lioness+%282008%29+documentary+of+women+in+combat","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63a5daae49101cca4563fd6a93d124046574226f","infoHashBuffer":{"type":"Buffer","data":[99,165,218,174,73,16,28,202,69,99,253,106,147,209,36,4,101,116,34,111]},"announce":[],"urlList":[]}}