{"title":"Quantum Computation and Quantum Information 10th Ed","uid":6803673,"size":6319667,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:63e23ad82a7a935aa99d63660a08a136ef6a95fe&amp;dn=Quantum+Computation+and+Quantum+Information+10th+Ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"metaseed","files":1,"time":1320779705,"description":" &lt;a href=&quot;http://books.google.com/books?id=-s4DEy7o-a0C&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://books.google.com/books?id=-s4DEy7o-a0C&lt;/a&gt;  (Cited by 13700)\nQuantum Computation and Quantum Information: 10th Anniversary Edition\nCambridge University Press, 2011\n676 pages\nISBN\t1107002176, 9781107002173\n\nOne of the most cited books in physics of all time, Quantum Computation and Quantum Information remains the best textbook in this exciting field of science. This 10th anniversary edition includes an introduction from the authors setting the work in context. This comprehensive textbook describes such remarkable effects as fast quantum algorithms, quantum teleportation, quantum cryptography and quantum error-correction. Quantum mechanics and computer science are introduced before moving on to describe what a quantum computer is, how it can be used to solve problems faster than 'classical' computers and its real-world implementation. It concludes with an in-depth treatment of quantum information. Containing a wealth of figures and exercises, this well-known textbook is ideal for courses on the subject, and will interest beginning graduate students and researchers in physics, computer science, mathematics, and electrical engineering.\n\nAbout the author (2011):\n\nMichael Nielsen was educated at the University of Queensland, and as a Fulbright Scholar at the University of New Mexico. He worked as the Richard Chace Tolman Fellow at Caltech at Los Alamos National Laboratory, was Foundation Professor of Quantum Information Science and a Federation Fellow at the University of Queensland, and a Senior Faculty Member at the Perimeter Institute for Theoretical Physics.\n\nIsaac Chuang is an Associate Professor at the Massachusetts Institute of Technology, jointly appointed in Electrical Engineering and Computer Science and in Physics. He leads the quanta research group at the Center for Ultracold Atoms, in the MIT Research Laboratory of Electronics, which seeks to understand and create information technology and intelligence from the fundamental building blocks of physical systems, atoms and molecules.","torrent":{"xt":"urn:btih:63e23ad82a7a935aa99d63660a08a136ef6a95fe","amp;dn":"Quantum+Computation+and+Quantum+Information+10th+Ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63e23ad82a7a935aa99d63660a08a136ef6a95fe","infoHashBuffer":{"type":"Buffer","data":[99,226,58,216,42,122,147,90,169,157,99,102,10,8,161,54,239,106,149,254]},"announce":[],"urlList":[]}}