{"title":"Materials Science of Polymers for Engineers 3rd ed","uid":14840538,"size":90703040,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:63e3871393421b36d8e6bf6499b26700bf7437be&amp;dn=Materials+Science+of+Polymers+for+Engineers+3rd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1465367716,"description":"Materials Science of Polymers for Engineers 3rd ed - Tim A. Osswald, Georg Menges (Hanser, 2012).pdf\r\n\r\nISBN 978-1-56990-514-2\r\n\r\nThis unified approach to polymer materials science is divided in three major sections: Basic Principlescovering historical background, basic material properties, molecular structure, and thermal properties of polymers. Influence of Processing on Propertiestying processing and design by discussing rheology of polymer melts, mixing and processing, the development of anisotropy, and solidification processes. Engineering Design Propertiescovering the different properties that need to be considered when designing a polymer component from mechanical properties to failure mechanisms, electrical properties, acoustic properties, and permeability of polymers. A new chapter introducing polymers from a historical perspective not only makes the topic less dry, but also sheds light on the role polymers played, for better and worse, in shaping todays industrial world. The first edition was praised for the vast number of graphs and data that can be used as a reference. A new table in the appendix containing material property graphs for several polymers further strengthens this attribute. The most important change made to this edition is the introduction of real-world examples and a variety of problems at the end of each chapter","torrent":{"xt":"urn:btih:63e3871393421b36d8e6bf6499b26700bf7437be","amp;dn":"Materials+Science+of+Polymers+for+Engineers+3rd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63e3871393421b36d8e6bf6499b26700bf7437be","infoHashBuffer":{"type":"Buffer","data":[99,227,135,19,147,66,27,54,216,230,191,100,153,178,103,0,191,116,55,190]},"announce":[],"urlList":[]}}