{"title":"The Twilight Saga Eclipse [SUBTITULADO]","uid":5698771,"size":647858270,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:64eab39733190c65946ef2514870a84aca9db79c&amp;dn=The+Twilight+Saga+Eclipse+%5BSUBTITULADO%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"w1sar","files":1,"time":1279412727,"description":"Idioma: InglÃƒÂ©s\n\nSubtÃƒÂ­tulos: EspaÃƒÂ±ol latino\n\nSolo dale reproducir y listo!!!\n\n\n\nSinopsis\n\n\nTodo comienza... con una elecciÃƒÂ³n.\n\nEn La Saga CrepÃƒÂºsculo: Eclipse, tercera entrega de la serie de descomunal ÃƒÂ©xito de Stephenie Meyer, Bella Swan (Kristen Stewart) vuelve a encontrarse rodeada de peligros, mientras Seattle se ve asolada por una oleada de misteriosos asesinatos y una maliciosa vampira prosigue su bÃƒÂºsqueda de venganza. En medio de todo eso, Bella se ve obligada a elegir entre su amor por Edward Cullen (Robert Pattinson) y su amistad con Jacob Black (Taylor Lautner), perfectamente consciente de que su decisiÃƒÂ³n tiene muchas posibilidades de exacerbar la eterna rivalidad entre vampiros y hombres lobo. Con su graduaciÃƒÂ³n cada vez mÃƒÂ¡s prÃƒÂ³xima, Bella no tiene mÃƒÂ¡s remedio que afrontar la decisiÃƒÂ³n mÃƒÂ¡s importante de su vida.\n\nMientras que la mayorÃƒÂ­a de sus amigos del instituto estÃƒÂ¡n recibiendo cartas de aceptaciÃƒÂ³n en las distintas universidades y enviando avisos de graduaciÃƒÂ³n, Bella se encuentra tomando una decisiÃƒÂ³n que le permitirÃƒÂ­a estar con su amado Edward para siempre. Pero le cuesta aceptar la condiciÃƒÂ³n impuesta por Edward (debe casarse con ÃƒÂ©l antes de que ÃƒÂ©l acepte ser quien la convierta en vampiro) y las consecuencias que estas elecciones pueden traer para sÃƒÂ­ misma, su familia y sus amigos.\n\nEntre tanto, se avecina una guerra. Jugando con los puntos ciegos de los dones mÃƒÂ­sticos de la familia Cullen, una fuerza desconocida ha creado un ejÃƒÂ©rcito de neÃƒÂ³fitos, compuesto por vampiros reciÃƒÂ©n transformados, cuyo salvajismo y sed de sangre incontrolable estÃƒÂ¡ en su momento ÃƒÂ¡lgido en los primeros meses de vida sobrenatural. Ã‚Â¿Son peones de Victoria (Bryce Dallas Howard) en su obsesiva bÃƒÂºsqueda de venganza, o de los todopoderosos Vulturis, que pretenden asegurarse de que Bella siga adelante con su intenciÃƒÂ³n de hacerse inmortal?\n\nA medida que el ejÃƒÂ©rcito de neÃƒÂ³fitos, encabezado por Riley (Xavier Samuel), avanza hacia Forks y el territorio de los quileute, los Cullen y la manada de lobos deberÃƒÂ¡n dejar de lado su conflicto instintivo y formar una alianza para proteger a Bella y su comunidad de una amenaza mayor. Mientras se preparan para la batalla, Bella descubre mÃƒÂ¡s informaciÃƒÂ³n sobre la historia secreta de la tribu quileute, la cada vez mÃƒÂ¡s numerosa manada de lobos y el pasado de Jasper y de Rosalie. Este conocimiento la ayudarÃƒÂ¡ a comprender los vÃƒÂ­nculos creados entre los lobos, reconocer su amor por Jacob Black y contribuir a la protecciÃƒÂ³n de sus seres queridos.\n\n","torrent":{"xt":"urn:btih:64eab39733190c65946ef2514870a84aca9db79c","amp;dn":"The+Twilight+Saga+Eclipse+%5BSUBTITULADO%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64eab39733190c65946ef2514870a84aca9db79c","infoHashBuffer":{"type":"Buffer","data":[100,234,179,151,51,25,12,101,148,110,242,81,72,112,168,74,202,157,183,156]},"announce":[],"urlList":[]}}