{"title":"Heroes of Steel elite v4.2.35 full [apkpita]","uid":14695132,"size":63455261,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:650dbef1a7b30a15302e88fef7b10e228a883212&amp;dn=Heroes+of+Steel+elite+v4.2.35+full+%5Bapkpita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":1,"time":1464224429,"description":"Play the free RPG version &quot;Heroes of Steel RPG&quot; before you purchase Elite and enjoy hours of turn-based strategy in Red Hill for free! The Trese Brothers never run ads in our games -- enjoy an ad free, permission free experience!\r\nHeroes of Steel Elite includes the entire story (all 4 Episodes) - easily 120+ hours of epic story and content as you battle across the Underdeep. This game features no grinding - all continuous story. Please note there is no transfer of IAPs or character groups from Heroes of Steel RPG to Elite.\r\n\r\nCommand your party of four heroes as they fight to protect the last remnants of humanity. Born in a time of warring gods and dark powers, your four unlikely heroes embark on a grim journey set in the sprawling and immense post-apocalyptic medieval world of Steel.\r\n\r\nIt is the dawn of the Seventy First Year after the world has fallen. Four of the Thirteen Gods rose up against their creator, the All-Father, and destroyed him in a cataclysmic event. In the final days before all was lost, under the guidance of an ancient order of druids, the survivors retreated to a mysterious underground labyrinth; the Underdeep. Now, in the Underdeep, the last remnants of humanity are scratching out a living and trying to rebuild a society, but are quickly discovering that evil has followed them beneath the surface.\r\n\r\nHeroes of Steel is a tactical turn-based RPG in which you lead a group of four unique characters, each with their own talents, special powers, and abilities on their quest through the world of Steel. Engage in tactical combat with the ferocious, devious, and magical enemies who threaten humanity's last settlements. You must decide how to develop each character’s individual strategy in order to build a powerful and dynamic team capable of triumphing over the impossible odds.\r\n\r\nSavor full character customization, deciding how to increase your attributes, skills, and powerful talents. Equip each of your characters with a variety of weapons, armor, and up to three mundane or magical accessories. As your party explores the dungeons, cities and crypts of the world, you will decide the overall strategy and approach your team takes. Choose between hundreds of levels of talents and thousands of combinations of equipment.\r\n\r\nWith full control of every turn and aspect of your four characters, you can plan every turn with exacting control. Heroes was made for fans of adventure RPGs, board games, and roguelikes. If you enjoy strategy games or tactical RPGs, you will enjoy this classic RPG.\r\n\r\n\r\n\r\n* IAPs Explained\r\nAll IAPs are permanent additions. Purchasing a Character ($1.99) allows you to add the character to any new group. All four episodes are unlocked. There are no consumable or repeat IAPs in this game.\r\n\r\n* Permissions Explained\r\n* android.permission.INTERNET is used to send crash reports online to the Trese Brothers allowing us to fix any crash. Crash reports are very small and are sent automatically.\r\n\r\n* android.permission.READ_EXTERNAL_STORAGE &amp; WRITE_EXTERNAL_STORAGE will enable FUTURE feature to import / export saved games for sharing.\r\n\r\n* com.android.vending.BILLING is used to purchase of Episodes or Characters. All IAPs are permanent, one time purchases.\r\n\r\n\r\nForum \nhttp://startradersrpg.proboards.com/board/33/heroes-steel-hs\r\n\r\nFB \nhttps://www. fb .com/HeroesOfSteelRpg\r\n\r\n* FB link not allow in the description\r\n\r\nTwitter\r\n\r\nPlease Leave a 5 Star Rating if you enjoy this game\r\n\r\nE-mail    for support\r\n\r\n\r\n\r\nWhat’s new:\r\n- Improved Auto-Glom to cover more cases\r\n- Fixed bug with delay and recentering when switching characters on the map\r\n- New Option: Auto-Glom consolidates group when traveling and loading games\r\n- Fixed issue with hero sometimes disappearing when going in and out of Glom\r\n- Fixed display issue with Sacrifice SP restore\r\n\r\nRequirements: Android OS 2.3 and up","torrent":{"xt":"urn:btih:650dbef1a7b30a15302e88fef7b10e228a883212","amp;dn":"Heroes+of+Steel+elite+v4.2.35+full+%5Bapkpita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"650dbef1a7b30a15302e88fef7b10e228a883212","infoHashBuffer":{"type":"Buffer","data":[101,13,190,241,167,179,10,21,48,46,136,254,247,177,14,34,138,136,50,18]},"announce":[],"urlList":[]}}