{"title":"Goo Goo Dolls Ft Avril Lavigne-Iris(Live)-Wushan.avi","uid":4858070,"size":105750676,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:664961f82dffc0da2c9d1ab13c26428deb646265&amp;dn=Goo+Goo+Dolls+Ft+Avril+Lavigne-Iris%28Live%29-Wushan.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wushan","files":1,"time":1240146860,"description":"                                      Iris.\n\n                             Single by Goo Goo Dolls\n\nfrom the album City of Angels: Music from the Motion Picture and Dizzy Up the Girl\n\n\n   &quot;Iris&quot; is a song by American alternative rock band the Goo Goo Dolls. Originally written for the soundtrack of 1998 film City of Angels, the song was later included on the band's sixth album Dizzy Up the Girl. The acoustic guitar in the song gives a distinctive sound as it is in an odd tuning, with 5 of the 6 strings tuned to D. This gives a ringing effect similar to a 12-string guitar. &quot;Iris&quot; has been one of the Goo Goo Dolls' most defining songs in terms of its contribution to the band's future success. It is the longest charting number one single in Billboard Hot 100 Airplay history with 18 consecutive weeks in the number one spot.\n\n\n  Upon its release, &quot;Iris&quot; became second of a string of hits from the film's soundtrack, City of Angels: Music from the Motion Picture. (The first was Alanis Morissette's &quot;Uninvited&quot; and the third was Sarah McLachlan's &quot;Angel.&quot;) On the U.S. Billboard Hot 100 the song peaked at number nine for five weeks, and it spent a record eighteen weeks at number one on the Hot 100 Airplay chart. It was not allowed to chart on the Billboard Hot 100 until after it had peaked (amazingly when it was allowed to chart &quot;Iris&quot; still cracked the top 10 at #9) because no commercial single had been released. &quot;Iris&quot; also peaked at #8 on the Billboard Mainstream Rock and #1 on the Billboard Modern Rock charts.\n\n  Besides the song's success on the charts, &quot;Iris&quot; enjoyed critical acclaim. At the 41st Grammy Awards, &quot;Iris&quot; received nominations for &quot;Record of the Year&quot; and &quot;Pop Performance by a Duo or Group.&quot; The song also garnered John Rzeznik a &quot;Song of the Year&quot; nomination.\n\n                               ***Iris.(Live).***\n\n                      (Goo Goo Dolls Ft Avril Lavigne)\n\n\n                                     Enjoy!!","torrent":{"xt":"urn:btih:664961f82dffc0da2c9d1ab13c26428deb646265","amp;dn":"Goo+Goo+Dolls+Ft+Avril+Lavigne-Iris%28Live%29-Wushan.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"664961f82dffc0da2c9d1ab13c26428deb646265","infoHashBuffer":{"type":"Buffer","data":[102,73,97,248,45,255,192,218,44,157,26,177,60,38,66,141,235,100,98,101]},"announce":[],"urlList":[]}}