{"title":"ArchBSD x86 x64 03052013 Linux","uid":8585175,"size":232566784,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:680c05a68bb4963f0c55ab665f8712d8c5d6ceb5&amp;dn=ArchBSD+x86+x64+03052013+Linux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jcksprw","files":-1,"time":1371511022,"description":" &lt;a href=&quot;http://www.archbsd.net/about/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.archbsd.net/about/&lt;/a&gt;\n\nA simple, lightweight distribution forked from ArchLinux\nWITHOUT systemd garbage!\n\nArch BSD, a lightweight and flexible BSDÂ® distribution that tries to Keep It Simple.\n\n Arch BSD is an independently developed, i686/x86-64 general purpose FreeBSD distribution versatile enough to suit any role. Development focuses on simplicity, minimalism, and code elegance. Arch is installed as a minimal base system, configured by the user upon which their own ideal environment is assembled by installing only what is required or desired for their unique purposes. GUI configuration utilities are not officially provided, and most system configuration is performed from the shell by editing simple text files. Arch strives to stay bleeding edge, and typically offers the latest stable versions of most software.\n\nArch BSD uses Arch BSD's Pacman package manager, which couples simple binary packages with an easy-to-use package build system. This allows users to easily manage and customize packages ranging from official Arch software to the user's own personal packages to packages from 3rd party sources. The repository system also allows users to easily build and maintain their own custom build scripts, packages, and repositories, encouraging community growth and contribution.\n\nThe minimal Arch base package set resides in the streamlined [core] repository. In addition, the official [extra], [community], and [testing] repositories provide several thousand high-quality, packages to meet your software demands. Arch also offers an [unsupported] section in the Arch BSD User Repository (AUR), which contains over 9,000 build scripts, for compiling installable packages from source using the Arch BSD makepkg application.\n\nArch BSD uses a &quot;rolling release&quot; system which allows one-time installation and perpetual software upgrades. It is not generally necessary to reinstall or upgrade your Arch BSD system from one &quot;version&quot; to the next. By issuing one command, an Arch system is kept up-to-date and on the bleeding edge.\n\nArch strives to keep its packages as close to the original upstream software as possible. Patches are applied only when necessary to ensure an application compiles and runs correctly with the other packages installed on an up-to-date Arch system.\n\nTo summarize: Arch BSD is a versatile, and simple distribution designed to fit the needs of the competent BSDÂ® user. It is both powerful and easy to manage, making it an ideal distro for servers and workstations. Take it in any direction you like. If you like this distro then get involved, and contribute to the community. Welcome to Arch! \n\n Brought to you by CaptainK","torrent":{"xt":"urn:btih:680c05a68bb4963f0c55ab665f8712d8c5d6ceb5","amp;dn":"ArchBSD+x86+x64+03052013+Linux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"680c05a68bb4963f0c55ab665f8712d8c5d6ceb5","infoHashBuffer":{"type":"Buffer","data":[104,12,5,166,139,180,150,63,12,85,171,102,95,135,18,216,197,214,206,181]},"announce":[],"urlList":[]}}