{"title":"Earth.Pilgrims.2009.avi-LOVEriot","uid":5724631,"size":640029968,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6851615fdfba4d58fb609c91c0de0fce59869d6b&amp;dn=Earth.Pilgrims.2009.avi-LOVEriot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robert012488","files":3,"time":1280416514,"description":"Ripinfo:\n\nvideo: MSmpeg4 800x600  768kbs\nSound: Stereo 160kbs\n\nWorks great in Windows Media Player. \n\n\nAbout:\n\nOn a planet in peril, in a world swamped with problems, how can we as individuals make a difference? How can we make the world a better place?&lt;P&gt; Earth Pilgrims is a spiritual adventure documentary  that journeys across four continents, beginning in the eastern Buddhist pilgrimage tradition, moving westwards across the old world through to the new. Featured are profound interviews with great thinkers and important figures including Graham Hancock, Satish Kumar, Nassim Haramein, Wade Davis and Peace Pilgrim  who share their own insights as to how the grand pilgrimage of life is affected by everything we do.&lt;P&gt; The underlying message of the film is that we cannot fix the world problems around us with external solutions because they do not work. But each of us is a part of the whole, and if we can work on ourselves to become more aware and productive people, then we are already making a difference in the world, and making it a better place.&lt;P&gt; To prove the point, the film climaxes at 16,000ft among 60,000 Quechua Indians making the annual Qoyllur Rit i pilgrimage of gratitude to water, and to the spirits and forces that surround and uphold them, leaving us with the insight that, as the Hopi say, we are the one s we ve been waiting for, and that if we just realise this and accept our burden, we can leap from the jaws of imminent destruction into a new era of human consciousness on this planet.&lt;P&gt; The Earth Pilgrims film crew had an ordeal of altitude sickness and headaches climbing to 16,000ft in order to capture this magnificent ceremony on film. However the harmony that emerged between us as outsiders and the 60,000 indigenous pilgrims astonished us all and we were greeted without a hint of discord or unwelcome. The sense was that the shamanic cactus ceremony undertaken in preparation for this pilgrimage had brought us into a mental and emotional space that the Quechua natives easily related to.","torrent":{"xt":"urn:btih:6851615fdfba4d58fb609c91c0de0fce59869d6b","amp;dn":"Earth.Pilgrims.2009.avi-LOVEriot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6851615fdfba4d58fb609c91c0de0fce59869d6b","infoHashBuffer":{"type":"Buffer","data":[104,81,97,95,223,186,77,88,251,96,156,145,192,222,15,206,89,134,157,107]},"announce":[],"urlList":[]}}