{"title":"Non Sequitur Comic Strip - PDF","uid":9252052,"size":69867861,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:69642824d865d7785f715e0ae06292bf5571650e&amp;dn=+Non+Sequitur+Comic+Strip+-+PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ZamKhan","files":-1,"time":1385481046,"description":"This is the famous Non Sequitur comic strip that I have compiled in a single pdf.\n\nNon Sequitur is Wiley Miller's wry look at the absurdities of everyday life. A hit with fans of all ages, the strip is syndicated in more than 700 newspapers. Non Sequitur has received four National Cartoonists Society divisional awards, the most prestigious in cartooning. It is the only comic strip to win the coveted award in its first year of syndication and the only one to ever win in both the best comic strip and best comic panel categories. \n\nThis hilarious creation is not only creative but also clever. It tackles current cultural issues such as politics, celebrities, male-female relations, materialistic desires and society's obsession with weight. Non Sequitur will have you laughing at the controversy of everyday life\n\nThis hugely popular cartoon is chock-full of witty observations on life's idiosyncrasies. Each strip or panel stands on its own individual merits. Strips do not follow in a sequence and are not related. Non Sequitur's characters are not central to the plot; the humor is.\n\nWiley gets ideas for Non Sequitur everywhere he goes. Readers can usually tell when he has (a) stayed in a hotel, (b) dealt with a lawyer or accountant, (c) shoveled snow, (d) visited a big city. &quot;Humor knows no bounds, and neither do my cartoons,&quot; he says. Above all else, Wiley considers the writing the most important part of a cartoon: &quot;We are conveying a thought, giving a perception. We are making a comment, not necessarily a big comment on a big issue -- but an observation. Cartoonists are essentially columnists; we perform exactly the same function, we just work in a different format.&quot;","torrent":{"xt":"urn:btih:69642824d865d7785f715e0ae06292bf5571650e","amp;dn":"+Non+Sequitur+Comic+Strip+-+PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69642824d865d7785f715e0ae06292bf5571650e","infoHashBuffer":{"type":"Buffer","data":[105,100,40,36,216,101,215,120,95,113,94,10,224,98,146,191,85,113,101,14]},"announce":[],"urlList":[]}}