{"title":"no exit Huis clos","uid":5255643,"size":325056511,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:69872e5c16558578401f89f8ba7f4893c7953da0&amp;dn=no+exit+Huis+clos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"saidm418","files":1,"time":1262540413,"description":"Jean-Paul Sartre=====================================================================================\n\nStarring Harold Pinter, Jane Arden and Catherine Woodville, this is Philip Saville's production of Stuart Gilbert's translation of Jean-Paul Sartre's 'Huis Clos'. Three people are sent to hell, which turns out not to be quite what they expected. As the reasons for their presence down below become apparent, so does the fact that they are going to torment each other for eternity, as hell is other people. As important as the writers, actors and director are, the camera work, courtesy of a crew led by Jim Atkinson, is years ahead of its time.\n=====================================================================================\n\nList of Characters\n\nVALET--is the brutally honest, nonchalant nephew of the head valet. He has paralyzed eyelids (never blinks), and he shows the sinners to their room of hell.\n\nJOSEPH GARCIN--was a middle-class, French &quot;pacifist&quot; journalist who ran from the war, was a drunk, had an affair, and was shot in the chest twelve times. Garcin is more the quiet type and he thinks a lot during the play. He also needs to convince Inez and Estelle that he's not a coward for running from the war.\n\nESTELLE RIGAULT--was an upper-class woman who married for money, had an affair with a younger, impoverished man. She had a child with this man, but she murdered the child, which indirectly caused her young lover to commit suicide. Estelle is rather close-minded and completely self-absorbed through the entire play.\n\nINEZ SERRANO--was a lower-class lesbian who, like a live coal, couldn't get on without making others suffer. She ran away with her cousin's widow but stifled her so much that her lover turned the gas stove on at night killing Inez and her lover both. Throughout the play she sees the truth very clearly, and whether polite or not, she verbalizes it.\n\nSummary\n\nPlace yourself within a relatively bare room from which you cannot escape with the two people you despise the most, and you have just placed yourself in the shoes of Sartre's characters, Garcin, Inez, and Estelle. This existential idea that &quot;Hell is other people&quot; (45) is the underlying theme throughout his 1944 play, No Exit.\n\n&quot;Where are the instruments of torture...the racks and red-hot pincers and all the other paraphernalia?&quot; Garcin asks when he is shown his room (4). It is a common question among all three characters. However, Sartre's hell is but a drawing room with no torture devices, fire, or grusome figures as in Dante's Inferno. The room has limited props, ugly furniture, and is continuously illuminated. When Garcin recognizes that the valet doesn't even blink, and that there is no use for sleep in this hell, he realizes that hell is &quot;life without a break&quot; (5).\n\nInez and Estelle join Garcin in hell and while gradually being introduced to one another's quirks, they begin to realize that &quot;each one of [them] will act as a torturer of the two others&quot; (17). So, as a solution, they try to completely ignore each other's presense in the room. However, this doesn't work, and they decide that they should stop posing for each other, and lay their stories of how they got there out in the open. Garcin believes that this &quot;may save [them] from disaster&quot; (23).\n\nThroughout the play, there is a series of battles between each of the characters. At first, Inez and Estelle fail to ignore each other and begin to talk. They, then, gang up on Garcin who is still trying to ignore them, to get him to talk. Then, Garcin and Inez, after sharing their stories, gang up on Estelle to tell her story, truthfully. Eventually, Estelle and Garcin make blatant but crude advances towards one another offending and &quot;torturing&quot; Inez with jealousy and anger. While these small battles were all two-against-one, the next battle was with each one individually. They all wanted one of the others to give them trust, pity, or love. When neither of them was satisfied, they came together as one realizing that they were in this forever.\n\nEach character ceases to exist when those people that they left behind stop thinking or talking about them. This is another strong existentialist idea that Sartre incorporates into his work. When people from the character's formal life forget about them, Garcin, Inez, and Estelle have no more connection with the living. Inez loses her connection when a couple makes love in her old bedroom. Estelle loses her connection when her bosom friend, Olga, dances with Estelle's ex-boyfriend, Peter, and tells him of her affair and the baby she killed. Garcin lasts the longest among the living through people talking about him, but these voices fade and he also loses all connection with his former life.\n\nFor a moment Garcin demands the door to be opened because he would rather deal with anything other than Sartre's &quot;agony of the mind&quot; (41). However, when he finally wills the door open, he chooses to stay because he realizes that he doesn't exist anywhere else. He stays because he needs Inez and Estelle to continue to exist and because Inez understands his position as a &quot;coward.&quot; He says to Inez, &quot;You...know what it means to be a coward...and what wickedness is, and shame, and fear&quot; (42). He has a need to convince Inez that he is not a coward and that if she has faith in him, he'll be saved.\n\nIn the end, they realize that they have forever together and more or less accept that fact. My personal opinion of Sartre's No Exit, is a good one. Despite my disagreement with his philosophy, Sartre is a creative, intelligent author and a thoughtful philosopher. I really enjoyed Huis Clos and would recommend it to anyone who likes to try something different.","torrent":{"xt":"urn:btih:69872e5c16558578401f89f8ba7f4893c7953da0","amp;dn":"no+exit+Huis+clos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69872e5c16558578401f89f8ba7f4893c7953da0","infoHashBuffer":{"type":"Buffer","data":[105,135,46,92,22,85,133,120,64,31,137,248,186,127,72,147,199,149,61,160]},"announce":[],"urlList":[]}}