{"title":"Democracy Now - 16 nov 2011","uid":6822871,"size":459496800,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:69c35809e5731af6bde26408e31be9c31e3b636a&amp;dn=Democracy+Now+-+16+nov+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1321462467,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 16, 2011\n\n-  OWS Protesters Re-Claim Park; Camping Gear Banned\n-  Over 200 Arrested in OWS Raid of Zuccotti Park\n-  Occupy Protesters Rally at UC-Berkeley; SF Police Surround Encampment\n-  London Resumes Actions to Expel Occupy Protesters\n-  TransCanada Agrees to Re-Route Tar Sands Oil Pipeline\n-  Syrian Defectors Attack Army Site\n-  U.N.: Sharp Rise in Settler Attacks on Palestinians\n-  Panetta, McCain Spar on Iraq Withdrawal\n-  Gingrich Collected Large Fees from Freddie Mac\n-  Public Health Expert Dr. Paul Epstein Dies at 67\n\n\nSpecial reports\n\n- Occupy Wall Street Protesters Return to Zuccotti Park After 200 Arrested, Camping Barred\n\nThousands of defiant Occupy Wall Street protesters streamed into Zuccotti Park late Tuesday less than 24 hours after police forcibly removed them from their camp. Police arrested more than 200 people, including about a dozen who had chained themselves to each other and to trees. As protesters returned, a judge upheld the city's ban preventing them from bringing backpacks, tents and sleeping bags with them into the park. Democracy Now! spoke with protesters as they regrouped after the raid. &quot;The reason I'm down here is because I'm tired of seeing suffering of so many people while you have 1 percent who is accumulating all this wealth on the backs of all the workers,&quot; says Ray Lewis, a retired police captain from the Philadelphia Police Department. He critiques his colleagues for &quot;basically just enforcing the laws of the dictators, which is the 1 percent. They're having their healthcare cut, their pensions cut, and their salaries reduced. And they don't even realize it.&quot;\n\n\n- As Occupy Enters Third Month, A Look at How Protesters Are Building a Global Movement\n\nAs the Occupy movement approaches its two-month anniversary, we're joined by two guests who are studying its strategies and successes. Author Jeff Sharlet helped found the group, Occupy Writers, and is assisting efforts to reestablish the evicted library at Occupy Wall Street. His recent article for Rolling Stone is &quot;Inside Occupy Wall Street: How a bunch of anarchists and radicals with nothing but sleeping bags launched a nationwide movement.&quot; We also speak with Marin Sitrin, who is researching global mass movements from Spain to Egypt, and has just returned from Greece. Sitrin says the Occupy movement's assemblies offer a &quot;radical, if not revolutionary, way of organizing ... When we're in our neighborhoods, and come together and relate in that way, it's more like alternative governance.&quot;\n\n\n- Police Crackdowns on Occupy Protests From Oakland to New York Herald &quot;The New Military Urbanism&quot;\n\nAfter a wave of raids across the country in which police in riot gear broke up Occupy Wall Street encampments and arrested protesters, Oakland Mayor Jean Quan acknowledged in an interview with the BBC that she participated in a conference call with officials from 18 cities about how to deal with the Occupy movement. As police forces violently crack down on protests across the United States and Europe, we look at the increasing influence of military technology on domestic police forces. Stephen Graham is professor of Cities and Society at Newcastle University in the U.K. His book is, &quot;Cities Under Siege: The New Military Urbanism.&quot; &quot;Why the Occupy movement is so powerful, what it's demonstrating, is that by occupying public spaces around the world - and particularly these extremely symbolic public spaces - it's reasserting that the city is the foundation space for democracy,&quot; Graham says.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:69c35809e5731af6bde26408e31be9c31e3b636a","amp;dn":"Democracy+Now+-+16+nov+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69c35809e5731af6bde26408e31be9c31e3b636a","infoHashBuffer":{"type":"Buffer","data":[105,195,88,9,229,115,26,246,189,226,100,8,227,27,233,195,30,59,99,106]},"announce":[],"urlList":[]}}