{"title":"George R.R. Martin - Het Lied van IJs en Vuur - Een Feestmaal vo","uid":6794967,"size":928814,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a448457da5a1225e9c7f1709c9300b585c1bb14&amp;dn=George+R.R.+Martin+-+Het+Lied+van+IJs+en+Vuur+-+Een+Feestmaal+vo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"linday1","files":-1,"time":1320411672,"description":"Een feestmaal voor kraaien\n\nEen feestmaal voor kraaien (oorspronkelijke titel: A Feast for Crows) is het vierde deel in de epische fantasyserie Een lied van IJs en Vuur van de Amerikaanse schrijver George R.R. Martin. Het verscheen voor het eerst in de Verenigde Staten in 2005 en werd wereldwijd positief onthaald.\n \nEen Feestmaal voor Kraaien is het eerste boek in de serie dat debuteerde als nummer ÃƒÂ©ÃƒÂ©n op de New York Times bestsellerslijst, iets dat alleen Robert Jordan en Neil Gaiman hem als fantasy-schrijvers voordeden. In 2006 werd het boek genomineerd voor een Hugo Award, de Locus Award en de British Fantasy Society Award.\n \nPlot\n \nEr komt een einde aan de Oorlog van de Vijf Koningen. Robb Stark, Joffrey Baratheon, Renly Baratheon en Balon Greyjoy zijn allemaal dood, en koning Stannis Baratheon is naar de andere kant van de Muur gereisd, waar Jon Sneeuw tot de nieuwe commandant van de Nachtwacht is gepromoveerd. Koning Tommen Baratheon, Joffrey's acht jaar oude broer, heerst nu over Koningslanding; zijn moeder, Cersei Lannister, houdt hem in de gaten. Cersei's vader Tywin is dood, vermoord door zijn zoon Tyrion, die de stad is ontvlucht. Met de beide mannen uit de weg zijn er geen lastposten meer voor Cersei over en grijpt ze naar de macht. Ondertussen verbergt Sansa Stark zich nog steeds in de Vale, beschermd door Petyr Baelish, die zijn vrouw Lysa Arryn in het geheim heeft vermoord en zichzelf Beschermer van de Vale noemt en beschermheer van de acht jaar oude Lord Robert Arryn.\n\nNLT-RELEASE IS TERUG KOM SNEL NAAR DE SITE:\n &lt;a href=&quot;\nhttp://www.nlt-release.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt-release.nl&lt;/a&gt;\n\nBy Linday","torrent":{"xt":"urn:btih:6a448457da5a1225e9c7f1709c9300b585c1bb14","amp;dn":"George+R.R.+Martin+-+Het+Lied+van+IJs+en+Vuur+-+Een+Feestmaal+vo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a448457da5a1225e9c7f1709c9300b585c1bb14","infoHashBuffer":{"type":"Buffer","data":[106,68,132,87,218,90,18,37,233,199,241,112,156,147,0,181,133,193,187,20]},"announce":[],"urlList":[]}}