{"title":"Utada Hikaru - Beautiful World, Kiss &amp; Cry [FLAC]","uid":8078039,"size":198816795,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6b6f58c72a5f749a2d64d1ae65f9f36d284957ec&amp;dn=Utada+Hikaru+-+Beautiful+World%2C+Kiss+%26amp%3B+Cry+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brmartins","files":-1,"time":1359427559,"description":"Utada Hikaru - Beautiful World, Kiss &amp; Cry [FLAC]\n\n\n1. \t&quot;Beautiful World&quot;   \t5:18\n2. \t&quot;Kiss &amp; Cry&quot;   \t5:06\n3. \t&quot;Fly Me to the Moon (In Other Words) -2007 Mix-&quot;   \t3:24\n4. \t&quot;Beautiful World (Original Karaoke)&quot;   \t5:15\n5. \t&quot;Kiss &amp; Cry (Original Karaoke)&quot;   \t5:08\n6. \t&quot;Fly Me to the Moon (In Other Words) -2007 Mix- (Original Karaoke)&quot; \n\n \n\n&quot;Beautiful World/Kiss &amp; Cry&quot; is Utada Hikaru's 19th Japanese single (26th single overall). The single was released on August 29, 2007 as her second single for 2007. &quot;Beautiful World&quot; was re-released in 2009 as &quot;Beautiful World (Planitb Acoustica Mix)&quot; for the release of the movie Evangelion: 2.0 You Can (Not) Advance.\n\nBeautiful World / Kiss &amp; Cry includes 3 new songs. The title track, &quot;Beautiful World&quot;, is being used as the theme song for the first installment of the Rebuild of Evangelion movies, and a new 2007 remix of &quot;Fly Me to the Moon&quot;, also included on the single, will be featured in the trailers of the movie. &quot;Kiss &amp; Cry&quot;, the second A-side of the single, was featured as the new &quot;Freedom Cup Noodles&quot; commercial tie-in song.[2]\n\nOn July 14, 2007 Utada released a preview of &quot;Beautiful World&quot; along with the single's cover. There is now a PV available for public interest for &quot;Kiss &amp; Cry&quot;, made up of screenshots of characters from the Freedom Project anime lip-synching to the song. So far, it has received negative reactions from her fans, most likely and reportedly since the PV doesn't feature Utada indefinitely in any fashion. Her Japanese site did publish a magazine schedule that would be posting advertisements promoting this new single throughout August and September on July 30, and a TV schedule of performances on August 1. On August 7, a radio promotion schedule for the single, mainly of prerecorded clips that will air throughout Japan, was also added to her Japanese website.\n\nAs a follow-up to &quot;Flavor of Life&quot;'s blog, EMI has created another website with clips of the PVs of &quot;Beautiful World&quot; and &quot;Kiss &amp; Cry&quot; that can be pasted onto blogs. These clips will last until mid-September.\n\nThe single debuted at #3 with first week sales of 94,000, making this single a relatively strong success for Hikaru on the Oricon Singles chart. On the World Charts, the single garnered 75,000 points and peaked at position 27.\n","torrent":{"xt":"urn:btih:6b6f58c72a5f749a2d64d1ae65f9f36d284957ec","amp;dn":"Utada+Hikaru+-+Beautiful+World%2C+Kiss+%26amp%3B+Cry+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b6f58c72a5f749a2d64d1ae65f9f36d284957ec","infoHashBuffer":{"type":"Buffer","data":[107,111,88,199,42,95,116,154,45,100,209,174,101,249,243,109,40,73,87,236]},"announce":[],"urlList":[]}}