{"title":"Mama Sissoko - Soleil de minuit [FLAC] TQMP","uid":6799059,"size":320618298,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6b7833c983a1f6334497580cb3a1ac1ca20d3fa2&amp;dn=Mama+Sissoko+-+Soleil+de+minuit+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pastafari","files":-1,"time":1320589650,"description":"Mama Sissoko - Soleil de minuit\n1999\n\n* * * * * * * * * * * * * * * * * * *\n\nDespite its intensely percussive nature, this second solo release by Malian guitarist and Super Biton de Segou veteran Mama Sissoko is a guitar and vocal recording. And despite the use of electric guitars, lots of electric guitars, an earthy atmosphere is retained throughout. Production surmounts the challenge of so much happening at once, separating and layering without compromising the interwoven unity of the sound. And, though they might suffer from comparison to Baaba Maal's for example, Sissoko's vocals, deep, dark, and resonant, are compelling in their own fashion.\n\nSoleil de Minuit starts with &quot;Jaabi Muso,&quot; a quick shuffle enlivened by the busy percussive backing of multiple guitars; short, repeated staccato phrases offer a caffeinated musical substrate for Sissoko's deep, strong vocal. His guitar solos and ornamentations ring in that plunky sound emanating from the center pickup of an electric guitar and seem regally restrained in their refusal to sacrifice melodic coherence for flash. A more traditional Malian rhythm, featuring a dense thicket of guitar and bass figures over a swinging beat, emerges in &quot;Boma Ma.&quot; The vocal refrain is comparatively simple, but the harmonies between Sissoko and Toussainte SianÃƒÂ© enchant and anchor the more improvisational verses.\n\n&quot;Safiatou&quot; brings a startling rhythmic change, an unsyncopated common-time cumbia presided over by a calm snare rim-tap, a fine platform for Sissoko's guitar, restrained, tasteful, and retentive of long, coherent melodic figures in which precise timing trumps speed. The title track is a bouncy Cuban-style salsa, distinguished by Sissoko's and SianÃƒÂ©'s vocals, its rapidly picked guitar background seeming to regress into infinite sonic depths, its movement amplified by Richard Haas' inventively peripatetic bass, featured on the break. Other high-points include &quot;Manssane Cisse,&quot; its simple two-chord background incrementally constructed from tightly coordinated guitar and bass figures around polyrhythmic triplets infiltrating common time, static and dynamic at once, and &quot;Fisiriwale,&quot; a slow lope featuring especially tight bass-guitar interaction prefiguring a vocal refrain delivered in two-part harmony.\n\nTradition or pop? With a recording as engaging, intricate, and pleasing as Soleil de Minuit, the distinction loses cogency; listen to Mama Sissoko create tomorrow's tradition today.\n- RootsWorld\n\n* * * * * * * * * * * * * * * * * * *\n\nTrack List\n 01 - Jarabi Muso\n 02 - Boma ma\n 03 - Safiaton\n 04 - Manssane Cisse\n 05 - Soleil de minuit\n 06 - Iri\n 07 - Fisirivale\n 08 - Namissa\n 09 - Commissariat\n 10 - Hommage a K.\n\n* * * * * * * * * * * * * * * * * * *\n\nArtwork, EAC log and CUE sheet included.\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt;\n\nPastafari &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nTQMP. The Quality Music Project.","torrent":{"xt":"urn:btih:6b7833c983a1f6334497580cb3a1ac1ca20d3fa2","amp;dn":"Mama+Sissoko+-+Soleil+de+minuit+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b7833c983a1f6334497580cb3a1ac1ca20d3fa2","infoHashBuffer":{"type":"Buffer","data":[107,120,51,201,131,161,246,51,68,151,88,12,179,161,172,28,162,13,63,162]},"announce":[],"urlList":[]}}