{"title":"Hatfield And The North - The Rotters' Club (UK Prog-Canterbury","uid":3306963,"size":156937827,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6b8ea13dc39f31dc558102f8ac8bec112746a281&amp;dn=Hatfield+And+The+North+-+The+Rotters%5C%27+Club+%28UK+Prog-Canterbury+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kome","files":20,"time":1111848823,"description":"Artist: Hatfield And The North\nAlbum: The Rotters' Club\nGenre: Progressive rock - Canterbury\nYear: 1975\n\nEcoder: iTunes v4.7.1\nBitRate: 320 kbps\nVBR: OFF\nFrequency: 44100 kHz\nChannels: Stereo\nStereo Mode: Joint Stereo\nSmart Encoding Adjustments: OFF\nFilter Frequencies Below 10 Hz: ON\n\nEncoded by kome.\n\nThis second and final album by Canterbury supergroup (is there any other kind?) Hatfield And The North allowed the lads to retire as undefeated champions of the genre. The only mark against them might be that other groups had invented this sort of music first, but of course Richard Sinclair (lead vocals/bass), Phil Miller (guitar), Dave Stewart (keyboards) and Pip Pyle (drums) had all been parts of those seminal groups like Caravan, Gong and Egg before they formed Hatfield And The North.\nThe Rotter's Club takes off pretty much where the debut left off, except that instead of drawing a listener in with clever sound effects, the group takes off at full throttle. The one-two opening combination of Share It and Lounging There Trying establishes that the group's collective fire (and ice-cold &amp;quot;cool&amp;quot; when it is called for) burns as brightly as ever. The same formula of short jazzy ditties (the subtly heart-breaking Didn't Matter Anyway and the afore-mentioned first two tracks), sound-effect pieces ((Big) John Wayne Socks Psychology On The Jaw) and storming jazz-rock epics (The Yes No Interlude and the full version of Fitter Stoke Has A Bath) is repeated to equal effect. Incidentally, Halfway Between Heaven And Earth and Oh Len's Nature! may be bonus tracks but they certainly add to the quality and feel of the overall album\nAnd then there's the real bonus of Mumps. A 20 minute, four part humdinger of a song that startly slowly (and dwells for a little while in the Land of Pointless Noodling) before exploding into a masterly exhibition of musicianship and composition. As with the first album Dave Stewart is perhaps the most ear-catching of the quartet, but Miller runs him pretty close at times.\nThe guest musicians on this occassion include flautist Jimmy Hastings, Egg's Mont Campbell on French Horn and the Henry Cow duo of Tim Hodgkinson on clarinet and Lindsay Cooper on oboe and bassoon as well as a trio of female backing vocalists that include Amanda Parsons (who also sang on the first album). Hastings in particular adds colours to this album that weren't present on its predecessor.\n\nIf you like this album, remember to buy it.\n\nP.S.: You can also download Hatfield And The North's first album here: http://trackerwww.prq.to/torrents-details.php?id=3306495","torrent":{"xt":"urn:btih:6b8ea13dc39f31dc558102f8ac8bec112746a281","amp;dn":"Hatfield+And+The+North+-+The+Rotters%5C%27+Club+%28UK+Prog-Canterbury+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b8ea13dc39f31dc558102f8ac8bec112746a281","infoHashBuffer":{"type":"Buffer","data":[107,142,161,61,195,159,49,220,85,129,2,248,172,139,236,17,39,70,162,129]},"announce":[],"urlList":[]}}