{"title":"Luna Park (Vertigo) [GN]","uid":8768219,"size":160919045,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6ba70ad34997f6570c6e33ffcdd0f7c91c0579d1&amp;dn=Luna+Park+%28Vertigo%29+%5BGN%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RobbieDee","files":-1,"time":1375384413,"description":"- Contains the Luna Park graphic novel by author Kevin Baker. Published by Vertigo.\n\nGenre: Crime/Thriller\n\n- A CBR/CBZ viewer will be needed in order to view this content, which can be found here: https://thepiratebay.se/torrent/8689374/CDisplayEx_Version_1.9.9_Comic_Book_Reader_for_Windows_x86_x64\n\n**I don't own or take credit for any of the content contained in this torrent, all credit goes to the creator(s) of the comic.**\n\n\nDescription:\n\n New York Times bestselling author Kevin Baker (Dreamland) writes his first original graphic novel, with internationally acclaimed artist Danijel Zezelj. \n\nAlik Strelnikov lives in the shadow of Coney Island, a world of silenced rides and rusting amusement parks that mock his dreams of becoming a hero. Ten years ago, he traded a brutal existence in the Russian army for the promise of America only to become an enforcer in the Brooklyn mob. Now, he chases his ghosts with all he has left: booze, heroin and his lover, Marina, part-time prostitute and full-time fortune teller. The only way the two of them can escape their miserable fates hinges on a desperate plan that will put them between warring mobs and span a century, from contemporary Coney Island to the Russia of the Second Chechen War to spellbinding 1910s New York. \n\nMixing historical novel, immigrant fiction and crime thriller, LUNA PARK marks Kevin Baker's return to Coney Island, the setting of his critically beloved Dreamland and features breathtaking art by Danijel Zezelj (LOVELESS) with to-die-for colors by Dave Stewart (DC: THE NEW FRONTIER).","torrent":{"xt":"urn:btih:6ba70ad34997f6570c6e33ffcdd0f7c91c0579d1","amp;dn":"Luna+Park+%28Vertigo%29+%5BGN%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ba70ad34997f6570c6e33ffcdd0f7c91c0579d1","infoHashBuffer":{"type":"Buffer","data":[107,167,10,211,73,151,246,87,12,110,51,255,205,208,247,201,28,5,121,209]},"announce":[],"urlList":[]}}