{"title":"Jeremy Fink and The Meaning of Life - Wendy Mass","uid":9233628,"size":959522,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c436318bbb613328fef3a327aacc47ad25db790&amp;dn=Jeremy+Fink+and+The+Meaning+of+Life+-+Wendy+Mass&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1385128891,"description":"In one month Jeremy Fink will turn thirteen. But does he have what it takes to be a teenager? He collects mutant candy, he won't venture more than four blocks from his apartment if he can help it, and he definitely doesn't like surprises. On the other hand, his best friend, Lizzy, isn't afraid of anything, even if that might get her into trouble now and then.\n\nJeremy's summer takes an unexpected turn when a mysterious wooden box arrives in the mail. According to the writing on the box, it holds the meaning of life! Jeremy is supposed to open it on his thirteenth birthday. The problem is, the keys are missing, and the box is made so that only the keys will open it without destroying what's inside. Jeremy and Lizzy set off to find the keys, but when one of their efforts goes very wrong, Jeremy starts to lose hope that he'll ever be able to open the box. But he soon discovers that when you're meeting people named Oswald Oswald and using a private limo to deliver unusual objects to strangers all over the city, there might be other ways of finding out the meaning of life.\n\nLively characters, surprising twists, and thought-provoking ideas make Wendy Mass's latest novel an unforgettable read.","torrent":{"xt":"urn:btih:6c436318bbb613328fef3a327aacc47ad25db790","amp;dn":"Jeremy+Fink+and+The+Meaning+of+Life+-+Wendy+Mass","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c436318bbb613328fef3a327aacc47ad25db790","infoHashBuffer":{"type":"Buffer","data":[108,67,99,24,187,182,19,50,143,239,58,50,122,172,196,122,210,93,183,144]},"announce":[],"urlList":[]}}