{"title":"Letters from Prison - Voices of Women Murderers (2001) (248p) [I","uid":11600600,"size":1139052,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c5c5ebacc5b0237cac5c141a5e32bc88ecf4f3a&amp;dn=Letters+from+Prison+-+Voices+of+Women+Murderers+%282001%29+%28248p%29+%5BI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Inua1","files":1,"time":1417338918,"description":"Title: Letters From Prison, Voices of Women Murderers \nAuthor: Jennifer Furio\nPaperback: 248 pages\nPublisher: Algora Publishing (December 2, 2001)\nLanguage: English\nISBN-10: 1892941597\nISBN-13: 978-1892941596\n\nLetters from Prison: Voices of Women Murderers, is a first-ever compilation of letters solicited through direct correspondence with women who have been condemned for murder. In the women's own words, they detail their backgrounds and what drove them to their crimes, and they comment on their current mindsets. The women's stories shed light on the common traits - and the profound differences - that may exist between female perpetrators. Each woman offers a different perspective, but most shared shockingly difficult childhoods, filled sadly with neglect, sexual abuse, and drug addictions. The words of these women haunt and transfix even the most skeptical reader. In the end, the reader will find it impossible to deny the &quot;human character&quot; of these condemned women.\n\nThese unsettling communications between prison-reform activist Furio and incarcerated women convicted of murder form the sequel to her The Serial Kill Letters. Here Furio emphasizes &quot;the importance of mitigation... when discussing people who kill.&quot; She went to great lengths to establish epistolary relationships with 13 convicts, whose letters generally exude a desperate need for understanding; Furio's compassion obviously brings comfort during long, harsh incarcerations. In biographical essays, Furio explores the terrible abuse (often overlooked in court) that drove them to kill. For example, in the case of Brenda Spencer, who as a teenager killed and wounded several people by gunshot at an elementary school in 1979, Furio deems it a flawed attempt at &quot;suicide by cop&quot; following years of molestation by her father, to which her school turned a blind eye. A chilling chapter concerns Christina Riggs, executed in 2000 at 18 for killing her two children (she botched her suicide attempt), described by Furio as &quot;maternal filicide... to provide them with a safety in death that she... cannot provide them in life.&quot; Passages like Riggs's heartbreaking, poetic last letter to Furio are thought-provoking, and bolster Furio's empathy campaign. Yet her correspondents often show an incomplete recognition of the havoc they caused, while the overly cheerful Furio's ingratiation sometimes approaches parody. These elements will win Furio few admirers among victims' rights proponents, or &quot;law and order&quot; types. That said, her anthology richer and deeper than Carol Anne Davis's Women Who Kill (Forecasts, May 21) confronts us with the humanity of those we condemn. (June)Forecast: Court TV is planning a series based on this and Furio's earlier book, but this one is not likely to sell much beyond the small group of forensic psychologists and other crime-related professional","torrent":{"xt":"urn:btih:6c5c5ebacc5b0237cac5c141a5e32bc88ecf4f3a","amp;dn":"Letters+from+Prison+-+Voices+of+Women+Murderers+%282001%29+%28248p%29+%5BI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c5c5ebacc5b0237cac5c141a5e32bc88ecf4f3a","infoHashBuffer":{"type":"Buffer","data":[108,92,94,186,204,91,2,55,202,197,193,65,165,227,43,200,142,207,79,58]},"announce":[],"urlList":[]}}