{"title":"The Magic of Mathematics: Discovering the Spell of Mathematics","uid":8363736,"size":8609682,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c5cf9b13a2156224c85e77799afd067b99b7af5&amp;dn=The+Magic+of+Mathematics%3A+Discovering+the+Spell+of+Mathematics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365708035,"description":" Theoni Pappas, &quot;The Magic of Mathematics: Discovering the Spell of Mathematics&quot;\n1994 | ISBN: 0933174993 | 336 pages | DJVU\n\nThe author of The Joy of Mathematics explores the mathematics of nature, literature and art. This fascinating look at the surprising ways mathematics influences the everyday world takes an abstract universe and anchors it to the &quot;real&quot; worlds of science, history and the arts in an intriguing way. Photos and line drawings.\n\nFrom Library Journal\nThe essays in this third volume of mathematical mini-essays by the author of The Joy of Mathematics (Wide World Pub./Tetra, 1989) and More Joy of Mathematics (Wide World Pub./Tetra, 1991) are for the general reader, requiring little mathematical background. They range broadly over mathematical themes in art, architecture, music, games, and everyday technology, encompassing history, new discoveries, applications, and recreations. Though the choice of subjects is haphazard, and each essay barely skims the surface, the book is fun to browse. Ideas are tossed out and discussed one after another with just enough details to keep things interesting. There are many illustrations and few equations. Thought-provoking yet not overwhelming, this book makes the author's pleasure in mathematics evident. Recommended for young adults and older.\nAmy Brunvand, Fort Lewis","torrent":{"xt":"urn:btih:6c5cf9b13a2156224c85e77799afd067b99b7af5","amp;dn":"The+Magic+of+Mathematics%3A+Discovering+the+Spell+of+Mathematics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c5cf9b13a2156224c85e77799afd067b99b7af5","infoHashBuffer":{"type":"Buffer","data":[108,92,249,177,58,33,86,34,76,133,231,119,153,175,208,103,185,155,122,245]},"announce":[],"urlList":[]}}