{"title":"HTML5 iPhone Web Application Development { UPPOG2 } Torrents","uid":9234388,"size":24015726,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d0c9012abbab98f43721ecc2bb2eb33673a09e8&amp;dn=HTML5+iPhone+Web+Application+Development+%7B+UPPOG2+%7D+Torrents&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookgeeks","files":3,"time":1385143020,"description":"HTML5 iPhone Web Application Development { UPPOG2 } Torrents\n\n\nWhat this book covers\n\n\nChapter 1, Application Architecture, helps you to learn how to create a standard\narchitecture for iPhone web application development. We will customize the\nstandard HTML5 Mobile Boilerplate for our needs throughout the book.\n\nChapter 2, Integrating HTML5 Video, helps you to learn the basics of implementing\nan HTML5 video player within your web application. We'll review the specification\nand implement an exposed API to tap into.\n\nChapter 3, HTML5 Audio, explains an implementation of the HTML5 Audio API.\nWe'll create an audio player that utilizes the same principles from Chapter 2 to\ncreate a reusable component.\n\nChapter 4, Touch and Gestures, helps you to learn about touch and gesture events,\nincluding the similarities and differences. We'll go over a couple of examples and\nmore importantly, the specification to properly integrate our application's\nuser experience.\n\nChapter 5, Understanding HTML5 Forms, explains the new features in HTML5 forms,\nultimately understanding its uses for our iOS web applications. We'll review the new\ninputs, their interactions, and the behaviors expected from the iOS operating system.\n\nChapter 6, Location-aware Applications, will have Geolocation as the key point, from the\nspecification to the full implementation in the Safari iOS browser. We'll create\nan example that utilizes this feature and demonstrate how we can utilize it in our\nown applications.\n\nChapter 7, One-page Applications, is jam-packed with information on how to create\na seamless experience in your application. We'll go over the principles of the MVC\ndesign pattern and create an example that utilizes its full potential.\n\nChapter 8, Offline Applications, will cover key topics such as Caching, History, and\nlocal storage. The essentials will be covered and the details exposed in order for us\nto create true offline applications.\n\nChapter 9, Principles of Clean and Optimized Code, will have us sidestepping the\ndevelopment process to refine our craftsmanship. We'll go over best practices,\nindustry supported techniques, and ways to improve our code for the overall\nbenefit of our applications.\n\nChapter 10, Creating a Native iPhone Web Application, reviews how we can create\nthe native application we have learned previously. Applying the same techniques\nwe'll create native applications based on open standards.\n\nBook Details :\n\nTitle : HTML5 iPhone Web Application Development\nPages : 338\nFormat : pdf\nSize : 24 Mb\nLanguage : English\n\n\n\n","torrent":{"xt":"urn:btih:6d0c9012abbab98f43721ecc2bb2eb33673a09e8","amp;dn":"HTML5+iPhone+Web+Application+Development+%7B+UPPOG2+%7D+Torrents","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d0c9012abbab98f43721ecc2bb2eb33673a09e8","infoHashBuffer":{"type":"Buffer","data":[109,12,144,18,171,186,185,143,67,114,30,204,43,178,235,51,103,58,9,232]},"announce":[],"urlList":[]}}