{"title":"Lawson Vampire 1-4 by Jon F. Merz","uid":8842454,"size":1839873,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d220a174ba0981e22eee6569bd5b8cae1d35c58&amp;dn=Lawson+Vampire+1-4+by+Jon+F.+Merz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":4,"time":1377283275,"description":"The Fixer\nMeet Lawson: vampire by birth, Fixer by trade. His mission: preserve the secret existence of vampires by any means necessary. There's just one problem - his oldest enemy Cosgrove is back, killing humans and threatening to unleash an ancient unholy evil. Can Lawson stop Cosgrove and still adhere to the very laws he protects by not falling in love with a beautiful human assassin named Talya?\n\nThe Invoker\nIn The Invoker, a case of mistaken identity lands Lawson in the role of protector for a young boy with the power to conjure the spirits of dead vampires. But a power-hungry member of the vampire governing body, the Council, wants that power for herself and she'll do anything to get it - even if it means hiring an ex-Fixer named Petrov to kidnap the boy. From the blood-slicked streets of Boston to the skyscraping Himalayas, Lawson will need to call in every favor and on every friend if he hopes to ever see Jack alive again.\n\nThe Destructor\nThey call her Shiva after the Hindu god of destruction. Part-vampire and part-lycanthrope, her ability to change her appearance at will makes her one of the most feared assassins on the planet. Now Shiva is coming to Boston to assassinate the leader of the vampire governing body, the Council. And there's only one Fixer alive who can stop her: Lawson. But is Shiva really just coming to Boston to take down a target? or is her mission something far more sinister?\n\nThe Syndicate\nA missing family member sends Lawson on a trip to New York City only to run smack into vampire organized crime. Now they've got Lawson right where they want him - and they want him to switch sides and betray the Balance. But Lawson's got more than one play in his book, and if he has to go to the wall to rescue his cousin and stop the Syndicate from unleashing a new synthetic drug on the masses, then that's just what he'll do. And god help anyone who tries to stop him...","torrent":{"xt":"urn:btih:6d220a174ba0981e22eee6569bd5b8cae1d35c58","amp;dn":"Lawson+Vampire+1-4+by+Jon+F.+Merz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d220a174ba0981e22eee6569bd5b8cae1d35c58","infoHashBuffer":{"type":"Buffer","data":[109,34,10,23,75,160,152,30,34,238,230,86,155,213,184,202,225,211,92,88]},"announce":[],"urlList":[]}}