{"title":"Last Year At Marienbad (1961) Criterion 1080p x264 DTS-SARTRE","uid":14394069,"size":6150427645,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:6ea91033e4fecf522ef6f9fee04b2e7fbe0482cd&amp;dn=Last+Year+At+Marienbad+%281961%29+Criterion+1080p+x264+DTS-SARTRE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sartre7","files":24,"time":1461328801,"description":"A cinematic puzzle, Alain Resnais' Last Year at Marienbad is a radical exploration of the formal possibilities of film. Beautifully shot in Cinemascope by Sacha Vierny, the movie is a riddle of seduction, a mercurial enigma darting between a present and past which may not even exist, let alone converge. The film stars Giorgio Albertazzi as an unnamed sophisticate attempting to convince a similarly nameless woman (Delphine Seyrig) that they met and were romantically involved a year ago in the same enormous, baroque European hotel. In the end, it hardly matters -- they're not characters so much as pawns anyway. Hypnotically dreamlike, Last Year at Marienbad is a surrealist parody of Hollywood melodrama, a high-fashion romance with a dark, alien underbelly. According to screenwriter Alain Robbe-Grillet, the movie is a pure construction, without a frame of reference outside of its own existence -- the lives of its characters begin when the lights go down, and conclude when they come back up.\r\n\r\n\r\n\r\n\r\nSTARS.........: Delphine Seyrig, Giorgio Albertazzi, Sacha Pitoëff\r\nDIRECTOR......: Alain Resnais\r\nWRITER........: Alain Robbe-Grillet\r\nGENRE.........: Drama | Mystery | Romance\r\nRATING........: 8.0/10  13,804 votes\r\nIMDB link.....: http://www.imdb.com/title/tt0054632\r\nRUNTIME.......: 1h 34mn\r\nSIZE..........: 4.13GB\r\nVIDEO CODEC...: x264 (  )\r\nRESOLUTION....: 1920x820\r\nBITRATE.......: 6000 Kbps (3 Pass)\r\nFRAMERATE.....: 23.976 fps\r\nAUDIO.........: French DTS 1.0 255kbps\r\nCHAPTERS......: Yes\r\nSUBTITLES.....: ENG, PER, RUS, TUR\r\nSOURCE........: 1080p Criterion Blu Ray Remux\r\nENCODED BY....: Sartre\r\nENCODE DATE...: 2016-04-19\r\n\r\n\r\n\r\nI used some degraining on this release. At this bitrate it's almost necessary to avoid blotchy grain, and if you prefer a cleaner look. If you want the original full grain look, grab the FGT or GCJM release (~7.5GB)\r\n\r\n\r\n\r\n\r\n\r\nBlu Ray Extras\r\n===============\r\n\r\nInterview With Alain Resnais - Filmmaker Francois Thomas, author of L'atelier d'Alain Resnais, conducted this rare in-depth audio interview with the French director exclusively for the Criterion Collection in 2008. Here, Alain Resnais talks about his encounter with Alain Robbe-Grillet, their instant attraction to each other, how Last Year at Marienbad was initially envisioned, etc.\r\n\r\nUnraveling The Enigma: The Making Of Marienbad - In this new documentary, many of Alain Resnais' collaborators - including his assistant directors Jean Leon and Volker Schlondorff, script girl Sylvette Baudrot, and production designer Jacques Saulnier - reflect on their work with the legendary director. Volker Schlondorff's comments in particular are quite interesting. \r\n\r\nGinette Vincendeau on Last Year at Marienbad - Alain Resnais' film has been viewed as both cinematic genius and intellectual nonsense, and everything in between. In this interview, film scholar Ginette Vincendeau discusses the various interpretations of the film and elucidates for its mysteries. Her elaboration on the speculative notion of Last Year at Marienbad being a film about a rape victim is fascinating. \r\n\r\nDocumentary by Resnais: Toute la Mémoire du Monde (1956) - Made in the late 50s, this is a poetic piece about the French national library in Paris and the archiving of memory that looks forward to his later films Hiroshima Mon Amour and Last Year at Marienbad.\r\n\r\nDocumentary by Resnais: Le Chant du Styrène (1958) -  A documentary on the plastics industry commissioned by Societe Pechiney and shot in the Pechiney polystyrene factories and features boldly abstract color images and voice-over text by Raymond Queneau. \r\n\r\nTrailers - Original theater trailer and re-release trailer","torrent":{"xt":"urn:btih:6ea91033e4fecf522ef6f9fee04b2e7fbe0482cd","amp;dn":"Last+Year+At+Marienbad+%281961%29+Criterion+1080p+x264+DTS-SARTRE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ea91033e4fecf522ef6f9fee04b2e7fbe0482cd","infoHashBuffer":{"type":"Buffer","data":[110,169,16,51,228,254,207,82,46,246,249,254,224,75,46,127,190,4,130,205]},"announce":[],"urlList":[]}}