{"title":"Bhagavad gita -in english","uid":6802135,"size":368157,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7052f23bbbff462b8c22069626822eb4048f8d62&amp;dn=Bhagavad+gita+-in+english&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"kafiruwn","files":1,"time":1320719697,"description":"                                 THE BHAGAVAD GITA           (format english pdf)\n\n\n\nThe Bhagavad-Gita is the eternal message of spiritual wisdom from ancient India. The word Gita means song and the word Bhagavad means God, often the Bhagavad-Gita is called the Song of God.\n\nThe Bhagavad-Gita is composed of 700 Sanskrit verses contained within 18 chapters, divided into three sections each consisting of six chapters. They are Karma Yoga the yoga of actions. Bhakti Yoga the yoga of devotion and Jnana Yoga the yoga of knowledge. \n\nThe Mahabharata confirms that Lord Krishna spoke the Bhagavad-Gita to Arjuna at the Battle of Kuruksetra in 3137 B.C.. According to specific astrological references in the Vedic scriptures, the year 3102 B.C. is the beginning of kali yuga which began 35 years after the battle 5000 years ago. \n\nThe original language of the Bhagavad-Gita was classical Sanskrit from India.The first English edition of the Bhagavad-Gita was in 1785 by Charles Wilkins in London, England. This was only 174 years after the translation of the King James Bible in 1611.\n\nHistorically many very extraordinary people such as Albert Einsten, Mahatma Gandhi, Dr. Albert Schweitzer, Herman Hesse, Ralph Waldo Emerson, Aldous Huxley, Rudolph Steiner and Nikola Tesla to name but a few have read Srimad Bhagavad-Gita and were inspired by its timeless wisdom.","torrent":{"xt":"urn:btih:7052f23bbbff462b8c22069626822eb4048f8d62","amp;dn":"Bhagavad+gita+-in+english","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7052f23bbbff462b8c22069626822eb4048f8d62","infoHashBuffer":{"type":"Buffer","data":[112,82,242,59,187,255,70,43,140,34,6,150,38,130,46,180,4,143,141,98]},"announce":[],"urlList":[]}}