{"title":"EnigmaT Set Rips { Cuts } - March 12th, 2010","uid":5438168,"size":444257038,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:715a18fde3cb7e14cfa0bd3870e4579230f03285&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+March+12th%2C+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":58,"time":1268797290,"description":" &lt;a href=&quot;http://enigmat.webhop.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://enigmat.webhop.net&lt;/a&gt;\n.\nJoin My Facebook Page for latest updates  --\n.\n.\n7he Myriads - Ocean (Summer Love) (Cut From Cockatoos Set)-enTc.mp3\nAbstract Vision &amp; Elite Electronic - Time (Cut From MIKE Set)-enTc.mp3\nAfternova - Serenity (Andy Blueman Remix) (ASOT 447 Rip)-enTc.mp3\nAfternova - Serenity (Original Mix) (Cut From MIKE Set)-enTc.mp3\nAlfoa - Peyote (Deep House Mix) (Cut From Cryo Set)-enTc.mp3\nAlfoa - Shinning (Original Mix) (Cut From Cryo Set)-enTc.mp3\nAntix &amp; Embark - Lost &amp; Found (Cut From Unique Set)-enTc.mp3\nArno E Mathieu - Horse Tears (Markus Enochson Remix) (Cut From Digweed Set)-enTc.mp3\nAurosonic - Always Together (Original Mix) (ASOT 447 Rip)-enTc.mp3\nChristian Smith - Beluga (Secret Cinema Remix) (Cut From Unique Set)-enTc.mp3\nChuck Lepley - Six Days (Cut From Digweed Set)-enTc.mp3\nChuck Lepley Feat Cajardo Un - 6 Days (Original Mix) (Cut From Bee Set)-enTc.mp3\nD-Mad - UNTITLED (Cut From Chiu Set) -!-.mp3\nDynamic Emotion - Welcome to My Head (Progressiver Remix) (Cut From Angel Ace Set)-enTc.mp3\nEgbert - Geizer (Cut From Unique Set)-enTc.mp3\nFelix Da Housecat - Silverscreen (Mandy Remix) (Cut From Digweed Set) -!-.mp3\nFine Taste &amp; Kid Broke - Lifebloom (Cut From Graham Set)-enTc.mp3\nFirst State - Cape Point (Blake Jarrell Remix) (ASOT 447 Rip)-enTc.mp3\nGolden Bug - Flamingo (Pete Herbert Remix) (Cut From Cockatoos Set)-enTc.mp3\nHybrid - Break My Soul (Intro Loop) (Cut From Jaytech Set)-enTc.mp3\nHybrid - Break My Soul (UNKNOWN Remix) (Cut From J00F Set)-enTc.mp3\nHypnotic Duo - Memory Lights (Cut From Southward Set)-enTc.mp3\nIvan Nikusev &amp; Wav-E - One Day Before (Guido Percich Remix) (Cut From Southward Set)-enTc.mp3\nJohnny Yono - Victoria (Cut From Chiu Set) -!-.mp3\nJona - Rise (Cut From Digweed Set)-enTc.mp3\nJuventa - Dreamer's Diary (Science Deal Remix) (Cut From Jerom Set)-enTc.mp3\nKahraman - Memat (Seba Rebolero Remix) (Cut From CzD Set) -!-.mp3\nKing Unique - Feniksas (Fergie Remix) (Cut From Unique Set)-enTc.mp3\nKlartraum - Phantomkatzen (Original Mix) (Cut From Bee Set)-enTc.mp3\nK-milian - Oditi (Salt Sweet Remix) (Cut From Stoynoff Set)-enTc.mp3\nLivin R &amp; Sean Angel Feat. Giorgio Sopidi - It's Over Now (Cut From CzD Set)-enTc.mp3\nLuiz B - Song Of Life (Soundstrom Remix) (Cut From Stoynoff Set)-enTc.mp3\nMarkus Schulz Featuring Khaz - Dark Heart Waiting (Club Mix) (GDJB Rip)-enTc.mp3\nMartin Landsky - Monitir One (Cut From Digweed Set) -!-.mp3\nMassive Attack - Attack Psyche (Android Cartel Remix) (Cut From Digweed Set)-enTc.mp3\nMatt Darey Pres. Urban Astronauts - Black Flowers (Josh Gabriel Remix) (ASOT 447 Rip)-enTc.mp3\nMatt Lange - East Coast (Ad Brown Remix) (Cut From Jaytech Set) -!-.mp3\nMichael &amp; Levan and Stiven Rivic - Angel Dream (Kintar Remix) (Cut From J00F Set)-enTc.mp3\nMike Shiver Vs. Matias Lehtola - Snooze (Samuel Jackson Remix) (Cut From Chiu Set)-enTc.mp3\nMoonbeam Featuring Daniel Mimra - Look Around (Moon Stage Remix) (GDJB Rip)-enTc.mp3\nMr. Pit - This Room is Not Big Enough (Tech Mix) (GDJB Rip)-enTc.mp3\nNima Gorji - Watching Out (Cut From Digweed Set)-enTc.mp3\nPacco &amp; Ruby B - Lemuria (Fady Ferraye Remix) (Cut From Bee Set)-enTc.mp3\nPaul Keeley - Flyby (Cut From Jaytech Set) -!-.mp3\nPaul Mad, Memo Insua &amp; Daniel Larusso - Pink Neon (Original Mix) (Cut From Cryo Set)-enTc.mp3\nPete Heller - Tune In Drop Out (Cut From Digweed Set) -!-.mp3\nPeter Horrevorts - Bloody Hands (Marc Marzenit Monster Remix) (-Sample- Cut From Unique Set)-enTc.mp3\nPhaxe - The Gateway (Cut From J00F Set)-enTc.mp3\nRex Mundi - Opera of Northern Ocean (Phynn Remix) (GDJB Rip)-enTc.mp3\nRipperton - Random Violence (Joris Voorn Remix) (Cut From Digweed Set)-enTc.mp3\nRPO - UNTITLED -March 2010- (Cut From J00F Set)-enTc.mp3\nSchodt - Kyushu (B.O.N.G. Remix) (Cut From Chiu Set) -!-.mp3\nSeph Vier - Cocktail (Original Mix) (Cut From Bee Set)-enTc.mp3\nSimon Firth - Strawberries (Trim The Fat Remix) (Cut From Jaytech Set)-enTc.mp3\nTasteXperience - Summersault (Airwave Remix) (GDJB Rip)-enTc.mp3\nTim Grube - Amador (Skytech Remix) (ASOT 447 Rip)-enTc.mp3\nTriangle Feat. Mark Ridout - Five We've Found It (Cut From Unique Set)-enTc.mp3\nW&amp;W vs. Jonas Stenberg - Alligator Fuckhouse (Bjorn Akesson Remix) (ASOT 447 Rip)-enTc.mp3","torrent":{"xt":"urn:btih:715a18fde3cb7e14cfa0bd3870e4579230f03285","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+March+12th%2C+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"715a18fde3cb7e14cfa0bd3870e4579230f03285","infoHashBuffer":{"type":"Buffer","data":[113,90,24,253,227,203,126,20,207,160,189,56,112,228,87,146,48,240,50,133]},"announce":[],"urlList":[]}}