{"title":"catholic_orangemen_of_togo","uid":4636124,"size":1516200,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:717b5814dac926647817f83ad2d215ec8ed4f53c&amp;dn=catholic_orangemen_of_togo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"paulj1024","files":4,"time":1231556853,"description":"From http://www.craigmurray.org.uk/archives/2009/01/buy_the_catholi.html:\n\n\nCraig Murray's adventures in Africa from 1997 to 2001 are a rolliciking good read. He exposes for the first time the full truth about the &quot;Arms to Africa&quot; affair which was the first major scandal of the Blair Years. He lays bare the sordid facts about British mercenary involvement in Africa and its motives. This is at heart an extraordinary account of Craig Murray's work in negotiating peace with the murderous rebels of Sierra Leone, and in acting as the midwife of Ghanaian democracy. Clearly his efforts were not only difficult but at times very dangerous indeed. Yet the story is told with great humour. Not only do we meet Charles Taylor, Olusegun Obasanjo, Jerry Rawlings and Foday Sankoh, but there are unexpected encounters with others including Roger Moore, Jamie Theakston and Bobby Charlton! Above all this book is about Africa. Craig Murray eschews the banal remedies of the left and right to share with us the deep knowledge and understanding that comes over 30 years working in or with Africa. Gems of wisdom and observation scatter the book, as does a deep sense of moral outrage at the consequences of centuries of European involvement: even though he explains that much of it was well-intentioned but disastrous.","torrent":{"xt":"urn:btih:717b5814dac926647817f83ad2d215ec8ed4f53c","amp;dn":"catholic_orangemen_of_togo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"717b5814dac926647817f83ad2d215ec8ed4f53c","infoHashBuffer":{"type":"Buffer","data":[113,123,88,20,218,201,38,100,120,23,248,58,210,210,21,236,142,212,245,60]},"announce":[],"urlList":[]}}