{"title":"Thor-Görans - Lika barn leka bäst   2016  (320)","uid":14962900,"size":110243249,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:718eddc73b8749bb95d2f09695ad0a923e7d24e2&amp;dn=Thor-G%26ouml%3Brans+-+Lika+barn+leka+b%26auml%3Bst+++2016++%28320%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RoffeTheCoolMan","files":14,"time":1466164222,"description":"Thor Görans är tillbaka på platta. Och nyss fyllda 40 framgångsrika dansbandsår är bandet hetare än någonsin. Ett av Sveriges största dansband fortsätter leverera. På scen och på skiva. Fullsatta dansbanor och en fullspikad turneplan runt om i Norden vittnar om bandets fortsatta popularitet. Thor Görans har alltid gått sina egna vägar, och det fortsätter dom med. Bandet har alltid värnat om sin egna unika stil. Precis inget enda dansband låter som Thor Görans. Och inte många band har en helt egen låtkatalog, som bandets låtskrivare Peter &quot;Till min kära&quot; Grundström försett bandet med under alla år. Det vet bandets trogna fans, skivköpare och danspubliken.\r\n\r\n- &quot;Det är alltid en glädje att släppa nytt låtmaterial. Målet är att alltid leverera trygghet, men också kunna överraska på varje ny platta. Vi känner att vi återigen tagit ett nytt steg framåt. Vi har heller aldrig tidigare upplevt den respons vi får idag. Både på dansbanorna och för våra plattor. Vi möts av så mycket kärlek och uppskattning var vi än drar fram, berättar Grundström\r\nFör 21 år sedan började samarbetet med populära sångerskan Agneta Olsson, som numera frontar bandet. Idag har hon varit ordinarie sångerska i 12 år:\r\n\r\n- &quot;Agneta har en fantastisk sångröst, och hon har verkligen lyft bandet. Hon är numera vår frontperson, och jag ägnar mig ännu mer åt låtskrivandet. Men publiken uppskattar att vi fortfarande är två som sjunger. Kombinationen tjej och kille skapar mångfald, på scen och skiva, och vi tycker att bandet har blivit ännu mer intressant med ett centrerat dansbandspar i mitten&quot;, säger Peter Grundström\r\n\r\nThor Görans har fortfarande en stor skivköparpublik. Trogna skivköpare som fortfarande vill ha en fysisk skiva i handen. Att kunna spela i bilen, i husvagnen, till partyt, sommarkvällen och vid livets alla tillfällen \r\n\r\n\r\n\r\n\r\nLåtlista\r\n\r\n    1. Min Romeo\r\n    2. Lika barn leka bäst\r\n    3. Ett brustet hjärta\r\n    4. Tuffa flickor (dom får snälla killar)\r\n    5. Strövtåg i hembygden\r\n    6. I hennes vackra ögon\r\n    7. Fredag i Köpenhamn\r\n    8. Gråt inga tårar\r\n    9. Ett lyckligt liv tillsammans\r\n    10. Jag är en annan nu\r\n    11. En regning dag\r\n    12. Tror du att jag förlorad är\r\n    13. Alla dina ord","torrent":{"xt":"urn:btih:718eddc73b8749bb95d2f09695ad0a923e7d24e2","amp;dn":"Thor-G%26ouml%3Brans+-+Lika+barn+leka+b%26auml%3Bst+++2016++%28320%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"718eddc73b8749bb95d2f09695ad0a923e7d24e2","infoHashBuffer":{"type":"Buffer","data":[113,142,221,199,59,135,73,187,149,210,240,150,149,173,10,146,62,125,36,226]},"announce":[],"urlList":[]}}