{"title":"7 Weeks Total Program","uid":8166872,"size":16025747,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71a69209ee8f1f7605cd22cc80b4a8db96b5d924&amp;dn=7+Weeks+Total+Program+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7096AR","files":-1,"time":1361348550,"description":"7 Weeks to 300 Sit-Ups\n\nARE YOU READY TO SCULPT YOUR ABS? \n Follow the 7-week program in this book and you'll massively increase the strength and muscle tone of your core, back and obliques to such an extreme that you'll be able to do 300 consecutive sit-ups. Packed with clear charts and helpful photos,7 Weeks to 300 Sit-Ups tells you everything you need to know about the ultimate exercise for your core and includes:\n - Instructions on how to do a perfect sit-up\n - Easy-to-follow progressive training programs\n - Added challenges for extreme strengthening\n Offering field-tested, day-by-day plans and more than 30 core-shredding exercises, this book has something for everyone: from beginners embarking on a new workout regimen to athletes looking to expand their strength-training options.\t\n\n\nARE YOU READY FOR THE ULTIMATE STRENGTH CHALLENGE?\nFollow the 7-week program in this book and you'll massively increase your strength, muscle tone and overall fitness to such an extreme that you'll be able to do 50 consecutive pull-ups!\nOffering several field-tested, day-by-day plans, this book has something for everyone: from beginners embarking on a new workout regimen to athletes looking to expand their strength-training options.\nPacked with clear charts and helpful photos, 7 Weeks to 50 Pull-Up s tells you everything you need to know about the ultimate strength-building exercise.\n\n\nIf you're ready to massively increase your strength, follow the 7-week program in this book and you'll soon be able to complete 100 consecutive push-ups! You'll also transform your fitness, look great and feel even better as you sculpt every muscle from your neck down to your calves.\n \nOffering several custom-designed, day-by-day plans, this book has something for everyone: from beginners embarking on a new workout regimen to athletes looking to enhance their strength training program.","torrent":{"xt":"urn:btih:71a69209ee8f1f7605cd22cc80b4a8db96b5d924","amp;dn":"7+Weeks+Total+Program+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71a69209ee8f1f7605cd22cc80b4a8db96b5d924","infoHashBuffer":{"type":"Buffer","data":[113,166,146,9,238,143,31,118,5,205,34,204,128,180,168,219,150,181,217,36]},"announce":[],"urlList":[]}}