{"title":"English and Irish literature – The Classics [NEW]","uid":13268182,"size":357784169,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:729eef1e8a3f10ee486c820caa117532ea2ba918&amp;dn=English+and+Irish+literature+%26ndash%3B+The+Classics+%5BNEW%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"whitecat2010","files":674,"time":1453364798,"description":"About the collection\r\n=====================\r\n\r\nThis is my collection of English (British) and Irish literature (so no American authors and no foreign, translated authors) from the Middle Ages till the first decades of the 20th century, just before WW2. \r\nThere is no  Science Fiction, Fantasy and the like, because it will be the subject of another, separate torrent (you'll find Wells, Tolkien, Diana Wynne Jones, Neil Gaiman and J.K.Rowling  there) . \r\n\r\nThe books are mainly in .epub and .pdf, because I don't own a Kindle and I dislike the very idea of a proprietary format and ereader which binds you as its slave, in exchange for the low price. I usually go for ereaders which support the greatest number of formats. \r\n\r\nMy naming convention is different than found in collections that come from Calibre. I hate it when the books are by book title and not by author, because I want the books by the same author to be shown together even when they are not grouped in a folder.\r\n\r\nSources\r\n=======\r\n\r\nThese are not my own scans or OCR. They have been collected over many years from the web, either from huge messy book torrents containing a bit of everything or one by one from free download sites such as gutenberg, archive org and such; a bunch of them came with my various e-readers. \r\nMy only merit, then, is collecting and organizing them, but I assure you that it was quite a bit of work. \r\nI picked those which belong to this category from the chaos of most book torrents, or downloaded the free books one by one. Then I renamed them consistently to prune out doubles and make search easy. I’ve taken out meaningless folder numbers, adding instead authors’ year of birth and death. Inside, I deleted .opf , bin and other useless files. In many cases I’ve added a .txt file with info about authors or found a book cover when there wasn’t any.\r\n\r\nYou might find some books twice: usually because one is a scan of a regular book and the other one with the blown-up font used for e-readers, or sometimes one will include a cover and the other won’t. .. things like that. The collection is not compressed, so if these things don’t matter to you, feel free to skip downloading one of the two. \r\n\r\nIMPORTANT NOTE:\r\n===============\r\n\r\nI had uploaded, by mistake, the unedited folder. So now I am uploading again the updated, edited version. If you have already downloaded the other one, it's no big deal, but much of the pruning, renaming and extra info mentioned in the description is not there in that one. So if you haven't yet downloaded any of the two, pick this one, OK? And I'll try to have the other one deleted by some kind moderator","torrent":{"xt":"urn:btih:729eef1e8a3f10ee486c820caa117532ea2ba918","amp;dn":"English+and+Irish+literature+%26ndash%3B+The+Classics+%5BNEW%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"729eef1e8a3f10ee486c820caa117532ea2ba918","infoHashBuffer":{"type":"Buffer","data":[114,158,239,30,138,63,16,238,72,108,130,12,170,17,117,50,234,43,169,24]},"announce":[],"urlList":[]}}