{"title":"Mary Mary feat. Kierra Sheard - God In Me","uid":4984024,"size":109017092,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:72be47f80a8077d85e3df17e036c74aae0fda859&amp;dn=Mary+Mary+feat.+Kierra+Sheard+-+God+In+Me&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1246529605,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nThe Sound is the fifth studio album by R&amp;B/gospel duo Mary Mary. It was released on October 21, 2008 in the U.S.. In the UK, The Sound's release has been delayed to September, then it has since been delayed again till October. It was later announced the tentative release date in the UK is October 20, 2008.\n\nIn advance of the album's release, the duo released a promotional song entitled &quot;A Mother's Smile&quot; in conjunction with a Mother's Day promotion with Colgate. The official lead single &quot;Get Up&quot; was released digitally via iTunes on July 15, 2008. The Album debuted at number 7 on the Billboard 200, number 2 on the Billboard Top R&amp;B/Hip Hop Albums Chart, as well as number 1 on both the Billboard Top Gospel Albums and Billboard Top Christian Albums Charts. The album sold 37,800 copies it first week. Due to the success of the album it is said that album will have a deluxe edition of the album expected to release later this year.\n\nAs with other Mary Mary recordings, Warryn Campbell (known as Baby Dubb) assumes production over the album and the duo co-writes many of the songs on the album.\n\nThe Sound saw Mary Mary explore more genres, with less songs containing their signature contemporary R&amp;B sound. The songs &quot;Forgiven Me&quot; and &quot;Dirt&quot; feature elements of pop rock. The duo also covers a traditional gospel song, &quot;It Will All Be Worth It&quot;. The Sound covers their famous R&amp;B/hip hop sound with songs such as &quot;Superfriend&quot; and &quot;God In Me&quot;. Whereas he group experiments with 50s pop on the title track. Finally, the duo also incorporated dance pop music in their lead single &quot;Get Up&quot;. The latter tracks on the album are primarily worship ballads.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:72be47f80a8077d85e3df17e036c74aae0fda859","amp;dn":"Mary+Mary+feat.+Kierra+Sheard+-+God+In+Me","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72be47f80a8077d85e3df17e036c74aae0fda859","infoHashBuffer":{"type":"Buffer","data":[114,190,71,248,10,128,119,216,94,61,241,126,3,108,116,170,224,253,168,89]},"announce":[],"urlList":[]}}