{"title":"Game of Thrones - Valyrian and Dothraki Subtitles Only - S01, S0","uid":9724118,"size":25808,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:733c504d4202cf0d8b4dc08c27ceea4a1414b2f5&amp;dn=Game+of+Thrones+-+Valyrian+and+Dothraki+Subtitles+Only+-+S01%2C+S0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"strongnc21","files":-1,"time":1394278519,"description":"I know, we all have different reasons for torrenting. And we all have different thresholds for what we decide to buy, and what we decide to torrent. If you enjoy this content, please consider purchasing it. I'm sure most of us would agree, Game of Thrones is worth supporting.\n\nGame of Thrones on\n\nSeason 1:\nSeason 2:\nSeason 3:\n\n---------------------------------------\n\nThis is my first torrent! :-D\n\nThe files in this torrent are .srt subtitle files for Season 1, Season 2, and Season 3 of Game of Thrones.\n\nThese subtitle files omit all text when English is spoken on screen - subtitles will only appear when the actors speak in Valyrian or Dothraki.\n\nAfter some digging, I was able to find Season 1 and Season 2 already on the internet. However, I was not able to find anything for Season 3.\n\nThe subtitle files I located for Seasons 1 and 2 were mostly fine. I made a number of tweaks to them, correcting some letters and timings. I spot checked them with the video files, to make sure they were alright.\n\nSeason 3 was nowhere to be found though. I had to grab full .srt files, and then skip through each episode, manually deleting subtitles for non-Valyrian or non-Dothraki scenes.\n\n---------------------------------------\n\nEach season of Game of Thrones has 10 episodes. There are only 21 episodes that could make use of these special subtitle files, though. (In nine episodes, Valyrian and Dothraki are never spoken).","torrent":{"xt":"urn:btih:733c504d4202cf0d8b4dc08c27ceea4a1414b2f5","amp;dn":"Game+of+Thrones+-+Valyrian+and+Dothraki+Subtitles+Only+-+S01%2C+S0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"733c504d4202cf0d8b4dc08c27ceea4a1414b2f5","infoHashBuffer":{"type":"Buffer","data":[115,60,80,77,66,2,207,13,139,77,192,140,39,206,234,74,20,20,178,245]},"announce":[],"urlList":[]}}