{"title":"The Clash of Ideas in World Politics","uid":5826263,"size":1269662,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73df0019d38c29e6df4f7a793d863a3343ca6ad9&amp;dn=The+Clash+of+Ideas+in+World+Politics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1284249929,"description":"Some blame the violence and unrest in the Muslim world on Islam itself, arguing that the religion and its history is inherently bloody. Others blame the United States, arguing that American attempts to spread democracy by force have destabilized the region, and that these efforts are somehow radical or unique. Challenging these views, The Clash of Ideas in World Politics reveals how the Muslim world is in the throes of an ideological struggle that extends far beyond the Middle East, and how struggles like it have been a recurring feature of international relations since the dawn of the modern European state.\n\nJohn Owen examines more than two hundred cases of forcible regime promotion over the past five centuries, offering the first systematic study of this common state practice. He looks at conflicts between Catholicism and Protestantism between 1520 and the 1680s; republicanism and monarchy between 1770 and 1850; and communism, fascism, and liberal democracy from 1917 until the late 1980s. He shows how regime promotion can follow regime unrest in the eventual target state or a war involving a great power, and how this can provoke elites across states to polarize according to ideology. Owen traces how conflicts arise and ultimately fade as one ideology wins favor with more elites in more countries, and he demonstrates how the struggle between secularism and Islamism in Muslim countries today reflects broader transnational trends in world history.\n\nPaperback: 320 pages \nPublisher: Princeton University Press (August 8, 2010) \nLanguage: English \n \n","torrent":{"xt":"urn:btih:73df0019d38c29e6df4f7a793d863a3343ca6ad9","amp;dn":"The+Clash+of+Ideas+in+World+Politics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73df0019d38c29e6df4f7a793d863a3343ca6ad9","infoHashBuffer":{"type":"Buffer","data":[115,223,0,25,211,140,41,230,223,79,122,121,61,134,58,51,67,202,106,217]},"announce":[],"urlList":[]}}