{"title":"The Outer Limits of Reason: What Science Cannot Tell Us (2013)","uid":9293013,"size":5529600,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7437f6dc06086ec5bcbb2a0963e7ee456bb754c9&amp;dn=The+Outer+Limits+of+Reason%3A+What+Science+Cannot+Tell+Us+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1386121662,"description":"The Outer Limits of Reason: What Science, Mathematics, and Logic Cannot Tell Us\n\n\n\nMany books explain what is known about the universe. This book investigates what cannot be known. Rather than exploring the amazing facts that science, mathematics, and reason have revealed to us, this work studies what science, mathematics, and reason tell us cannot be revealed. \n\n In The Outer Limits of Reason, Noson Yanofsky considers what cannot be predicted, described, or known, and what will never be understood. He discusses the limitations of computers, physics, logic, and our own thought processes.\n\n Yanofsky describes simple tasks that would take computers trillions of centuries to complete and other problems that computers can never solve; perfectly formed English sentences that make no sense; different levels of infinity; the bizarre world of the quantum; the relevance of relativity theory; the causes of chaos theory; math problems that cannot be solved by normal means; and statements that are true but cannot be proven. He explains the limitations of our intuitions about the world -- our ideas about space, time, and motion, and the complex relationship between the knower and the known.\n\n Moving from the concrete to the abstract, from problems of everyday language to straightforward philosophical questions to the formalities of physics and mathematics, Yanofsky demonstrates a myriad of unsolvable problems and paradoxes. Exploring the various limitations of our knowledge, he shows that many of these limitations have a similar pattern and that by investigating these patterns, we can better understand the structure and limitations of reason itself. Yanofsky even attempts to look beyond the borders of reason to see what, if anything, is out there.\n\n\n2013 epub","torrent":{"xt":"urn:btih:7437f6dc06086ec5bcbb2a0963e7ee456bb754c9","amp;dn":"The+Outer+Limits+of+Reason%3A+What+Science+Cannot+Tell+Us+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7437f6dc06086ec5bcbb2a0963e7ee456bb754c9","infoHashBuffer":{"type":"Buffer","data":[116,55,246,220,6,8,110,197,188,187,42,9,99,231,238,69,107,183,84,201]},"announce":[],"urlList":[]}}