{"title":"Green - Green 1969 (2007) [FLAC]","uid":10068435,"size":242335616,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:74d9d941c771df62e5dcad6e8d99849996b8167b&amp;dn=Green+-+Green+1969+%282007%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1398815672,"description":"eac secure cue log scans\n\nLike many bona fide lost classics, Green is still largely shrouded in mystery. It sold badly on its original release (in the spring of 1969, on Atlantic subsidiary Atco), and still hasn't received its due as one of the most imaginative psych-pop albums of the period.\n\nCertain members were from Denton, Texas, while Richard Gardzina (now a distinguished saxophonist and flautist) hailed from Manchester, New Hampshire. The group are thought to have coalesced at North Texas State University, and recorded four songs as demos in a local studio, an acetate of which has recently surfaced (included here as bonus material). It shows them to have been a superbly tight unit well before they got to cut an album.\n\nTheir eventual debut, produced by veteran songwriter and composer Fred Darian, reflects little of the crazed psychedelia of fellow Texan musical travellers like the 13th Floor Elevators and the Golden Dawn. If anything, it's more Englishinfluenced, a taut collection of acid pop tunes set to distorted guitar and taut horn arrangements that complement, rather than swamp, the material.\n\nThough four separate band members are credited with contributing brass to the record, selfindulgence is entirely avoided in favour of complex arrangements that consistently take unexpected turns. This means that, like many other neglected gems, the album reveals itself best on repeated listening. The songs veer from the mellow ballads Sunrise #7 and Footprints In The Snow to the hard psychedelic Green and Eastern-tinged Where Have I Been?', and - though most feature an impressive range of instruments - they are never cluttered.\n\nUltimately, however, the band's very breadth of talent may have damaged their chances of commercial success, for the album sank without trace. Its follow-up, 1971's To Help Somebody (also on Atco) was less focused (though still impressive in parts) and didn't sell either, prompting the band to fall apart. It is to be hoped that this first CD reissue will help to shed more light on the story behind this widely-admired LP.\n\nTracks\n1. To Be (Martin) - 2:52\n2. Where Have I Been? (Martin) - 3:10\n3. Sunrise # 7 (Fisher) - 3:37\n4. Just Try (Martin) - 2:13\n5. Sparkle (Martin) - 2:20\n6. Green (Fisher, Casebeer, Blood, Gardzina, Martin) - 3:24\n7. Footprints In The Snow (Martin) - 2:23\n8. At The Time (Martin) - 2:15\n9. RCMPB (Fisher) - 3:06\n10. Don't (Martin) - 2:11\n11. Have You Ever? (Martin, Gardzina) - 3:05\n12. Where Have I Been? (Martin) - 3:25\n13. Have You Ever? (Martin, Casebeer) - 3:19\n14. At The Time (Martin) - 2:22\n15. Sunrise # 7 (Fisher) - 3:28\nBonus Tracks from 12-15.\n\nGreen\n*Gary Casebeer  - Percussion, Keyboards, Brass, Vocals\n*Richard Gardzina - Reeds, Keyboards, Vocals, Brass\n*Wilson Fisher - Strings, Vocals, Harmonica\n*John Martin - Strings, Keyboards, Vocals\n*James Neel - Brass, Keyboards, Vocals, Reeds\n*Bobby Blood - Brass","torrent":{"xt":"urn:btih:74d9d941c771df62e5dcad6e8d99849996b8167b","amp;dn":"Green+-+Green+1969+%282007%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74d9d941c771df62e5dcad6e8d99849996b8167b","infoHashBuffer":{"type":"Buffer","data":[116,217,217,65,199,113,223,98,229,220,173,110,141,153,132,153,150,184,22,123]},"announce":[],"urlList":[]}}