{"title":"Water Liars (2014) [FLAC]","uid":9843159,"size":222509721,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:74f278a8b441955b0e6dd2b7cf5cd1920ba396fa&amp;dn=Water+Liars+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1396025779,"description":"\n  Water Liars (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Country-Rock, Indie\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Cannibal \n  02 War Paint \n  03 I Want Blood \n  04 Swannanoa \n  05 Let It Breathe\n  06 Tolling Bells (For Molina) \n  07 Ray Charles Dream \n  08 Vespers \n  09 Pulp \n  10 Last Escape\n  11 Turn Me On \n\n  Mississippi alt-country-rockers Water Liars are an especially fast-moving beast. After the band formed out of the ether of what seemed like a one-off afternoon jam session in 2011, its members quickly shed their other commitments and set off on a particularly accelerated path of creative energy, touring, recording, and releasing music at a nonstop pace. This self-titled album is their third full-length in just three years of existence, written and put to tape amid ceaseless live performances and the group expanding from a duo of Justin Kinkel-Schuster and Andrew Bryant with the inclusion of G.R. Robinson. Their development continues to quickly unfold in terms of songwriting, musicianship, and production alike, as the songs here feel instantly clearer and more intentional than the sometimes blurry sentiments of previous albums. Still present in abundance are the dark undertones of Kinkel-Schuster's lyrics, themes of displacement, desperation, and hard living running through most of the songs. \n\n  However, where the songs on their fantastically troubled sophomore album, Wyoming, seemed entrenched in the type of depression that only results in complete abandon and oblivion, there's more a sense of struggle in songs like &quot;Pulp&quot; and the uphill push of &quot;I Want Blood.&quot; Whether fighting against alienation, pushing back against spiritual darkness, trying to salvage a tattered relationship, or simply trying to make ends meet in a sinking economy, the songs here have a sense of going into battle much more than they do giving in to the demons. Sonically, there's more glittering piano all over the record, expanding the guitar-drum template of earlier work and opening up the songs up to deeper dynamics. The heart-wrenching lonely walk of &quot;Tolling Bells (For Molina)&quot; tackles the pain of loss in the form of a tribute to departed Songs: Ohia/Magnolia Electric Co. songwriter Jason Molina, and &quot;Ray Charles Dream&quot; momentarily drops the alt-country trappings for something that nearly resembles power pop. Water Liars continues the band's speedy progression into an increasingly sculpted and richly produced entity, and hints at the possibility that they have a lot more to say and won't be slowing down anytime in the near future.","torrent":{"xt":"urn:btih:74f278a8b441955b0e6dd2b7cf5cd1920ba396fa","amp;dn":"Water+Liars+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74f278a8b441955b0e6dd2b7cf5cd1920ba396fa","infoHashBuffer":{"type":"Buffer","data":[116,242,120,168,180,65,149,91,14,109,210,183,207,92,209,146,11,163,150,250]},"announce":[],"urlList":[]}}