{"title":"Death and the Dervish","uid":12305628,"size":514940,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:75267be31b34a41fa68b957ba38b8d32866f467b&amp;dn=Death+and+the+Dervish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zephyrus11","files":3,"time":1440792829,"description":"Personally I think this is the best book I've ever read. It's a heart-shaking story about loneliness, religion and friendship that took +30 years just to be translated into the english language.\n\n\nSeries: Writings from an Unbound Europe (Book 6474574537)\nPaperback: 473 pages\nPublisher: Northwestern University Press; Translated edition (August 14, 1996)\nLanguage: English\nISBN-10: 0810112973\nISBN-13: 978-0810112971\n\n\nFrom Publishers Weekly\nLauded by the publisher for its contribution to understanding &quot;the current crisis&quot; in the former Yugoslavia, this tale of moral failure takes place at some undefined point during the Ottoman occupation of Muslim Bosnia. It was a bestseller when published in Yugoslavia in 1966, but it seems probable that its popularity lay more in its portrayal of a Yugoslavia oppressed than in any intrinsic artistry. Ahmed, the dervish of the title, has lived in religious seclusion for most of his life; his searching, self-centered and at times deranged internal dialogue constitutes most of this lengthy narrative. Selimovic (The Island; The Fortress) portrays a man hopelessly out of touch with himself and others, viciously in need of being right, secretly coveting power for himself. Groveling before authority, he knowingly betrays innocent people, yet rationalizes everything with perverted interpretations of the Koran. His brother's death, towards the beginning of the novel, and the near-destruction of the community's purest and most generous soul, by the end, enclose a tortuous psychological exposition of the perils of delusion and the ease with which fear destroys the most unyielding moral good. It is a probing portrait containing some valuable insights, yet with a character as insipid as Ahmed, it is hard to really care","torrent":{"xt":"urn:btih:75267be31b34a41fa68b957ba38b8d32866f467b","amp;dn":"Death+and+the+Dervish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75267be31b34a41fa68b957ba38b8d32866f467b","infoHashBuffer":{"type":"Buffer","data":[117,38,123,227,27,52,164,31,166,139,149,123,163,139,141,50,134,111,70,123]},"announce":[],"urlList":[]}}