{"title":"Janet Jackson - Control (Full Original Video)","uid":4707031,"size":321662980,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:762d61c5abb4768141bc5f0b04fa93d5f2ba90f0&amp;dn=Janet+Jackson+-+Control+%28Full+Original+Video%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1233889199,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Control&quot; is the fourth single from Janet Jackson's third album Control. The song was written by Jackson, James Harris III, and Terry Lewis and produced by Jimmy Jam and Terry Lewis. Its arrangement, built upon complex rhythmic tracks, showcased state-of-the-art production. It is about Jackson who wants to finally take control of her life. Jackson sings &quot;When I was seventeen, I did what people told me.&quot; She is an adult who needs to guide herself in the world. The spoken intro of &quot;Control&quot; was sampled on Kylie Minogue's song &quot;Too Much of a Good Thing&quot;, from her Let's Get to It album.\n\nIn 1988, the song won a Soul Train Music Award for Best R&amp;B/Soul or Rap Music Video, beating out her brother Michael, Whitney Houston, and Jody Watley.\n\nJackson has performed the song on many of her tours, including &quot;Rhythm Nation 1814 Tour&quot;, &quot;The Velvet Rope Tour&quot;, &quot;All for You Tour&quot;, and &quot;Rock Witchu Tour&quot;. The only tour that it was not included on was the &quot;janet. Tour&quot;.\n\nThe music video, directed by Mary Lambert, starts off with Jackson fighting with her parents because she wants to move out of the house. Her father is deadset against it. She then leaves the house and is greeted, in her driveway by Jimmy Jam &amp; Terry Lewis, Jellybean Johnson, and Jerome Benton. They take her to a concert hall to perform, on her first gig, her single &quot;Control&quot; where she shows that she wants to be &quot;the one in control&quot;. The video version of the song is different from the album version. The nine-minute video was made available on iTunes Store on April 27, 2007.\n\nReleased in 1986, the single peaked at five in the U.S. becoming Jackson's fourth consecutive Top 5 single on the Billboard Hot 100; it also peaked at one on the Hot Dance Music/Club Play and the Hot R&amp;B/Hip-Hop Singles &amp; Tracks charts. The song captured a pivotal moment off the album by showcasing a female streak of independence. It was the thirty-seventh biggest Hot 100 single of 1987. The fifth biggest Hot R&amp;B/Hip-Hop Singles &amp; Tracks single of 1987 and the ninth biggest-selling 12&quot; single of 1987.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:762d61c5abb4768141bc5f0b04fa93d5f2ba90f0","amp;dn":"Janet+Jackson+-+Control+%28Full+Original+Video%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"762d61c5abb4768141bc5f0b04fa93d5f2ba90f0","infoHashBuffer":{"type":"Buffer","data":[118,45,97,197,171,180,118,129,65,188,95,11,4,250,147,213,242,186,144,240]},"announce":[],"urlList":[]}}