{"title":"UDEMY UDEMY PROMO MASTERY HOW TO GET NEW STUDENTS IN 2 MINUTES T","uid":12741852,"size":284952876,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:770a9e2c4268ca09c149c79121e338d36e1564c5&amp;dn=UDEMY+UDEMY+PROMO+MASTERY+HOW+TO+GET+NEW+STUDENTS+IN+2+MINUTES+T&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BarCraft","files":25,"time":1447245511,"description":"Overall, Over 2300 Satisfied Students Enrolled in our courses |\r\n| * Overall, 100+ TOP 5 Star Reviews from very happy students |\r\n| * 25 HQ lectures and over 2 hours of content |\r\n| |\r\n| One of my first courses on Udemy got more than 1000 new students in less |\r\n| than 24 hours and became an overnight bestseller, getting great reviews, |\r\n| attracting even more students. And you are about to learn, how to do the |\r\n| same! |\r\n| |\r\n| What some students say about my courses: |\r\n| |\r\n| ''This course offers a ton of value and was presented in a compelling |\r\n| way... Recommended.'' - Jimmy Naraine (bestselling instructor on Udemy) |\r\n| |\r\n| &quot;Great course. ... Everything was very clear and presented with a lot of |\r\n| passion. &quot; - Joepperd D |\r\n| |\r\n| &quot;Outstanding. Very energetic videos that are motivating by conveying your |\r\n| high vibe and your easy to understand, practical content. I found lots of |\r\n| good advice in them that I will start to implement right away.&quot; - Gergely |\r\n| Horv th |\r\n| |\r\n| --------------- |\r\n| |\r\n| As an Udemy instructor, you don't want to spend weeks or even months on |\r\n| creating a great course and find out that nobody wants to buy it. After |\r\n| analyzing hundreds of bestselling courses I've discovered that no matter |\r\n| how great your course is, THE PROMO VIDEO will be the first video that |\r\n| your students will see, and they'll use it to decide whather to buy your |\r\n| course or not ... so let's make sure that they will! |\r\n| |\r\n| About this course |\r\n| |\r\n| I've been creating professional videos for more than 10 years and this |\r\n| course is all about creating a promo that will sell your course. |\r\n| |\r\n| We've devided this course in few simple sections. |\r\n| |\r\n| 1. INTRODUCTION |\r\n| |\r\n| In this section you'll learn everything you need to know about effective |\r\n| what will make your promo video great and converting. We'll be talking |\r\n| about different types of video, its lenght etc. |\r\n| |\r\n| 2. WRITING |\r\n| |\r\n| I've analyzined promo videos of more than 300 best selling Udemy courses |\r\n| and created a step by step formula which you will use to make your promo |\r\n| video a real 10! |\r\n| |\r\n| 3. FILMING |\r\n| |\r\n| The third section is about filming your promo. You'll either film yourself |\r\n| in front of the camera, record your voice or both. I will also show you |\r\n| how I created my own professional studio with a minimal budget. |\r\n| |\r\n| 4. EDITING |\r\n| |\r\n| However, your promo will come to life in section 4 - where we'll be talking |\r\n| about editing and finishing your promo. We'll be talking about editing |\r\n| software, templates, professional voice over and music. From editing |\r\n| simple promos which can be finished in just 3 minutes, to impressive |\r\n| advanced promos. You'll learn it all in section 4. |\r\n| |\r\n| But there's even more! I've also included some exclusive bonuses which |\r\n| you'll get for free. And don't forget that you can always get your money |\r\n| back in 30 days. |\r\n| |\r\n| Don't wait! Get this course right now. |","torrent":{"xt":"urn:btih:770a9e2c4268ca09c149c79121e338d36e1564c5","amp;dn":"UDEMY+UDEMY+PROMO+MASTERY+HOW+TO+GET+NEW+STUDENTS+IN+2+MINUTES+T","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"770a9e2c4268ca09c149c79121e338d36e1564c5","infoHashBuffer":{"type":"Buffer","data":[119,10,158,44,66,104,202,9,193,73,199,145,33,227,56,211,110,21,100,197]},"announce":[],"urlList":[]}}