{"title":"Little House On The Praire Series One-Disc 1-Episodes[1-4]h.264-","uid":7017430,"size":3087433357,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7754314eec8f2ae9564e346b695742e3ccf34a2b&amp;dn=Little+House+On+The+Praire+Series+One-Disc+1-Episodes%5B1-4%5Dh.264-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"jocktheripper","files":-1,"time":1328712050,"description":"little house on the prairie series one -disc one ep[1-4]\n\nh.264 mp4\n\nimdb: http://www.imdb.com/title/tt0071007/\n\nrating: 7.5\n\n\nEpisode one[A Harvest Of Friends]\n\nAfter moving his family from Wisconsin's 'big woods' to Minnesota's prairie, pioneer Charles Ingalls settles on farmland by Plum Creek just outside the town of Walnut Grove. To support his family until he can bring in a harvest, Charles works several jobs, establishing himself as a valued community member and a man of his word. But a rash promise to complete a job for devious Liam O'Neill by a specified time and a fall from a tree while rescuing a kite on a family picnic, threaten to ruin the Ingalls hopes for their future. How will the family pull together to save their farm and can they count on help from their new friends?\n*****************************************\n\nEpisode Two[Country girls]\n\nMean Nellie Oleson snubs Laura and Mary for wearing homespun dresses on their first day at school and, when Laura later complains, Caroline reminds her to be kind to Nellie to win her friendship. But Caroline forgets her own wise words, loses her temper with Nellie's haughty mother, store owner Harriet Oleson, and impulsively buys dress fabric she can barely afford. Later, Laura struggles to write an essay for the Visitors' Day program and Caroline must decide what to do with the expensive fabric. When Visitors' Day arrives, their love for each other helps both mother and daughter solve their problems.\n*****************************************\n\nEpisode Three[100 Mile Walk]\n\nWhen their wheat crop is ravaged by a hailstorm, the discouraged Walnut Grove men leave town to search for work. During his long walk, Charles meets Danny Peters, a flamboyant hard rock miner who recommends Charles for the well-paying but dangerous job of 'powder monkey', part of a 2-man hole drilling team needed to hand-set blasting charges in a rock quarry. Meanwhile, back in Walnut Grove, Caroline organizes the women to try to salvage what they can of the damaged wheat. In the end, though separated by distance and circumstance, the pioneer families work together to meet the challenge of unpredictable prairie life.\n*****************************************\n\nEpisode Four[Mr Edwards Homecoming]\n\nWhile in Mankato, Charles is surprised to find Isaiah Edwards, the mountain man befriended by the Ingalls family on their journey to Minnesota. The two men return to Walnut Grove together to find young Laura sick in bed and a worried Mr. Edwards promises to stay until she recovers. But Mr. Edwards' deep concern for Laura stems from a devastating personal loss and he cannot forgive the one he holds responsible. Will the Ingalls' friendship and a budding romance with postmistress Grace Snider help Mr. Edwards come to terms with his past or will he leave Walnut Grove for good?","torrent":{"xt":"urn:btih:7754314eec8f2ae9564e346b695742e3ccf34a2b","amp;dn":"Little+House+On+The+Praire+Series+One-Disc+1-Episodes%5B1-4%5Dh.264-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7754314eec8f2ae9564e346b695742e3ccf34a2b","infoHashBuffer":{"type":"Buffer","data":[119,84,49,78,236,143,42,233,86,78,52,107,105,87,66,227,204,243,74,43]},"announce":[],"urlList":[]}}