{"title":"Sampled vol. 4","uid":3373781,"size":218363071,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7883ac12e84123fe2da1f61628420435084f4b1f&amp;dn=Sampled+vol.+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dicktator","files":41,"time":1124839101,"description":"A collection of original tracks, that's been sampled.\n\nDisc: 1\n1. He's Gonna Step On You Again - John Kongos (Step On - Happy Mondays)\n2. Woman To Woman - Joe Cocker (California Love - Tupac)\n3. Into My Own Thing - Sly &amp; The Family Stone (Weapon of Choice - Fatboy Slim)\n4. I Just Want To Celebrate - Rare Earth (Derelict - Beck)\n5. Chicago Bus Stop (Ooh I Love It) - The Salsoul Orchestra (Bentley's Gonna Sort You Out - Bentley Rhythm Ace)\n6. Satin Soul - Love Unlimited Orchestra (No Time To Play - Guru)\n7. Family Tree - Family Tree (Just Another Groove - Mighty Dub Katz)\n8. I Love You More And More - Tom Brock (Girls - Jay Z)\n9. I Likes To Do It - The People's Choice (Tread Water - De La Soul)\n10. You Did It - Ann Robinson (Gangster Trippin' - Fatboy Slim)\n11. Hot Pants Road - The JB's (Fight The Power - Public Enemy)\n12. I Forgot To Be Your Lover - William Bell (Worst Comes To Worst - Dilated Peoples)\n13. Misty Blue - Dorothy Moore (Misti Blu - Amillionsons)\n14. Aht Uh Mi Hed - Shuggie Otis (Joints And Jams - Black Eyed Peas)\n15. Supernatural Thing - Ben E King (Only One In Your Love - Botany 5)\n16. The Boss - James Brown (You Played Yourself - Ice T)\n17. Express Yourself - Charles Wright &amp; The Watts 103rd Street Rhythm Band (Express Yourself - NWA)\n18. What I am - Edie Brickell &amp; New Bohemians (Something - New Edition)\n19. Everybody's Talkin? - Nilsson (Starry Eyed Surprise - Oakenfold)\n20. Viva Tirado - El Chicano (La Raza - Kid Frost)\n21. The Human Abstract - David Axelrod (Midnight In A Perfect World - DJ Shadow)\n\nDisc: 2\n1. Blue On Blue - Gals And Pals (Step On - Royksopp)\n2. Whole Lotta Love - Ike &amp; Tina Turner (Whole Lotta Love - Goldbug)\n3. Rags &amp; Old Iron - Nina Simone (Love Story - Layo &amp; Bushwacka)\n4. Inner City Blues (Make Me Wanna Holler) - Marvin Gaye (Armand Est Mort - Mc Solaar)\n5. Wiggle Waggle - Herbie Hancock (Back By Dope Demand - King Bee)\n6. Let's Do The Latin Hustle - Klaus Wunderlich And His New Pop Organ Sound (Since I Left you - The Avalanches)\n7. Higher Ground - Ellen McIllwaine (Song For Lindy - Fatboy Slim)\n8. Light My Fire - Shirley Bassey (Mobbin' - Peanut Butter Woolf )\n9. Shack Up Pt.1 - Banbarra (Gett Off - Prince)\n10. Haven?t You Heard - Patrice Rushen (I Feel Good Things For You - Daddy's Favourite)\n11. All Night Long - Mary Jane Girls (Mary Jane - Mary J Blige)\n12. Risin' To The Top - Keni Burke (Around The Way Girl - LL Cool J)\n13. Westchester Lady - Bob James (Circles - Adam F)\n14. Shifting Gears - Johnny Hammond (In Full Gear - Stetsasonic)\n15. What A Man - Linda Lyndell (What A Man - Salt N Pepa feat. En Vogue)\n16. I'm A Good Woman - Barbara Lynn (Another Woman - Moby)\n17. House Of Mirrors - David McCallum (Dark Days - DJ Shadow)\n18. Holy Thursday - David Axelrod (Rabbit In Your Headlights - U.N.K.L.E.)\n19. Drumbeat - Jim Ingram (It Began In Afrika - Chemical Brothers)","torrent":{"xt":"urn:btih:7883ac12e84123fe2da1f61628420435084f4b1f","amp;dn":"Sampled+vol.+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7883ac12e84123fe2da1f61628420435084f4b1f","infoHashBuffer":{"type":"Buffer","data":[120,131,172,18,232,65,35,254,45,161,246,22,40,66,4,53,8,79,75,31]},"announce":[],"urlList":[]}}