{"title":"Lioness (2008) a documentary about women serving in combat in  t","uid":8065751,"size":772241523,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:78fdd735ae5473da45bf95dedb7c92ebb38fdf0c&amp;dn=Lioness+%282008%29+a+documentary+about+women+serving+in+combat+in++t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"loninappleton","files":4,"time":1359172898,"description":"Lioness (2008)\ndirected by Meg McLagan and Daria Sommers\n\nFeaturette:  Team Lioness On Capitol Hill\n\nIMDb ref:/tt1202749\n\nFrom the website description:\n\n\n\n\n\nThe website also contains information about awards for the film and a teaching guide for use in schools.\n\n\n\nMy notes.\n\n  I have torrented this film before and it seemed to be received well on file shares.  But no one of the many downloaders over at demon* have kept tit going nor can it be found elsewhere on torrents usingf the most common search engines.\n\n   At this moment of January 25th 2013 the Joint Chiefs of Staff have given approval for women in combat positions. It is rightly stated that women have been doing this for ten years.  Team Lioness consists of women fully trained in battle whose express purpose is to assist in searches of women who are captured in the war in Iraq.  \n\n   this film is not about whether the US should be in Iraq searching women for weapons.  What it is about is a group of women who, as the dvd tagline says were 'there for the action but missing from history.\n\n   Film shows both combat and stateside portraits of these women.\n\n   In this torrent I have included something that should have been in my fileshare years ago.  It is a featurette called &quot;Team Lioness On Capitol Hill.&quot;  \n\n\n   You see, these women do not get full combat pay, treatment for PTSD or battle ribbons for outstanding service.  The testimony given to Congress addresses these issues.  It is a short clip of the proceedings at about 8 minutes.\n\n   Many issues have come to the fore as to why women should be giwen full rank and duty with men.  Lioness presents many of the reasons why and perhaps that testimony 5 years ago took this long to be adopted by the military.\n\n   When I first fileshared Lioness I concluded with one phrase that still holds true: whether you are man or woman, war will change you.\n\nNotes written January 25th, 2013\n\n","torrent":{"xt":"urn:btih:78fdd735ae5473da45bf95dedb7c92ebb38fdf0c","amp;dn":"Lioness+%282008%29+a+documentary+about+women+serving+in+combat+in++t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78fdd735ae5473da45bf95dedb7c92ebb38fdf0c","infoHashBuffer":{"type":"Buffer","data":[120,253,215,53,174,84,115,218,69,191,149,222,219,124,146,235,179,143,223,12]},"announce":[],"urlList":[]}}