{"title":"Madden NFL Mobile v3.1.3 Offline data","uid":14108115,"size":68011872,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:795c5b2f88cf80883685b7b1a82af139b2d8f540&amp;dn=Madden+NFL+Mobile+v3.1.3+Offline+data&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":1,"time":1459374279,"description":"Be the playmaker in Madden NFL Mobile! Become the GM of your favorite franchise and handpick your team of NFL stars and legends. Get in the game anytime, anywhere with Live Events and Head-to-Head challenges, or battle it out all the way to the Super Bowl. This is authentic NFL action like you’ve never seen on mobile. Your Madden Season starts now!\r\n\r\nASSEMBLE YOUR DREAM TEAM\r\nSelect your favorite NFL franchise and become the GM. Load your team with current stars like Odell Beckham Jr. and Rob Gronkowski, or blockbuster legends like Bo Jackson. Acquire real NFL players from the past and present by opening packs, or through the Auction House. Upgrade your roster your own way, then take your team out on the field to compete with friends.\r\n\r\nMAKE WINNING PLAYS\r\nGo big or go home in genuine 16-game Seasons mode. Be the playmaker and run your own routes as your favorite receiver, or play as the quarterback and lead your team to the Super Bowl. Compete against friends and rivals in Head-to-Head mode, or join a League and battle it out for gridiron glory. Plus, play quick Spontaneous Challenges in any mode for boosted rewards.\r\n\r\nUP YOUR GAME IN DAILY LIVE EVENTS \r\nMadden NFL Mobile connects you to the NFL every day, all year long. Instantly tap into new challenges and incredible rewards every time you play Live Events, in-season plays, and more – all based on the real NFL season. Access Live Events faster than ever with improved navigation and even more challenges!\r\n\r\nMadden NFL Mobile brings next-generation football action straight to your fingertips. Are you ready to rise to the top?\r\n\r\nWhat’s new:\r\nHey, playmakers! We’ve made some behind-the-scenes updates to keep your gridiron game going strong. Plus, now you can rack up Google Play Achievements. Thanks for playing, and don’t forget to rate us after each update.\r\n\r\nRequired Android O/S : 3.2+","torrent":{"xt":"urn:btih:795c5b2f88cf80883685b7b1a82af139b2d8f540","amp;dn":"Madden+NFL+Mobile+v3.1.3+Offline+data","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"795c5b2f88cf80883685b7b1a82af139b2d8f540","infoHashBuffer":{"type":"Buffer","data":[121,92,91,47,136,207,128,136,54,133,183,177,168,42,241,57,178,216,245,64]},"announce":[],"urlList":[]}}