{"title":"Clutch - Elephant Riders","uid":3931863,"size":73619316,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7a18e98ed654d6fa7004d0b7d97d827a80b378fe&amp;dn=Clutch+-+Elephant+Riders&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"grim276","files":10,"time":1197526853,"description":"Like the thunder of galloping elephants, Clutch continues knocking over all obstacles in their path. You have to admire a band that shows this much maturity and smoothness in the ongoing development into a truly monstrous group. Columbia record is pulling no punches in their promotion of this band and fortunately Clutch delivers an album worthy of the attention. Streamlining a bit from their 1995 self-titled album, the band still explores their knack for writing tasty riffs and amazing grooves. Singer Neil Fallon has toned down the vocals a bit, getting away from the layered shouting of the past to a more sing-song approach that really fits the songs well. And of course his lyrics continue to be a treat. His attempt at a love song (as he puts it in the CD-ROM bonus), &quot;Green Buckets&quot;, is more of an exploration of suburbia than a typical love song. &quot;Wishbone&quot; takes a fanciful look at the Thanksgiving tradition. Meanwhile, Dan Maines and Jean-Paul Gaster continue to become a fantastic rhythm unit, while guitarist Tim Sult tastefully adds his excellent groove riffs. &quot;Crackerjack&quot; (which features the trombone of Delfeayo Marsalis, brother of Winston) is a great example of their ability to create a jam with meaning. Nearly every song here is worthy of some mention in one way or another. Certainly you could find the time in your busy day to ride with Clutch.","torrent":{"xt":"urn:btih:7a18e98ed654d6fa7004d0b7d97d827a80b378fe","amp;dn":"Clutch+-+Elephant+Riders","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a18e98ed654d6fa7004d0b7d97d827a80b378fe","infoHashBuffer":{"type":"Buffer","data":[122,24,233,142,214,84,214,250,112,4,208,183,217,125,130,122,128,179,120,254]},"announce":[],"urlList":[]}}