{"title":"CD Label Designer v3.60","uid":4335064,"size":5774014,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7a410a96c64b6cd92a31c543eaf43179e28d3cfd&amp;dn=CD+Label+Designer+v3.60&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Jodyanne","files":-1,"time":1218267160,"description":"CD Label Designer is an application that will help you to design and print CD jewel case labels, as well as round disk labels. It supports inserting images, texts and circled texts allowing you to arrange, change size, angle and transparency of objects. You can also read directory and file structure, CDDB audio CD database or define own lists to include them on labels. With template files you can pre-define number of templates for different kind of designs. Also, you can make different print layouts and exchange them with others, and you can customize printout positions.\n\n1. Complete CD Label Maker\nDesign and print\nFront covers\nInside covers (you can print it as booklet)\nBack covers (with the spines)\nRound disk labels\n\n2. Correct Size\nPrint ideal sized match for jewel-case boxes. Do not waste your time and ink with too small or too large printouts! Let this software help you to make your designs in WYSIWYG (What You See Is What You Get) manner.\n\n3. Correct Position\nDon&amp;#039;t change software if you change paper brand: you can have unlimited layouts for the unlimited brands. Print Layout is feature that let you arrange labels across the any-sized paper. Do it, save it, and use it again!\n\n4. Unleashed Creativity\nUse your imagination to astonish people. CD Label Designer will let you do that. Place image, text and circled text objects. Move, rotate, resize, make them transparent, choose fonts and colors, or put a frame around text.\n\n5. Files And Songs List Without Typing\nIncluding the content of CD on label is just one click away!\nIf it&amp;#039;s a data disk, CD Label Designer will read files and folders and place them on selected labels! Choose what you want to read and how deep in folder structure you want to go. If it&amp;#039;s an audio disk, CD Label Designer will access internet CDDB database and fill in songs list for you!\n\n6. Do Not Ignore Quality\nIf you have high-resolution printer, you surely want high-resolution printouts. CD Label Designer gives you the best you can have. It will not reduce printout quality, as some of competitive software.\nIn other words, if you put high-quality picture to a label, and print it to a high-quality printer, it will be just what you will get: high-quality printout.","torrent":{"xt":"urn:btih:7a410a96c64b6cd92a31c543eaf43179e28d3cfd","amp;dn":"CD+Label+Designer+v3.60","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a410a96c64b6cd92a31c543eaf43179e28d3cfd","infoHashBuffer":{"type":"Buffer","data":[122,65,10,150,198,75,108,217,42,49,197,67,234,244,49,121,226,141,60,253]},"announce":[],"urlList":[]}}