{"title":"Paul Krugman - The return of depression economics and the crisis","uid":4672469,"size":377740099,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7ba89008b7e9ffe3fef42985bafe6dafb920e44c&amp;dn=Paul+Krugman+-+The+return+of+depression+economics+and+the+crisis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"plasmaview","files":77,"time":1232784706,"description":"Author \tKrugman, Paul R.\n\nTitle \tThe return of depression economics and the crisis of 2008 [sound recording] / Paul Krugman.\n\nPublisher \t[S.l.] : Random House Audio, p2008.\n\nDescription \t6 sound discs (6 1/2 hr.) : digital ; 4 3/4 in.\n\nNote \tTitle from container.\n\nPerformer \tRead by Don Leslie.\n\nNote \tUnabridged.\n\nSystem details \tCompact discs.\n\nNote \tDuration: 6:30:00.\n\nSummary \tPaul Krugman reveals the striking similarities between the 2008 economic crisis and the Great Depression. Filled with Krugman's cynic wit, listeners will be shocked as they discover the gaffs and blunders that caused the most recent economic blues.\n\nEditorial Reviews\nBook Description\nWinner of the Nobel Prize in Economics\n\nProduct Description\n\nIn 1999, in The Return of Depression Economics, Paul Krugman surveyed the economic crises that had swept across Asia and Latin America, and pointed out that those crises were a warning for all of us: like diseases that have become resistant to antibiotics, the economic maladies that caused the Great Depression were making a comeback. In the years that followed, as Wall Street boomed and financial wheeler-dealers made vast profits, the international crises of the 1990s faded from memory. But now depression economics has come to America: when the great housing bubble of the mid-2000s burst, the U.S. financial system proved as vulnerable as those of developing countries caught up in earlier crises and a replay of the 1930s seems all too possible.\n\nIn this new, greatly updated edition of The Return of Depression Economics, Krugman shows how the failure of regulation to keep pace with an increasingly out-of-control financial system set the United States, and the world as a whole, up for the greatest financial crisis since the 1930s. He also lays out the steps that must be taken to contain the crisis, and turn around a world economy sliding into a deep recession. Brilliantly crafted in Krugman's trademark style--lucid, lively, and supremely informed--this new edition of The Return of Depression Economics will become an instant cornerstone of the debate over how to respond to the crisis.","torrent":{"xt":"urn:btih:7ba89008b7e9ffe3fef42985bafe6dafb920e44c","amp;dn":"Paul+Krugman+-+The+return+of+depression+economics+and+the+crisis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ba89008b7e9ffe3fef42985bafe6dafb920e44c","infoHashBuffer":{"type":"Buffer","data":[123,168,144,8,183,233,255,227,254,244,41,133,186,254,109,175,185,32,228,76]},"announce":[],"urlList":[]}}