{"title":"Jesse McCartney - Right Where You Want Me  (2nafish)","uid":5427416,"size":114923524,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7bbe1ec7e155dfb753e4bddc72867bc6ee888831&amp;dn=Jesse+McCartney+-+Right+Where+You+Want+Me++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1268304227,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Right Where You Want Me&quot; is the first single and only single released in the U.S from Jesse McCartney's second album, Right Where You Want Me. It is also the title song for the Disney Channel Original Movie Return to Halloweentown. It also appears on the Disney album Radio Disney: Party Jams. It is also audible in the video game Thrillville: Off the Rails.\n\nOn 3 August 2006, Jesse brought the world premiere of this music video to TRL.\n\nRight Where You Want Me is Jesse McCartney's second studio album, it was released on September 19, 2006 in the United States under the Hollywood Records label.\n\nRight Where You Want Me debuted at number 15 on the US Albums chart, beating the first week sales of Jesse's first album Beautiful Soul, but the success was short-lived and it failed to reach the success of his debut. The album sold approximately 268,000 copies in the United States with poor international sales (except in Taiwan and Italy where it went gold leading to the release being a seen as a &quot;sophomore slump&quot;. The album has sold over 600,000 copies worldwide going Gold in Taiwan &amp; Italy accounts to over 100,000 of the sales. In Brazil the album sold only 3,500 copies.\n\nThe first single of the same name, &quot;Right Where You Want Me&quot;, was not as successful as his debut and signature single &quot;Beautiful Soul&quot;, peaking at number thirty-three (#33) on the US Billboard Hot 100. The video for his second single &quot;Just So You Know&quot; was shot and officially released, though the single never received a full release in the US due to lack of support from his current record label, as stated in an email from Sherry, one of Jesse's managers. It did chart in several European countries though. He did have a third single called &quot;Just Go&quot; but it was only released in Italy.Following the low support, McCartney went back to the studios again writing and recording for his third album.\n\nJesse McCartney (born April 9, 1987) is an American singer-songwriter actor, and voice actor. McCartney rose to fame in the early 2000s as member of the boy band Dream Street. He branched into a solo career, having appeared in the television series Summerland and as a recurring character in the ABC Family series Greek.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:7bbe1ec7e155dfb753e4bddc72867bc6ee888831","amp;dn":"Jesse+McCartney+-+Right+Where+You+Want+Me++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bbe1ec7e155dfb753e4bddc72867bc6ee888831","infoHashBuffer":{"type":"Buffer","data":[123,190,30,199,225,85,223,183,83,228,189,220,114,134,123,198,238,136,136,49]},"announce":[],"urlList":[]}}