{"title":"Bashar - Beyond The Secret into Abundance","uid":4086237,"size":51152842,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7be32881efa26dad9df9c952a00d6ec4aefe1c5d&amp;dn=Bashar+-+Beyond+The+Secret+into+Abundance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hspinc","files":24,"time":1205828414,"description":"2 CD-Set: &lt;a href=&quot;\nhttp://www.bashar.org/catalog/recent.html#future_milestones&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bashar.org/catalog/recent.html#future_milestones&lt;/a&gt;\n\n\n6-24-07 Los Angeles, CA\n\nThis four hour session is not to be missed! In this remarkable, powerful channeling, Bashar asks &quot;How interested are you in really changing your life?&quot; Choosing to be happy for it&amp;#039;s own sake is key to creating a new life experience, but there is also a secret to &quot;The Secret&quot;! If you are frustrated in your desire to fully to create the life that you want then here is the missing ingredient that can help you fully manifest your desires.\n\nBashar explores the negative beliefs that stop us from living our ideal life and shows us how to transform even those beliefs. Once you understand how to use &quot;the secret to The Secret&quot; than you will find a rapid increase in your ability to transform old ideas and increase your vibrational state. This can then lead to the realization of your most cherished dreams.\n\nOur journey then turns to the relationship and communication between your brain, your physical mind, and your Higher Self. Balancing out this relationship and having each aspect do &quot;its respective job&quot;, will reduce stress and change your effectiveness in navigating physical reality. By understanding this key relationship in your life you can allow you Higher Self to help you create the future that is really possible for you rather than be limited by the outdated beliefs of your physical mind. This information is very new and will expand your understanding of both your Higher Self and the way you see yourself. Bashar follows with an in-depth exploration of the power of &quot;State of Being&quot; and how this can be the most important tool in your kit for transforming your life into one of maximum abundance and joy, and then leads a wonderful GUIDED MEDITATION that is focused on the power of water to transform your state of being.\n\nQ&amp;A: Attracting a new car into your life and beliefs and attitudes that are contradicting the desire. Do pyramids amplify your ability to manifest? How pyramids act as a &quot;permission slip&quot;. Detailed discussion on using visualization and altering beliefs to manifest your own home. Having multiple expressions of one&amp;#039;s highest joy. When will we be able to visit Bashar&amp;#039;s world and &quot;study abroad&quot;? Wanting to give up smoking and detoxify and having difficulty. Bashar explores using the technique of the &quot;thirteenth step&quot;. We connect with guides and download information from higher realms--how can we become a better conduit for information and how does this relationship work? Learning to communicate with other species on earth in preparation for making ET contact. Is there an advanced civilization living in the center of the earth. Is the center of the earth hollow? Are we able to override the negative consequences of toxins in our foods through our beliefs? Lucid dreaming and meeting other beings in that state. What is the purpose of these interactions? Do you have to be physical to manipulate physical reality? How can we improve our ability to coherently channel information from the higher realms? Creating physical objects that best represent geometric shapes from other levels and working with the &quot;golden mean&quot;. Why does Bashar still use a space ship? Propulsion in space craft. A new musical instrument similar to a steel drum created in 2000 and the power of this instrument to alter consciousness. Why does child abuse and war exist on our planet? How can it be used in a positive way? What is the best way to help someone that is suffering from past trauma? Concerns about metaphysics being cold and detached from human feeling. Understanding neutrality and how to use this tool. Does neutrality exist on other levels? Using color and understanding what it symbolizes when you see it in dreams.","torrent":{"xt":"urn:btih:7be32881efa26dad9df9c952a00d6ec4aefe1c5d","amp;dn":"Bashar+-+Beyond+The+Secret+into+Abundance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7be32881efa26dad9df9c952a00d6ec4aefe1c5d","infoHashBuffer":{"type":"Buffer","data":[123,227,40,129,239,162,109,173,157,249,201,82,160,13,110,196,174,254,28,93]},"announce":[],"urlList":[]}}