{"title":"David Bowie - Blackstar (2016) [24bit FLAC] vinyl","uid":13198293,"size":820469628,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7cd9f1472eee6a8dbe80b6bbccf75fdc8625b8d4&amp;dn=David+Bowie+-+Blackstar+%282016%29+%5B24bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":9,"time":1452515477,"description":"\n  David Bowie - Blackstar (2016) [24bit FLAC] vinyl\r\n\r\n  Genre: Rock\r\n  Style: Art Rock\r\n  Source: ISO Records 88875173871 European Press vinyl\r\n  Codec: FLAC\r\n  Bit rate:  2,700 kbps\r\n  Bit depth: 24\r\n  Sample rate: 96 kHz\r\n\r\n  A1 ★\r\n  A2 'Tis a Pity She Was a Whore\r\n  A3 Lazarus\r\n  B1 Sue (or in a Season of Crime)\r\n  B2 Girl Loves Me\r\n  B3 Dollar Days\r\n  B4 I Can't Give Everything Away\r\n\r\n  Rip Info: (Not my rip)\r\n\r\n  Turntabel: Rega P3 24 w/ Universal Spacer (4mm)\r\n  Cartridge: Denon DL 110\r\n  Phonoamp: Cambridge Audio 651P (MM in)\r\n  Audio Interface: Focusrite Scarlett 2i2\r\n  Audio Capturing: Adobe Audition CC\r\n  Manual Declicking: iZotope RX 3\r\n  Converting: foobar2000\r\n\r\n   AllMusic Review by Stephen Thomas Erlewine\r\n\r\n  It's difficult to separate 2016's Blackstar from The Next Day, the album David Bowie released with little warning in 2013. Arriving after a ten-year drought, The Next Day pulsated with the shock of the new -- as Bowie's first album of new material in a decade, how could it not? -- but ultimately it was grounded in history, something its cover made plain in its remix of Heroes artwork. Blackstar occasionally recalls parts of Bowie's past -- two of its key songs, &quot;Sue (Or in a Season of Crime)&quot; and &quot;'Tis a Pity She Was a Whore,&quot; were even aired in 2014 as a supporting single for the Nothing Has Changed compilation (both are revamped for this album) -- but Bowie and producer Tony Visconti are unconcerned with weaving winking postmodern tapestries; now that they've shaken free their creative cobwebs, they're ready to explore. Certainly, the luxurious ten-minute sprawl of &quot;Blackstar&quot; -- a two-part suite stitched together by string feints and ominous saxophone -- suggests Bowie isn't encumbered with commercial aspirations, but Blackstar neither alienates nor does it wander into uncharted territory. For all its odd twists, the album proceeds logically, unfolding with stately purpose and sustaining a dark, glassy shimmer. It is music for the dead of night but not moments of desolation; it's created for the moment when today is over but tomorrow has yet to begin. Fittingly, the music itself is suspended in time, sometimes recalling the hard urban gloss of '70s prog -- Bowie's work, yes, but also Roxy Music and, especially, the Scott Walker of Nite Flights -- and sometimes evoking the drum'n'bass dabbling of the '90s incarnation of the Thin White Duke, sounds that can still suggest a coming future, but in the context of this album these flourishes are the foundation of a persistent present. This comfort with the now is the most striking thing about Blackstar: it is the sound of a restless artist feeling utterly at ease not only within his own skin but within his own time. To that end, Bowie recruited saxophonist Donny McCaslin and several of his New York cohorts to provide the instrumentation (and drafted disciple James Murphy to contribute percussion on a pair of cuts), a cast that suggests Blackstar goes a bit farther out than it actually does. Cannily front-loaded with its complicated cuts (songs that were not coincidentally also released as teaser singles), Blackstar starts at the fringe and works its way back toward familiar ground, ending with a trio of pop songs dressed in fancy electronics. These don't erase the heaviness of the opening quartet but such a sequencing suggests Blackstar is difficult when the main pleasure of the record is how utterly at ease it all feels: Bowie's joy in emphasizing the art in art-pop is palpable and its elegant, unhurried march resonates deeply","torrent":{"xt":"urn:btih:7cd9f1472eee6a8dbe80b6bbccf75fdc8625b8d4","amp;dn":"David+Bowie+-+Blackstar+%282016%29+%5B24bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cd9f1472eee6a8dbe80b6bbccf75fdc8625b8d4","infoHashBuffer":{"type":"Buffer","data":[124,217,241,71,46,238,106,141,190,128,182,187,204,247,95,220,134,37,184,212]},"announce":[],"urlList":[]}}