{"title":"Michael_Schenker_Group","uid":4582868,"size":1850805605,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7d4c5bd5dd299854d237e6912ac6ff3effac24c4&amp;dn=Michael_Schenker_Group&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fulees","files":289,"time":1229500150,"description":"Career\n\nBorn in Sarstedt, Germany, Schenker has had a long career that has seen him rise to become one of the most influential and respected rock guitarists working today.[citation needed] He started playing in his early teens when his brother Rudolf brought home a Flying V guitar, which captured Michael's imagination. Schenker debuted with Scorpions on their debut album Lonesome Crow at age 16 and was lauded at the time for his mature technique.\n\nAfter Scorpions, Schenker joined upcoming UK band UFO under somewhat unusual circumstances. UFO left the UK to play some dates in Germany, and Scorpions were hired to open for them. UFO's guitarist Bernie Marsden forgot his passport and was unable to make the first gig. At the venue members of UFO spotted Michael playing a soundcheck with the Scorpions and managed to persuade him into playing that evening's show.\n\nShortly afterwards Schenker was offered the lead guitar spot in UFO and, with the blessing of his brother Rudolf, accepted it. At first, communication between Schenker and the rest of the band was difficult because he spoke virtually no English, instead relying on his girlfriend as an interpreter. Schenker has since become fluent in English.\n\nSchenker wrote the music for most of UFO's major label (Chrysalis Records) debut album Phenomenon[citation needed]. His playing on this and subsequent UFO albums attracted attention from music critics and especially from the guitar community. Schenker's melodic style and clear, articulate playing were rooted in the approach of Hank Marvin who, with his band the Shadows, was influential in establishing the electric guitar as a lead instrument. Also evident in Schenker's playing is the familiar and fundamental blues-based hard rock framework established by players like Jimmy Page, Leslie West, and Jeff Beck.[citation needed]\n\nSchenker had a turbulent career with UFO, often walking out mid-song and causing shows to be canceled. Despite having a series of successful albums and tours, Schenker finally left UFO soon after the last show of their US tour in Palo Alto, California in October 1978, and recorded during this tour live album, Strangers in the Night was already released without him.\n\nSchenker re-joined the Scorpions in late 1978, when they were recording the album Lovedrive, thus resulting in his contribution of lead guitar on 3 songs (&quot;Another Piece Of Meat&quot;, &quot;Coast To Coast&quot; and &quot;Lovedrive&quot;). In 1979, Schenker toured with the band in support of the album, but left the band 3 months later, following numerous occasions on which he could not perform on stage due to fatigue and alcohol problems. He was permanently replaced by Matthias Jabs, who had originally joined the Scorpions before Schenker's return, and recorded the rest of the lead guitar for the album.\n\nSchenker auditioned for Aerosmith (detailed in their biography Walk This Way) and Ozzy Osbourne. Osbourne said in a 1982 Hit Parader interview that he did contact Schenker following the death of Randy Rhoads:\n\nIt so happens I did contact Michael Schenker, but he wanted a king's ransom before he'd do anything...I don't need that annoyance.\n\nSchenker decided he wanted to play his own music and not be a hired hand for another band. In 1979, he founded the Michael Schenker Group.\n\nThe history of MSG is strewn with personality conflicts and incidents between band members. In 1982, original vocalist Gary Barden, who sang on the first two studio albums, The Michael Schenker Group and M.S.G. as well as the band's third release (the live album One Night at Budokan) was fired in favor of Graham Bonnet (Rainbow, Alcatrazz).\n\nBonnet lasted one album (Assault Attack) and was fired from the band because he often lost his voice during shows, although the actual firing happened after dropping his pants in a warm-up gig in Sheffield before the Reading Festival. Barden was called in at the last minute and did the show with only a few hours rehearsal and opening the appearance with the words: &quot;surprise surprise&quot;. Although many fans proclaimed Assault Attack as being MSG's best recording, Barden was enticed back to the band for Reading[1] and stayed with MSG for the recording of a new studio album (Built to Destroy) and the band's second live album (Rock Will Never Die).\n\nIn 1990 Schenker briefly played guitar for the band Ratt appearing on their MTV Unplugged performance, filling in for a sick Robbin Crosby.\n\nAfter Barden's second departure, Schenker reorganized the band around himself and new vocalist Robin McAuley as the McAuley Schenker Group and steered the group to a more commercial hard rock sound. After three albums with the lineup, Schenker and McAuley parted company.\n\nRejoining UFO for their reunion album Walk on Water, Schenker toured with the band briefly, before a fight between Schenker and vocalist Phil Mogg ended the reunion.\n\nSchenker then resurrected the Michael Schenker Group with all new members and recorded three more albums, The Unforgiven and Written in Sand. The group toured yearly around the United States and Europe.\n\nHe later rejoined UFO for two further releases, Covenant and Sharks.\n\nSchenker fell on hard times in the early 2000s after his divorce in which he lost rights to his own music, his Mercedes, and his prized Flying V guitars, which was detailed in an April 2004 interview with Guitar World magazine. He picked himself up and got back to the business of making and performing music, recording the album Arachnophobiac and supporting it with two years of touring.\n\nIn 2004, Dean Guitars began producing a Schenker signature Dean V (with subtle differences from the Gibson, but still displaying the split black and white trademark Schenker finish) and Michael now plays Dean guitars almost exclusively.\n\n2005 brought the 25th anniversary of the Michael Schenker Group. Schenker put together a new album of songs called Tales of Rock'n'Roll to celebrate the anniversary and enlisted singers from each iteration of the band to sing on the album.\n\nAfter nearly-disastrous North American and European tours in 2007, which saw cancelled shows and less-than-stellar performances, Michael regained his composure and hit the road in the UK as Michael Schenker &amp; Friends in 2008. Shows in this tour have received rave reviews and show Michael once again at his best. Early 2008, Michael worked with Gary Barden, Don Airey, Simon Phillips and Neil Murray on a new MSG's album In the Midst of Beauty, which was released in May 2008.\n\nMichael has recently announced that the touring band for the 2008 MSG tour will feature former MSG members, Chris Glen on bass and Wayne Findley on guitar &amp; keyboards and Chris Slade (The Firm, AC/DC) on drums.\n\n\nDiscography\n\n\nwith Scorpions\n\nLonesome Crow (1972)\nLovedrive (1979)\n\n\nwith UFO\n\nPhenomenon (1974)\nForce It (1975)\nNo Heavy Petting (1976)\nLights Out (1977)\nObsession (1978)\nStrangers in the Night (1979)\nThe Best Of (1992)\nWalk on Water (1995)\nCovenant (2000)\nSharks (2002)\n\n\nwith Michael Schenker Group/McAuley Schenker Group\n\nThe Michael Schenker Group (1980)\nM.S.G. (1981)\nOne Night at Budokan (1981)\nAssault Attack (1982)\nBuilt To Destroy (1983)\nRock Will Never Die (1984)\nPerfect Timing (McAuley Schenker Group) (1987)\nSave Yourself (McAuley Schenker Group) (1989)\nM.S.G. (McAuley Schenker Group) (1992)\nNightmare : The Acoustic M.S.G. (McAuley Schenker Group) (1992)\nThe Essential Michael Schenker Group (Best Of-style compilation, 1992)\nM.S.G. Unplugged (McAuley Schenker Group) (1993)\nWritten in the Sand (1996)\nThe Michael Schenker Story Live (1997)\nThe Unforgiven (1999)\nThe Unforgiven World Tour (2000)\nBe Aware Of Scorpions (2002)\nArachnophobiac (2003)\nHeavy Hitters (2005)\nTales of Rock'n'Roll (2006)\nIn the Midst of Beauty (2008)\n\n\nSolo\n\nThank You (1993)\nThank You 2 (1998)\nAdventures of the Imagination (2000)\nThe Odd Trio (2000)\nThank You 3 (2001)\nDreams And Expressions (2001)\nThank You 4 (2003)\nDoctor, Doctor: The Kulick Sessions (2008)\n\n\nOther Schenker projects\n\nContraband (1991)\nThe Plot (2003)\nUnder Construction (2003)\nSchenker-Pattison Summit - The Endless Jam (2004)\nSchenker-Pattison Summit - The Endless Jam Continues (2005)\nSiggi Schwarz and Michael Schenker - Live Together 2004\n\n\nVideography\n\nMichael Schenker Group - Rock Will Never Die (1984)\nMichael Schenker Group - Live in Tokyo 1997 (1997)\nMichael Schenker Group - World Wide Live 2004 (2004)","torrent":{"xt":"urn:btih:7d4c5bd5dd299854d237e6912ac6ff3effac24c4","amp;dn":"Michael_Schenker_Group","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d4c5bd5dd299854d237e6912ac6ff3effac24c4","infoHashBuffer":{"type":"Buffer","data":[125,76,91,213,221,41,152,84,210,55,230,145,42,198,255,62,255,172,36,196]},"announce":[],"urlList":[]}}