{"title":"Michael Marcus Trio - Ithem (2004)","uid":6629851,"size":295417876,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7d91c7ce29fc3bd78b44d0353c3b4fdf29faebc7&amp;dn=Michael+Marcus+Trio+-+Ithem+%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mariorg","files":-1,"time":1314288973,"description":"Ayler Records: aylCD-006 &lt;a href=&quot;\nhttp://www.ayler.com/michael-marcus-trio-ithem.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ayler.com/michael-marcus-trio-ithem.html&lt;/a&gt;\n\n* Michael Marcus (as, bcl): alto saxophone, bass clarinet\n* William Parker (b): bass\n* Denis Charles (dr): drums\n\nHomepage:\n~~~~~~~~ &lt;a href=&quot;\nhttp://www.michaelmarcusjazz.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.michaelmarcusjazz.com/&lt;/a&gt;\n\nReview\n~~~~~~ &lt;a href=&quot;\nhttp://www.allmusic.com/album/ithem-r694544&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/ithem-r694544&lt;/a&gt;\nby Steve Loewy\n\nIt is curious that this 1993 trio recording, not released until 2004 on the\nSwedish label Ayler Records, should be such a substantial addition to the\ndiscography of American reed player Michael Marcus. There are actually two\ndistinct recording sessions represented, the first three tracks from a concert\nat the Knitting Factory, and the final two shorter tracks, with slightly\ninferior sound quality, from a studio recording earlier in the year. What makes\nit all so special, though, and superior to much of Marcus' other recorded work,\nis the raw though focused quality of his blowing, both on alto sax and bass\nclarinet, inspired by the backing of two great jazz accompanists, bassist\nWilliam Parker and drummer Denis Charles. Marcus seems relaxed, exploring and\nexperimenting, totally in synch with his colleagues. He does not appear too\nconcerned about arrangements or the particularities of the group sound; instead,\nhe plays his quirky heads and simply blows at length, revealing what a\nwonderfully creative player he can be when he is in top form, as he is\nthroughout. Perhaps Marcus never thought that these recordings would be released\ncommercially and, as a result, he relaxed and stretched out with an emotional\nwarmth both varied and intense, never looking back. His work on bass clarinet is\nparticularly impressive. On &quot;Here At!,&quot; for example, his bass clarinet rubs\nagainst Parker's string bass, mining the lower tones, producing some beautiful\nsounds. The variety of rhythms and the attractive angular melodies trace a line\nto Monk and Ayler, retaining an essentially mellisonant core without sacrificing\na radical sensibility. The trio retains the singularity of the jam session with\nan off-the-cuff informality, so that the solos sing with a propulsive\nabandon. As a result, this album is a good place to introduce (or reacquaint)\nlisteners to a lesser-known, though powerfully driven reed player and leader\nwith some remarkable talents.","torrent":{"xt":"urn:btih:7d91c7ce29fc3bd78b44d0353c3b4fdf29faebc7","amp;dn":"Michael+Marcus+Trio+-+Ithem+%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d91c7ce29fc3bd78b44d0353c3b4fdf29faebc7","infoHashBuffer":{"type":"Buffer","data":[125,145,199,206,41,252,59,215,139,68,208,53,60,59,79,223,41,250,235,199]},"announce":[],"urlList":[]}}