{"title":"Charles W Moore - 2001 - Selected Essays - You Have to Pay for t","uid":11285724,"size":5398763,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7de51ff94dcce0bbb887a2c8d131867bdb75d777&amp;dn=Charles+W+Moore+-+2001+-+Selected+Essays+-+You+Have+to+Pay+for+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Inua1","files":1,"time":1414277172,"description":"You Have to Pay for the Public Life: Selected Essays of Charles W. Moore April 23, 2001\nby Charles W. Moore (Author), Kevin Keim (Editor)\n\nArchitect Charles Moore (1925-1993) was not only celebrated for his designs; he was also an admired writer and teacher. Though he wrote clearly and passionately about places, he was perhaps unique in avoiding the tone and stance of the personal manifesto. Through his buildings, books, and travels, Moore consistently sought insights into the questions that always underlie architecture and design: What does it mean to make a place, and how do we inhabit those places? How do we continue to build upon but respect the landscape? How do we reconcile democracy and private land ownership? What is original? What is taste? What is the relationship between past and present? How do we involve inhabitants in making places? Finally, what is public life?\n\nAs the world becomes smaller, and the uniqueness of places and landscapes gives way to sameness, Moore's celebration of the vernacular and of the surprising are more relevant than ever.The pieces in this book span the years 1952 to 1993 and engage a myriad of topics and movements, such as contextualism, community participation, collaboration, environmentally sensitive design, and historic preservation. The essays in this book reflect as well Moore's scholarship, humanism, urbanity, and great wit.\n\nISBN-10: 0262133733\nISBN-13: 978-0262133739","torrent":{"xt":"urn:btih:7de51ff94dcce0bbb887a2c8d131867bdb75d777","amp;dn":"Charles+W+Moore+-+2001+-+Selected+Essays+-+You+Have+to+Pay+for+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7de51ff94dcce0bbb887a2c8d131867bdb75d777","infoHashBuffer":{"type":"Buffer","data":[125,229,31,249,77,204,224,187,184,135,162,200,209,49,134,123,219,117,215,119]},"announce":[],"urlList":[]}}