{"title":"Fresh-Baked Mystery Series by Livia J Washburn","uid":12977882,"size":2626395,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7ead317966444f45d1737426a23fc87c91c5eb26&amp;dn=Fresh-Baked+Mystery+Series+by+Livia+J+Washburn&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":8,"time":1450005787,"description":"Livia J Washburn's first story was published in 1978 in Mike Shayne Mystery Magazine. Her first novel was published in '83 by Fawcett as by Livia James. In the eighties she had several westerns published in hardback by M. Evans, while she was writing mysteries for TorBooks under her maiden name Washburn. It wasn't until recently that Livia went back to her first love, mysteries with the October 2006 release of A PEACH OF A MURDER\r\n\r\n1. A Peach of a Murder \r\nAll year round, retired schoolteacher Phyllis Newsom is as sweet as pie peachpie, of course, made with Parker County peaches, the sweetest in the state of Texas. All year, that is, except during the Peach Festival whose blue ribbon has slipped through Phyllis's fingers more than once....\r\nEveryone's a little shaken when the corpse of a no-good local turns up underneath a car in his own barn. But even as Phyllis engages in some amateur sleuthing, she won't let it distract her from outbaking her rivals and winning the upcoming Peach Festival contest.\r\nShe and all the other contestants guard their secret original recipes with their lives--and talk a whole lot of trash. With her unusual spicy peach cobbler, Phyllis hopes to knock 'em dead. But that's just an expression--never in her wildest dreams does she think her cobbler will actually kill a judge. Now she's suspected of murder, and she's got to bake this case wide open....\r\n\r\n2. Murder By the Slice \r\nRetired schoolteacher Phyllis Newsom's scrumptious baked creations are known throughout Weatherford, Texas, for many things, but being healthy isn't one of them. So this year's contest should be quite a challenge, because even though the entries must be low-cal and low-fat, Phyllis will never, ever scrimp on taste....\r\nYou catch more flies with honey than with vinegar. Unfortunately, nobody ever told Shannon Dunston, despotic president of Oliver Loving Elementary's Parent-Teacher Organization. With Shannon at the helm of the upcoming fund-raising carnival, Phyllis Newsom and her friends agree that they wouldn't mind if she were to go to a much hotter place than Texas....\r\nEven though the carnival fare is heart-healthy, Shannon won't get a chance to see the benefits after someone stabs her in the chest in a school hallway. Distraught, Phyllis learns she may have used the knife that killed Shannon and that it left incriminating traces of frosting on the corpse. Now clearing her name will be no piece of applesauce-and-granola cake...\r\n\r\n3. The Christmas Cookie Killer \r\nIt's Christmastime in Weatherford, Texas, and retired teacher, amateur sleuth, Phyllis Newsom is looking forward to finishing up what has been one unlucky year. But she won't be hanging up her apron quite yet, because this year's Christmas bake-off is going to be cutthroat.\r\nPhyllis would like to think she's entering the Christmas cookie contest just for fun. But that's not exactly true. She can't imagine anyone beating her delicate snowflake-shaped lime sugar cookies, although her neighbor Mrs. Simmons gingerdoodles might give her a run for her money.\r\nThen, during her annual Christmas cookie exchange Phyllis heads over to elderly Mrs. Simmons's home and finds the poor thing in a pile of lime sugar cookies, strangled by the belt of her own bathrobe. With a number of names on Santa's naughty suspect list, this case is a cookie Phyllis mea to crumble","torrent":{"xt":"urn:btih:7ead317966444f45d1737426a23fc87c91c5eb26","amp;dn":"Fresh-Baked+Mystery+Series+by+Livia+J+Washburn","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ead317966444f45d1737426a23fc87c91c5eb26","infoHashBuffer":{"type":"Buffer","data":[126,173,49,121,102,68,79,69,209,115,116,38,162,63,200,124,145,197,235,38]},"announce":[],"urlList":[]}}