{"title":"Secret Winow (2004) [1080p]","uid":9856215,"size":1552494286,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:7f23775b0d2e32827739c02a0975fcb2f9959225&amp;dn=Secret+Winow+%282004%29+%5B1080p%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"akmama4lyfe","files":2,"time":1396223355,"description":"Famed mystery writer, Mort Rainey (Johnny Depp) is confronted by a mysterious stranger outside his house. This stranger calls himself John Shooter (John Turturro) and claims that Mort has stolen an idea for a story from him. Mort says he can prove he wrote his first, but whilst Mort waits for the evidence to appear, Shooter starts to become more and more violent.\n\nAt first, Mort regards Shooter as mentally ill and throws away the book. But his housekeeper (Joan Heney) takes it out of the garbage believing it was his and instead of throwing it away again he cannot stop thinking about it, and finally reads it. It is almost exactly alike, with different names and sentence arrangements. The movie follows Mort's struggles to prove conclusively to Shooter and to himself that he has not plagiarized the story. Shooter continually harasses Mort and later kills his dog, an Australian Cattle Dog named Chico. As the story progresses, Mort hires a private investigator (Charles S. Dutton) and asks the help of the local sheriff, Dave Newsome (Len Cariou), who doesn't believe him. The investigator asks if there are any witnesses, and Mort remembers a local man saw them together. But Shooter then murders both the investigator and the man and leaves them in a car. Mort then pushes the car into the river, since he thinks the murders will be pinned on him (&quot;him&quot; is Mort, [I point this out because the latest editor didn't use proper grammar]). Shooter also burns down the house of Mort's soon-to-be ex-wife. Mort is convinced that Ted is the culprit responsible for the burning.\n\nMort eventually locates the magazine that proves he published &quot;Secret Window&quot; before Shooter wrote &quot;Sowing Season.&quot; He goes to the post office, where he gets the story. But when he gets out of his car, the sheriff approaches him with a smirk asking him if he could ask a few questions. Mort then leaves. But when Mort gets the magazine, he finds that the story has been cut out. Mort's inner voice tells him that since the magazine was sent to him in a sealed UPS package, Shooter could not have tampered with it. Prompting from his own conscience leads Mort to the realization that Shooter is not real, only a figment of Mort's imagination brought so vividly to life through undetected dissociative identity disorder to personify the dark side of Mort's personality and to commit acts that Mort himself feels he could not commit (murder and arson). (This scene includes the moment where Mort sees his back, instead of his front, reflected in the mirror above the mantelpiece - much like Magritte's 1937 painting La reproduction interdite). During this revelation, his concerned wife drives up to his cabin, and at that instant he changes his persona from the well-meaning Mort to the murderous Shooter. When his wife walks in he is gone. She starts searching the house for Mort and finds an almost empty bottle of Jack Daniels on a table. We later learn that when influenced by Jack Daniels, Mort's second personality &quot;Shooter&quot; comes alive. All over the walls she sees inscriptions of the word &quot;shooter&quot;. She realizes after Mort reveals himself that &quot;shooter&quot; actually means &quot;shoot her&quot;. After she realizes this she tries to run away but Mort is too quick for her. He then kills his wife and her lover, Ted (Timothy Hutton), with a shovel and buries them in a garden where he later plants a crop of corn. Afterwards, Mort changes profoundly - his writer's block is finally over and his passion for life returns. The movie, however, ends on a rather sinister note. The local sheriff informs Mort that he knows what he did and as soon as they find the bodies, he'll go to prison. Mort dismisses the statement nonchalantly, and replies that &quot;The ending is the most important part of the story. This one is very good. This one is perfect.&quot; It is then revealed to the audience that the bodies are buried under the corn feild. ","torrent":{"xt":"urn:btih:7f23775b0d2e32827739c02a0975fcb2f9959225","amp;dn":"Secret+Winow+%282004%29+%5B1080p%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f23775b0d2e32827739c02a0975fcb2f9959225","infoHashBuffer":{"type":"Buffer","data":[127,35,119,91,13,46,50,130,119,57,192,42,9,117,252,178,249,149,146,37]},"announce":[],"urlList":[]}}