{"title":"Ozark Mountain Daredevils - Men From Earth","uid":4082909,"size":81119790,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7f281f3ca6485bac965eb464039f3404b71374cb&amp;dn=Ozark+Mountain+Daredevils+-+Men+From+Earth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bocin1","files":16,"time":1205654794,"description":"The Ozark Mountain Daredevils were among the more popular of mid-&amp;#039;70s country-rock outfits, slotting in chronologically and stylistically between\nthe Eagles and Firefall. As exponents of &amp;#039;70s country-rock, the group rode a wave of success for five years on A&amp;M Records and survived in some form into the 1990s, with a following just large enough to justify occasional record releases in their later years.\n\nThe sextet was formed in Missouri during the early &amp;#039;70s, consisting of guitarists John Dillon and Steve Cash, blues harpist/singer/guitarist Randle Chowning, drummer/guitarist/singer Larry Lee, keyboard player Buddy Brayfield, and bassist-vocalist Michael Granda, and was signed to A&amp;M Records in 1973. Their first album, recorded under the supervision of producer Glyn Johns (who had also worked with the Eagles), was a critical success and yielded a Top 30 hit in &quot;If You Want to Get to Heaven.&quot; A year later, they had the biggest hit in their history, &quot;Jackie Blue,&quot; a mellow piece of country-rock that got to number three on the charts and still gets played occasionally as a &amp;#039;70s oldie. They had an ethereal edge to their sound and songs that made them especially appealing to college-age listeners during the middle of the decade. Their self-titled debut album set the tone for the group&amp;#039;s next four releases, although by 1978&amp;#039;s Don&amp;#039;t Look Down, the sound was somewhat closer to country-pop than country-rock. Collegiate girls and their boyfriends could relate to them, and a sense of humor didn&amp;#039;t hurt (their third LP, The Car Over the Lake Album had cover art featuring -- you guessed it -- a car over a lake).\n\nLee, Dillon (who later played with fellow Daredevil Steve Cash on the Waylon Jennings/Jessi Colter White Mansions concept album), and Chowning authored most of the songs that anyone knows (&quot;Jackie Blue,&quot; &quot;Following the Way I Feel,&quot; &quot;Fly Away Home&quot;). The group enjoyed success primarily on FM radio from 1973 until 1978, and were popular enough to justify the recording and release of a double-LP concert album -- they switched labels to CBS in 1980, losing Lee and Chowning by the end of the decade but picking up Buddy Emmons on steel guitar and Rune Walle on mandolin. The group ceased recording activity in the 1980s, but re-formed and began making records again in the mid-&amp;#039;90s, and there have been some surprising (and very rewarding) archival releases devoted to their work, including early sessions (in which they were at their purest country and bluegrass) and a reunion concert. All of their A&amp;M library has reappeared on CD (some more than once, with upgrades), especially in Europe, and as of 2007 the group was still playing shows to enthusiastic audiences in and around Missouri.\n\nMen From Earth was the group&amp;#039;s last fully succesful record, mixing soft, romantic sounds (&quot;You Know Like I Know&quot;) dressed up in restrained, tasteful orchestrations with harder country sounds (&quot;Homemade Wine&quot;). &quot;Fly Away Home&quot; is probably the best rock number here, and also has room for some very pretty noodling on the mandolin.\n\nYear Recorded: 1976\nLabel: A&amp;M Records\nProducer: David Anderle\nThe Band:\n* Buddy Brayfield - piano, electric piano ,organ, oboe\n* Steve Cash - harp, vocals\n* Rune Walle - guitars, mandolin, sitar\n* John Dillon - guitars, mandolin, harp, vocals\n* Mike Granda - bass\n* Larry Lee - drums, accoustic guitar, synthesizer, vocals\nThe Songs:\n1. Fly Away Home\n2. You Know Like I Know\n3. Breakaway (From Those Chains)\n4. The Red Plum\n5. Mountain Range\n6. Watermill\n7. Noah\n8. It&amp;#039;s How You Think\n9. Arroyo\n10. Homemade Wine\n\nThe following tracks were originally on the second &quot;Little Red Record&quot;, which was issued in limited quantities with the original vinyl LP.  However, they are included with the CD version:\n1. A Dollar&amp;#039;s Worth Of Regular\n2. Roscoe&amp;#039;s Rule\nAlso included on the CD version is &quot;Better Days&quot;. This was the B-Side cut of the original &quot;Jackie Blue&quot; 45 RPM record, previously unreleased on any album or CD.\n\nRipped from cd to mp3 vbr @320kbs\n\nEnjoy!!!!!!!!!!!!\n\n\n","torrent":{"xt":"urn:btih:7f281f3ca6485bac965eb464039f3404b71374cb","amp;dn":"Ozark+Mountain+Daredevils+-+Men+From+Earth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f281f3ca6485bac965eb464039f3404b71374cb","infoHashBuffer":{"type":"Buffer","data":[127,40,31,60,166,72,91,172,150,94,180,100,3,159,52,4,183,19,116,203]},"announce":[],"urlList":[]}}