{"title":"AMBER: Journeys Beyond (rare game)","uid":3976916,"size":602855839,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:80af7ef9932c332663c6ca48d78bab0f84ca0d6f&amp;dn=AMBER%3A+Journeys+Beyond+%28rare+game%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"luizfalves","files":2,"time":1200330112,"description":"AMBER: Journeys Beyond is an adventure game released in 1996 and the only game produced by Hue Forest Entertainment.\n\nAlthough it had not much attention at the time (making the game to not have a bigger publisher) it received many praises from gamers and critics and specially a renewed interest in tha last years, which gave the title a cult following. Many gamers today regard AMBER as one of the best adventure games ever.\n\n---------------------------------------------\n\nAMBER is an adventure game presenting a suspenseful horror ghost story and following the guidelines of a Myst-like first-person adventure, yet, at the same time, offering some unique features of it&amp;#039;s own.\n\nAMBER is short for Astral Mobility By Electromagnetic Resonance device invented by a promising scientist in the field of paranormal activities, Dr. Roxanna. In order to conduct the experimental testings of the device she secludes herself into an abandoned mansion, rumored to be haunted by ghosts and spirits. In her research Roxanna confirms those rumors, however, fails to respond on numerous phone calls. Her friend, Joe, presumes that something might has happened to her and asks you, the player, to investigate.\n\nIn order to help Roxy and the spirits of the house, you will have to use the AMBER device, that will provide you with the ability to experience ghost&amp;#039;s stories in form of the lucid dreams. Each dream will be presented in the unique stylistic presentation. For example a sequence involving the death of the girl living in 1940s will be presented in B&amp;W with lots of period music in the background. Once you&amp;#039;ve investigated the cause and the circumstances of each spirit&amp;#039;s torments you finally will be able to help Roxy herself.\n\nAlthough, the game does require player to solve as inventory-based puzzles so as the Myst-like mechanical and mathematical puzzles, the emphasis is more on the exploration and presentation of the story. For instance, all &quot;ghost&quot; parts of the game have neither inventory nor items to collect. So the key element of the gameplay is exploring environments in order to advance the plot by revealing crucial information as to to the reasons of ghost&amp;#039;s bond to the world of the living.\n\n---------------------------------------------\n\nAdventure Gamers - 4.5 / 5.0\nAdventure Classic Gaming - 5 out of 5\nGameSpot - 7.4\nMobyGames - 79\n\n---------------------------------------------\n\nAs of now, there is no known way of running this game in Windows XP. Many forum users on the internet try to tweak the files and create alternatives, but it seems the only way is having either a virtual PC or a multi-boot with Windows 98.\n\nThis is a rare game, hard to find on retail or the net: this is why I encourage you to download it and try to figure out how to run it in newer OSs. Then you could, I dunno, upload your own XP patched version and become a hero in the adventuring community.","torrent":{"xt":"urn:btih:80af7ef9932c332663c6ca48d78bab0f84ca0d6f","amp;dn":"AMBER%3A+Journeys+Beyond+%28rare+game%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80af7ef9932c332663c6ca48d78bab0f84ca0d6f","infoHashBuffer":{"type":"Buffer","data":[128,175,126,249,147,44,51,38,99,198,202,72,215,139,171,15,132,202,13,111]},"announce":[],"urlList":[]}}