{"title":"Sermons on Hell - Dr. Peter S. Ruckman","uid":11773652,"size":639540,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:81a5f29a63cca080b3837311acd353176e4d23cc&amp;dn=Sermons+on+Hell+-+Dr.+Peter+S.+Ruckman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427179425,"description":"This book is a collection of five illustrated evangelistic sermons which Dr. Ruckman has preached on the subject of Hell.\nThe titles are:\n-&quot;The Terrible Text&quot;\n-&quot;Heaven and Hell&quot;\n-&quot;A Letter from Hell&quot;\n-&quot; Five Surprises in Hell&quot;\n-&quot;The End of the Sinner&quot;\n\nIn these messages, Dr. Ruckman covers what the Bible says about the reality of Hell, why a person goes there, what he can expect there, how to avoid that awful place, and what the Christian should do in light of all that. It is an excellent tool for showing the unbeliever exactly what is awaiting him after death.\n\n\nAbout the author:\nDr. Peter S. Ruckman received his Bachelor of Arts degree from the University of Alabama and finished his formal education with six years of training at Bob Jones University (four full years and two accelerated summer sessions), completing requirements for the Master of Arts and Doctor of Philosophy degree.\nReading at a rate of seven hundred words per minute, Dr. Ruckman had managed to read about 6,500 books before receiving his doctorate, and he still reads an average of a book each day.\nDr. Ruckman stands for the absolute authority of the Authorized Version and offers no apology to any recognized scholar anywhere for his stand. In addition to preaching the gospel and teaching the Bible, Dr. Ruckman has produced a comprehensive collection of apologetic and polemic literature and resources supporting the authority of the Authorized Version of the Holy scriptures","torrent":{"xt":"urn:btih:81a5f29a63cca080b3837311acd353176e4d23cc","amp;dn":"Sermons+on+Hell+-+Dr.+Peter+S.+Ruckman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81a5f29a63cca080b3837311acd353176e4d23cc","infoHashBuffer":{"type":"Buffer","data":[129,165,242,154,99,204,160,128,179,131,115,17,172,211,83,23,110,77,35,204]},"announce":[],"urlList":[]}}