{"title":"Oblivion.720p.mp4.hardcore74.mp4","uid":8928217,"size":915607173,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:81a989470a832d670e1ed47fd40daf185d189045&amp;dn=Oblivion.720p.mp4.hardcore74.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hardcore74","files":1,"time":1379407339,"description":"In the year 2077, Tech 49 Jack Harper (Tom Cruise) is one of the last drone repairmen stationed on Earth. Jack tells us that the planet was nearly destroyed sixty years ago, during a war against a race of alien invaders known as Scavengers (&quot;Scavs&quot;). The Scavs destroyed the moon, causing massive earthquakes and tsunamis, and then launched their invasion. They were only defeated by the use of nuclear weapons, which left most of the planet irradiated and uninhabitable. The few surviving humans migrated to a large space station called the &quot;Tet,&quot; a massive tetrahedral space station that orbits the Earth, which is powered using energy harvested on Earth by giant ocean-borne power stations that generate fusion power from seawater before migration to Titan, one of Saturn's moons. From Tower 49, a base standing above the remains of the northeastern United States, Jack and his partner and lover Victoria &quot;Vika&quot; Olsen (Andrea Riseborough) work as a team to maintain the autonomous drones that defend the power stations from the few remaining Scav bandits. They receive their orders from Sally (Melissa Leo), their mission commander, who is stationed on the Tet. Jack flies recon and repair missions to the surface, while Vika supervises from Tower 49, a home at around 3000 feet (1000 meters) above sea level. The two expect to leave Earth and join the other survivors on the Tet in two weeks. Although Jack and Vika had their memories wiped five years earlier for security reasons, Jack has recurring dreams about meeting a mysterious woman at the Empire State Building before the war - which was before he was born.","torrent":{"xt":"urn:btih:81a989470a832d670e1ed47fd40daf185d189045","amp;dn":"Oblivion.720p.mp4.hardcore74.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81a989470a832d670e1ed47fd40daf185d189045","infoHashBuffer":{"type":"Buffer","data":[129,169,137,71,10,131,45,103,14,30,212,127,212,13,175,24,93,24,144,69]},"announce":[],"urlList":[]}}