{"title":"DVDFab 9.0.4.5 Final (2-click run)(registred)","uid":8564691,"size":54116158,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:830309a572553e224de449092764891cc297e134&amp;dn=DVDFab+9.0.4.5+Final+%282-click+run%29%28registred%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1370974242,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a '2-click run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nSystem Requirements:\n - Windows 8/7/Vista/XP(32/64 bit)\n - Pentium II 500 MHz\n - 256 MB of RAM\n - 10 GB of Free Hard Disk Space\n - A DVD-R(W) or DVD+R(W) Drive\n\nDVDFab 9.0.4.5 Updated!\n New: Added support to rip Blu-ray and DVD with DTS audio to mp4 file.\n Fix: A messy code displays problem when installing DVDFab in Swedish.\n Fix: Some localization problems.\n Fix: A problem that FabRegOp.exe pops up twice when launching DVDFab and UAC is open.\n Fix: A crash problem when previewing with DirectShow engine and DXVA decoder is enabled.\n Fix: A crash problem when previewing with Internal engine in certain cases.\n Fix: A problem that DVDFab should not read and analyze blank Blu-ray or DVD disc when user insert a blank disc to driver.\n Fix: A problem that should not save the settings after clicked cancel button on Common Settings page.\n Fix: A problem that should not allow user drop &amp; drag source in home page.\n Fix: A problem that cannot delete task when cancelling burning task in Copy and Creator.\n Fix: A problem that cannot play back the ripped files by QuickTime.\n Fix: An error 1010/1000 problem when copying Blu-ray 3D disc in certain cases.\n Fix: A crash problem when ripping Blu-ray with 3d.mkv.h264.audiocopy profile, such as: HUGO_3D.iso.\n Fix: Improved the accuracy of calculation for copying Blu-ray video output bitrate.\n Fix: An oversize problem when copying Blu-ray 3d disc to BD25 in certain cases.\n Fix: A crash problem when copying Blu-ray 3D disc to BD25 in certain cases, such as: Megamind_3D, Life of Pi_3D, Adventures of Tintin_3D and Ice Age Continental Drift_3D.\n Fix: A freeze at beginning problem when ripping and Intel Quick Sync decoder and encoder are enabled.\n Fix: A problem that the language of subtitle is ?Ã‡Â£Null?Ã‡Â¥ when playing the ripped mkv file, if the subtitle output mode is set to ?Ã‡Â£Remux into file?Ã‡Â¥.\n Fix: A problem that slight electric sound in the left audio channel when playing back the ripped file which is made for Galaxy Note II profile.\n Fix: A problem that the ripped mp4.h264.aac files cannot be opened by DVDFab.\n\nHomepage: www.dvdfab.com","torrent":{"xt":"urn:btih:830309a572553e224de449092764891cc297e134","amp;dn":"DVDFab+9.0.4.5+Final+%282-click+run%29%28registred%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"830309a572553e224de449092764891cc297e134","infoHashBuffer":{"type":"Buffer","data":[131,3,9,165,114,85,62,34,77,228,73,9,39,100,137,28,194,151,225,52]},"announce":[],"urlList":[]}}