{"title":"Fate_Unlimited_Codes_USA_PSP-EMiNENT","uid":10218454,"size":466842950,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:8435c0456b05745b1f836c0e377e41b2e10481ba&amp;dn=Fate_Unlimited_Codes_USA_PSP-EMiNENT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1400996244,"description":"                            EMiNENT\n     ::                     PRESENTS                            ::\n                                                                \n     ||               Fate/Unlimited Codes                      ||\n     ||                                                         ||\n     ||                                                         ||\n     ||        .: ::    RELEASE SPECIFICATIONS!    :: :.        ||\n     ||        :                                       :        ||\n     ||    .   :  Company ......: Capcom               :   .    ||\n     ||        :                                       :        ||\n     ||   .:   :  Origin .......: USA                  :   :.   ||\n     ||  //|   :  System .......: PSP                  :   |\\  ||\n     || // |   :  Released .....: September 4th, 2009  :   | \\ ||\n     |.//  |   :                                       :   |  \\.|\n.    |//   |   :  Supplier......: Jeromicus Mathicus   :   |   \\|    .\n     :/    |   .  Format .......: *.iSO                .   |    :\n:    /     |      # of Files ...: 15x33                    |         :\n|__ /______|   .  Filename .....: em-fuc               .   |_____  __|\n|  /                                                                 |\n| /                                                                  |\n|/                                                                   |\n      \n\n\n Based on the visual novel Fate/Stay Night, Fate/Unlimited Codes takes \n place in a local town in Japan where 7 pairs of 'Masters' and 'Servants' \n compete for the 'Holy Grail' that will grant them any wish. The game \n features a deep roster of characters and unique fighting moves, while \n employing a fast-paced, weapons-based fighting system.\n\n For those feeling confident enough to take on some competition, \n Fate/unlimited codes supports local wireless play on the PSP system, \n allowing two players to duke it out wirelessly. Additionally, the game \n has dozens of unlockable secrets, including alternate costumes, 250 plus \n missions and mini-games. The game has been designed in such a way so \n that anyone can pull-off a speedy action move with the most basic \n fighting game controls. Special attacks are easy to pull off as well, \n making this one of those rare fighting games that almost anyone can \n jump into and become a pro at.\n\n    * Arcade Mode: You are pitted against the CPU controlled opponents \n      as you advance through the story as the character youÃ†ve selected. \n      Each of the selectable characters has their own storyline. Play \n      through them all and see how each character is connected in the Fate \n      universe.\n    * VS-CPU Mode: Battle against a CPU character of your choice. \n      Different characters can be selected after each battle.\n    * Spectate Mode: Watch a duel between any two CPU characters. This \n      is a good way to observe the tendencies of each fighter.\n    * VS-2P Mode: Battle another player in local ad hoc matches.\n    * Survival Mode: This mode challenges you to battle against a constant \n      stream of opponents until your life bar is depleted.\n    * Tutorial Mode: Learn how to execute each characterÃ†s move set. \n      Standard and Expert settings are available to learn different levels \n      of gameplay techniques, from basic moves to high level combos.\n    * Practice Mode: Improve your skills by configuring the CPU settings \n      such as conditions and reactions. In addition, on-screen \n      controller/button prompts will assist you to study combos while \n      allowing you to record and replay the inputs.\n    * Mission Mode: This mode sends you on special missions, consisting of \n      battles bound by particular conditions. Each character has a unique \n      set of missions. New missions are unlocked for each mission cleared. \n      The goal for each mission varies from accomplishing a set combo to \n      defeating the opponent with a certain move. There are over 250 \n      missions in total!","torrent":{"xt":"urn:btih:8435c0456b05745b1f836c0e377e41b2e10481ba","amp;dn":"Fate_Unlimited_Codes_USA_PSP-EMiNENT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8435c0456b05745b1f836c0e377e41b2e10481ba","infoHashBuffer":{"type":"Buffer","data":[132,53,192,69,107,5,116,91,31,131,108,14,55,126,65,178,225,4,129,186]},"announce":[],"urlList":[]}}