{"title":"Stefan Molyneux - Real-Time Relationships - The Logic of Love eb","uid":10404316,"size":1797137,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:849423059c743874efb09ed93ba93cee61a5b52b&amp;dn=Stefan+Molyneux+-+Real-Time+Relationships+-+The+Logic+of+Love+eb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FDRURL","files":-1,"time":1403433629,"description":"The first commandment of Socrates was: &quot;Know Thyself.&quot; Real-Time Relationships by Stefan Molyneux, host of Freedomain Radio, provides the second commandment: &quot;Speak Thy Truth.&quot; The first virtue is always honesty, but speaking immediate emotional experiences in intimate relationships can be enormously challenging.\n\nReal-Time Relationships addresses the how and the why of true intimacy in love, friendship, politics and work. Bring the power of authentic honesty to all of your personal relationships, and reap the rewards of love, loyalty and security for the rest of your life!\n\nAbout the author:\nStefan Molyneux is a Canadian philosopher, author, speaker, and host of Freedomain Radio. Molyneux's areas of focus include libertarian political philosophy, voluntaryism based on the strict application of the non-aggression principle, secular ethics, strong atheism, cryptocurrency (Bitcoin), history, non-violent parenting, and familial relationship issues. He has written and self-published eight non-fiction books, and his essays have been published on libertarian websites such as LewRockwell.com and antiwar.com. He is a frequent public speaker at political and technology conferences and has appeared on television, radio, and podcasts to discuss his views. His online philosophy show, Freedomain Radio, has independently produced over 1,500 videos and 2,700 podcasts as of June 2014. Jeffrey Tucker of the Ludwig von Mises Institute described Molyneux as &quot;one of the single most influential libertarian thinkers of our times&quot;\nMore of his books can be found here: &lt;a href=&quot;\nhttps://freedomainradio.com/free/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://freedomainradio.com/free/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:849423059c743874efb09ed93ba93cee61a5b52b","amp;dn":"Stefan+Molyneux+-+Real-Time+Relationships+-+The+Logic+of+Love+eb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"849423059c743874efb09ed93ba93cee61a5b52b","infoHashBuffer":{"type":"Buffer","data":[132,148,35,5,156,116,56,116,239,176,158,217,59,169,60,238,97,165,181,43]},"announce":[],"urlList":[]}}