{"title":"AGI - Making Glocks Rock","uid":4891348,"size":3639242752,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:858efe08446e93069d454c77070590a0c5457e76&amp;dn=AGI+-+Making+Glocks+Rock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BikerTrash2003","files":1,"time":1242007681,"description":"This video is the last word on Glock handguns. Every alteration and addition imaginable is covered in this comprehensive video. Triggers, sights, magazines, barrels and even caliber conversions are covered, as well as complete installation and modification instructions. Accuracy and reliability issues are discussed, as well as ways to improve both. This video is simply a must have for any Glock owner. 227 minutes.\n\n\n\nTechnical Information\n\nHost/Producer: American Gunsmithing Institute\n\nISO DVD English\n\nRunning Time: 227 Minutes\n\nSummary of Material:\nHours of stuff you can do to customize and improve your Glock pistol. Noted Glock authority T.R. Graham takes you into the gun piece by piece, showing the tips and tricks that years of experience have proven to work. In this course you'll see all the types of trigger modifications available by switching parts, using aftermarket parts, and even by modifying the factory originals. T.R. reviews all the sights available for Glocks, detailing the differences between competition and combat style sights. You'll see dozens of sighting options explained and honestly evaluated along with the installation of several sights, including laser and night sights. T.R. Will show you how to install extended mag releases and slide stops and make them work even more effectively. He covers all aftermarket recoil spring and guide rod combinations, while explaining why and when to use them. Coverage of all trigger parts available, as well as how to combine them for different shooters and applications, is shown along with a build up of both a combat and target trigger. After reviewing a myriad of different magazine and grip accessories he shows how to combine them to tailor the pistol to you and then covers after market barrels and barrel fitting with great detail. Want to convert your Glock pistol to another caliber or enhance it's accuracy? T.R. covers step by step how to get the most accuracy out of your Glock, as well as showing you several caliber conversions including a .22 cal conversion and even how to make your Glock into a rifle using the kit from Mech Tech! ","torrent":{"xt":"urn:btih:858efe08446e93069d454c77070590a0c5457e76","amp;dn":"AGI+-+Making+Glocks+Rock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"858efe08446e93069d454c77070590a0c5457e76","infoHashBuffer":{"type":"Buffer","data":[133,142,254,8,68,110,147,6,157,69,76,119,7,5,144,160,197,69,126,118]},"announce":[],"urlList":[]}}