{"title":"Don Norman: The three ways that good design makes you happy","uid":4783574,"size":43677886,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:86df5fdcda5180dea28ac23e4fb516ddd875c165&amp;dn=Don+Norman%3A+The+three+ways+that+good+design+makes+you+happy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1237473376,"description":"In this talk from 2003, design critic Don Norman turns his incisive eye toward beauty, fun, pleasure and emotion, as he looks at design that makes people happy. He names the three emotional cues that a well-designed product must hit to succeed.\n\nDon Norman is an anthropologist of modern life, studying the way we humans interact with our designed world. Though he has a slight reputation as a grumpy critic, his work is generous and insightful -- he wants nothing less than to close the gap between products and their users. If you've ever fought with an automatic faucet in an airport bathroom, or wondered which button to press in the anonymous row on top of your printer, it's good to know that Norman is in your corner. He's the author of a raft of books on design and the way we humans interact with it, including the classic &quot;Design of Everyday Things.&quot; His next book, says his website, will be about sociable design.\n\nNorman began his career as an academic, working in psychology and then cognitive science at UCSD. In the mid-'90s, he joined Apple and ended up in their Advanced Technology Group, and later worked for HP, before returning to university life. He's now the co-director of an innovative combined MBA and MEM program (called MMM) at Northwestern University. He's also a cofounder of the usability consultancy Nielsen Norman Group.\n\n    &quot;Dr. Norman, a cognitive scientist who is a professor at Northwestern, has been the maestro of gizmos since publishing 'The Design of Everyday Things,' his 1988 critique of VCRs no one could program, doors that couldn't be opened without instructions and other technologies that seemed designed to drive humans crazy.&quot;\n\nJohn Tierney, the New York Times","torrent":{"xt":"urn:btih:86df5fdcda5180dea28ac23e4fb516ddd875c165","amp;dn":"Don+Norman%3A+The+three+ways+that+good+design+makes+you+happy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86df5fdcda5180dea28ac23e4fb516ddd875c165","infoHashBuffer":{"type":"Buffer","data":[134,223,95,220,218,81,128,222,162,138,194,62,79,181,22,221,216,117,193,101]},"announce":[],"urlList":[]}}