{"title":"Soldiers and Slaves: American POWs at germany during WW2","uid":9611996,"size":362018966,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:874074feb8501897fe038f7650fe2df28382a6c3&amp;dn=+Soldiers+and+Slaves%3A+American+POWs+at+germany+during+WW2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sidmal","files":-1,"time":1392337817,"description":"Roger Cohen, Michael Prichard (Narrator), &quot;Soldiers and Slaves: American POWs Trapped by the Nazis' Final Gamble&quot;\n ISBN: 0736696083, ASIN: B0009RFWPW | 2005 | MP3@64 kbps | ~12:37:00 | 345 MB\n\n In February 1945, 350 American POWs captured earlier at the Battle of the Bulge or elsewhere in Europe were singled out by the Nazis because they were Jews or were thought to resemble Jews. They were transported in cattle cars to Berga, a concentration camp in eastern Germany, and put to work as slave laborers, mining tunnels for a planned underground synthetic-fuel factory. This was the only incident of its kind during World War II.\n Starved and brutalized, the GIs were denied their rights as prisoners of war, their ordeal culminating in a death march that was halted by liberation near the Czech border. Twenty percent of these soldiers, more than 70 of them, perished. After the war, Berga was virtually forgotten, and the experiences of these Americans were buried.\n\n Now, for the first time, their story is told in all its blistering detail. This is the story of hell in a small place over a period of nine weeks, at a time when Hitler's Reich was crumbling but its killing machine still churned. It is a tale of madness and heroism, and of the failure to deliver justice for what the Nazis did to these Americans.\n\n Roger Cohen uncovers exactly why the U.S. government did not aggressively prosecute the commandants of Berga, why there was no particular recognition for the POWs and their harsh treatment in the postwar years, and why it took decades for them to receive proper compensation.\n\n Soldiers and Slaves is an intimate, intensely dramatic story of war and of a largely forgotten chapter of the Holocaust","torrent":{"xt":"urn:btih:874074feb8501897fe038f7650fe2df28382a6c3","amp;dn":"+Soldiers+and+Slaves%3A+American+POWs+at+germany+during+WW2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"874074feb8501897fe038f7650fe2df28382a6c3","infoHashBuffer":{"type":"Buffer","data":[135,64,116,254,184,80,24,151,254,3,143,118,80,254,45,242,131,130,166,195]},"announce":[],"urlList":[]}}