{"title":"Lenny.Breau.-.Guitar.sounds.of.FLAC-Mighty","uid":6916056,"size":253295883,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:87ba05b7564e70adb436d93f97bd90d383fb9b5b&amp;dn=Lenny.Breau.-.Guitar.sounds.of.FLAC-Mighty&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":12,"time":1325033737,"description":"Guitar Sounds of Lenny Breau is the major label debut of jazz guitarist Lenny Breau, issued in 1968 on RCA. Breau is accompanied by an able if not spectacular rhythm section that includes bassist Ronnie Halldorson and drummer Reg Kellin. The program here features Breau playing a number of pop tunes of many genres, including the Lennon-McCartney classic &quot;Hard Day's Night,&quot; Hank Williams' &quot;Cold, Cold Heart,&quot; Roger Miller's &quot;King of the Road,&quot; John Phillips' &quot;Monday, Monday&quot; as well as standards like &quot;My Funny Valentine,&quot; and &quot;Georgia on My Mind.&quot; But it is in his material that the guitarist shines best. Take for example the entirely improvised &quot;Taranta,&quot; played on nylon string classical guitar. Breau moves from solo flamenco style classicism to dark, modal jazz improvisation with his rhythm section. His classical style is most evident here. His read of Bob Dylan's &quot;Don't Think Twice, It's Alright,&quot; also on the nylon string, swings gently and freely in a stylish and beautiful arrangement. Likewise his version of the Hoagy Carmichael classic on electric begins with a silvery, moody triplet before it slows the lyric melody to enter and then seamlessly syncopates and slips off into a swing-fest. The version of Paul James' and Fred Williams' folk classic &quot;Freight Train&quot; is simply astonishing for the wealth of picking styles it displays -- from country and bluegrass to flamenco and classical. &quot;Cold, Cold Heart&quot; is simply transformed from a country song to a jazz ballad. This is an impressive debut as any you're likely to find because of Breau's startling originality on the instrument. The CD reissue by Wounded Bird in 2005 contains one bonus track, a spirited, soulful read of the pop classic &quot;Call Me.&quot;\n\n1\t\tKing of the Road\t Miller\t2:29\n2\t\tTaranta\tBreau\t6:51\n3\t\tDon't Think Twice, It's All Right\tDylan\t4:31\n4\t\tA Hard Day's Night\tLennon, McCartney\t4:12\n5\t\tGeorgia on My Mind\tCarmichael, Gorrell\t5:21\n6\t\tMonday, Monday\t Philips\t2:30\n7\t\tMy Funny Valentine\t Hart, Hart, Rodgers\t4:53\n8\t\tFreight Train\tJames, Williams\t3:31\n9\t\tCold, Cold Heart\t Williams\t4:44\n10\t\tMusic to Watch Girls By\tBreau\t4:29\n11\t\tCall Me\t Hatch\t4:13\n\n","torrent":{"xt":"urn:btih:87ba05b7564e70adb436d93f97bd90d383fb9b5b","amp;dn":"Lenny.Breau.-.Guitar.sounds.of.FLAC-Mighty","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87ba05b7564e70adb436d93f97bd90d383fb9b5b","infoHashBuffer":{"type":"Buffer","data":[135,186,5,183,86,78,112,173,180,54,217,63,151,189,144,211,131,251,155,91]},"announce":[],"urlList":[]}}