{"title":"Anne Applebaum - Iron Curtain- The Crushing of Eastern Europe, 1","uid":8000470,"size":10725787,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8830ea53ba2fb145fcfcb30d50dc54031379c746&amp;dn=Anne+Applebaum+-+Iron+Curtain-+The+Crushing+of+Eastern+Europe%2C+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KatQwerty","files":3,"time":1357739886,"description":"\n[b][size=&quot;200&quot;][color=green]This book Features in virtually ever booklist of 2012 out \n\nthere...a must read. Also get the author's acclaimed previous book &quot;GULAG&quot;[/color]\n\n[/size][/b]\n   \n \n \n \n[b]Release Date: October 30, 2012 | EPUB [/b]\n \n \n \n \nIn the long-awaited follow-up to her Pulitzer Prize-winning Gulag, acclaimed \n\njournalist Anne Applebaum delivers a groundbreaking history of how Communism took \n\nover Eastern Europe after World War II and transformed in frightening fashion the \n\nindividuals who came under its sway.\n \n \n \n\nAt the end of World War II, the Soviet Union to its surprise and delight found itself \n\nin control of a huge swath of territory in Eastern Europe. Stalin and his secret \n\npolice set out to convert a dozen radically different countries to Communism, a \n\ncompletely new political and moral system. In Iron Curtain, Pulitzer Prize-winning \n\njournalist Anne Applebaum describes how the Communist regimes of Eastern Europe were \n\ncreated and what daily life was like once they were complete. She draws on newly \n\nopened East European archives, interviews, and personal accounts translated for the \n\nfirst time to portray in devastating detail the dilemmas faced by millions of \n\nindividuals trying to adjust to a way of life that challenged their every belief and \n\ntook away everything they had accumulated. Today the Soviet Bloc is a lost \n\ncivilization, one whose cruelty, paranoia, bizarre morality, and strange aesthetics \n\nApplebaum captures in the electrifying pages of Iron Curtain.\n \n \n \n \n \n\n","torrent":{"xt":"urn:btih:8830ea53ba2fb145fcfcb30d50dc54031379c746","amp;dn":"Anne+Applebaum+-+Iron+Curtain-+The+Crushing+of+Eastern+Europe%2C+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8830ea53ba2fb145fcfcb30d50dc54031379c746","infoHashBuffer":{"type":"Buffer","data":[136,48,234,83,186,47,177,69,252,252,179,13,80,220,84,3,19,121,199,70]},"announce":[],"urlList":[]}}