{"title":"How The West Was Won [RePoPo] (H.264-AC3 5.1)","uid":4422355,"size":2946897767,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:895cdcd3dfd66fdf46baeced21b2fb729b24b480&amp;dn=How+The+West+Was+Won+%5BRePoPo%5D+%28H.264-AC3+5.1%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"repopo","files":10,"time":1222851762,"description":"*******************************************************************************\n                          How the West Was Won (1962)\n*******************************************************************************\n\n-------------------------------------------------------------------------------\n                              Technical Information\n-------------------------------------------------------------------------------\nType..................: Movie\nContainer file........: AVI\nVideo Format..........: H.264\nTotal Bitrate.........: 2307 Kbps / 2445 Kbps\nAudio format..........: AC3 384 Kbps (UNTOUCHED)\nAudio Languages.......: English 5.1 \nSubtitles Ripped......: Spanish\nSubtitles in Subpack..: English, Spanish, Japanese, French, Thai\nResolution............: 704x240\nAspect Ratio..........: 2.89:1 (approx)\nOriginal Aspect Ratio.: 2.79:1\nColor.................: Color\nFPS...................: 23.976\nSource................: NTSC DVD\nDuration..............: 01:24:42 // 01:19:56\nGenre.................: WESTERN!!\nIMDb Rating...........: 6.9\nMovie Information.....: http://www.imdb.com/title/tt0056085/\n\n\n-------------------------------------------------------------------------------\n                                 PLEASE NOTICE\n-------------------------------------------------------------------------------\n\nThis is a rip of the latest DVD release for How The West Was Won.  It's easily\nrecognizable due to the restoration process, which has virtually deleted any\ntrace of the vertical lines which originally marked the separation of the\nCinerama panels.\n\nThis release is BIG.  2x1.4Gb files, one for each part of the movie.  I hope you\nunderstand and enjoy the HQ of this rip.  I could have reduced it by half, but\nafter a few tests, the rich colours, the terrific definition, and the glorious\ncamera work couldn't be mistreated, and I didn't want to add compression\nartifacts either.\n\nI'm sorry if it's too big in size for you, but I think the unbelievable quality\nof the original release deserves it.\n\nCheck you have installed the right codecs, as listed in this .nfo file, before\ntrying to play it.  VLC will play this file without having to install any codec.\n\nIf you don't like the codec(s), container, resolution, file size, languages or\nany technical aspect on this rip, keep it to yourself and go and do your own.\n\nSerious feedback on quality will always be welcome\n\n-------------------------------------------------------------------------------\n-------------------------------------------------------------------------------\n                              General Information\n-------------------------------------------------------------------------------\n\n-------------------------------------------------------------------------------\nSYNOPSIS: (by Andrea LeVasseur)\n\nFilmed in panoramic Cinerama, this star-studded, epic Western adventure is a \ntrue cinematic classic. Three legendary directors (Henry Hathaway, John Ford, \nand George Marshall) combine their skills to tell the story of three families \nand their travels from the Erie Canal to California between 1839 and 1889. \nSpencer Tracy narrates the film, which cost an estimated 15 million dollars to \ncomplete. In the first segment, &quot;The Rivers,&quot; pioneer Zebulon Prescott (Karl \nMalden) sets out to settle in the West with his wife (Agnes Moorehead) and their \nfour children. Along with other settlers and river pirates, they run into \nmountain man Linus Rawlings (James Stewart), who sells animal hides. The \nPrescotts try to raft down the Ohio River in a raft, but only daughters Lilith \n(Debbie Reynolds) and Eve (Carroll Baker) survive. Eve and Linus get married, \nwhile Lilith continues on. In the second segment, &quot;The Plains,&quot; Lilith ends up \nsinging in a saloon in St. Louis, but she really wants to head west in a wagon \ntrain led by Roger Morgan (Robert Preston). Along the way, she's accompanied by \nthe roguish gambler Cleve Van Valen (Gregory Peck), who claims he can protect \nher. After he saves her life during an Indian attack, they get married and move \nto San Francisco. In the third segment, &quot;The Civil War,&quot; Eve and Linus' son, Zeb \n(George Peppard), fights for the Union. After he's forced to kill his \nConfederate friend, he returns home and gives the family farm to his brother. In \nthe fourth segment, &quot;The Railroads,&quot; Zeb fights with his railroad boss (Richard \nWidmark), who wants to cut straight through Indian territory. Zeb's co-worker \nJethro (Henry Fonda) refuses to cut through the land, so he quits and moves to \nthe mountains. After the railway camp is destroyed, Zeb heads for the mountains \nto visit him. In the fifth segment, &quot;The Outlaws,&quot; Lilith is an old widow \ntraveling from California to Arizona to stay with her nephew Zeb on his ranch. \nHowever, he has to fight a gang of desperadoes first. How the West Was Won \ngarnered three Oscars, for screenplay, film editing, and sound production.\n\n-------------------------------------------------------------------------------\nCAST:\nJames Stewart \t           - Linus Rawlings\nHenry Fonda                - Jethro Stuart\nGregory Peck               - Cleve Van Valen\nDebbie Reynolds            - Lilith Prescott\nRichard Widmark            - Mike King\nGeorge Peppard             - Zeb Rawlings\nKarl Malden                - Zebulon Prescott\nJohn Wayne                 - Gen. William Tecumseh Sherman\nCarolyn Jones              - Julie Rawlings\nRobert Preston             - Roger Morgan\nEli Wallach                - Charlie Gant\nCarroll Baker              - Eve Prescott\nLee J. Cobb                - Marshal Lou Ramsey\nBrigid Bazlen              - Dora Hawkins\nWalter Brennan             - Col. Hawkins\nDavid Brian                - Attorney\nAndy Devine                - Corporal Peterson\nRaymond Massey             - Abraham Lincoln\nAgnes Moorehead            - Rebecca Prescott\nThelma Ritter              - Agathe Clegg\nMickey Shaughnessy         - Dep. Stover\nRuss Tamblyn               - Confederate deserter\nRodopho (Rudy) Acosta      - Gant gang member\nMark Allen                 - Colin\nBeulah Archuletta          - Indian woman\nWillis B. Bouchey          - Surgeon\nCharlie Briggs             - Barker\nPaul Bryar                 - Auctioneer's assistant\nWalter Burke               - Wagon poker player\nKim Charney                - Sam Prescott\nKen Curtis                 - Union Soldier\nJohn Damler                - Lawyer\nChristopher Dark           - Poker player\nKen Dibbs \t           - Blacksmith\nJay C. Flippen             - Huggins\nSol (Saul) Gorss           - Henchman\nJames Griffith             - Poker player\nWilliam Henry              - Staff Officer\nRoy Jenson                 - Henchman\nClaude Johnson             - Jeremiah Rawlings\nJack Lambert               - Gant henchman\nJohn Larch                 - Grimes\nJ. Edward McKinley         - Auctioneer\nHarry Monty\nHenry &quot;Harry&quot; Morgan       - Gen. Ulysses S. Grant\nBoyd &quot;Red&quot; Morgan          - Stunts\nRobert Nash                - Lawyer\nTudor Owen                 - Parson Harvey\nHarvey Parry               - Henchman\nJack Pennick               - Corporal Murphy\nGil Perkins                - Henchman\nWalter Reed \t \nChuck Roberson \t           - Union soldier/stunts\nVictor Romito              - Henchman\nJamie Ross                 - Bruce\nGene Roth                  - Riverboat poker player\nBryan Russell              - Zeke Prescott\nJoe Sawyer                 - Ship's Officer\nHarry Dean Stanton         - Gant gang member (billed as Dean Stanton)\nClinton Sundberg           - Hylan Seabury\nKarl Swenson               - Train conductor\nSpencer Tracy              - Narrator\nLee Van Cleef              - Marty\nCarleton Young             - Union Soldier \n\n-------------------------------------------------------------------------------\nCREW:\nJohn Ford                  - Director\nHenry Hathaway             - Director\nGeorge Marshall            - Director\nBernard Smith              - Producer\nJames R. Webb              - Screenwriter\nWilliam H. Daniels         - Cinematographer\nMilton Krasner             - Cinematographer\nCharles B. Lang            - Cinematographer\nJoseph La Shelle           - Cinematographer\nHarold E. Wellman          - Cinematographer\nKen Darby                  - Composer (Music Score)\nDave Guard                 - Songwriter\nJohnny Mercer              - Songwriter\nAlfred Newman              - Composer (Music Score)\nWhiskeyhill Singers        - Songwriter\nHarold Kress               - Editor\nGeorge W. Davis            - Art Director\nWilliam Ferrari            - Art Director\nAddison Hehr               - Art Director\nHenry W. Grace             - Set Designer\nDon Greenwood, Jr.         - Set Designer\nJack Mills                 - Set Designer\nWalter Plunkett            - Costume Designer\nWilliam J. Tuttle          - Makeup\nArnold A. Gillespie        - Special Effects\nRobert R. Hoag             - Special Effects\nWilliam McGarry            - First Assistant Director\nRobert Saunders            - First Assistant Director\nWilliam Shanks             - First Assistant Director\nWingate Smith              - First Assistant Director\nLoren Janes                - Stunts\nRobert Sidney              - Choreography\n-------------------------------------------------------------------------------\nTRIVIA:\n    *  Some stock footage from other (non-Cinerama) epics were used. The Mexican \narmy marching past the Alamo came from The Alamo (1960) and a civil war battle \nwas taken from Raintree County (1957). The final scenes of the modern U.S. were \nfrom This Is Cinerama (1952).\n\n    * No ordinary &quot;single-camera&quot; version was filmed simultaneously with the \nCinerama version, resulting in two noticeable dividing lines on the non-Cinerama \ntheater prints, video, TV and DVD versions (indicating the three synchronized \nfilm strips originally used). The same problem occurred with the other Cinerama \nfilm in release at the time, The Wonderful World of the Brothers Grimm (1962), \nwhich had not been shot in a &quot;single-camera&quot; version either. Both were MGM \nfilms.\n\n    * Since the three lenses of the Cinerama camera sat at angles to each other \non the camera itself, it was very problematic for actors to film a scene as they \nwould in front of a single-lensed camera. When their images were projected onto \nthe three panels of the Cinerama screen, it would appear as though the actors \nwere looking either slightly up-screen or slightly down-screen, and not directly \nat their fellow actors. This is very evident in a few scenes in the previous \nCinerama film, The Wonderful World of the Brothers Grimm (1962). However, by the \ntime this film went into production, this problem was solved somewhat. In order \nto compensate for the lens angles, actors would have to look one-third of the \nway in and toward the camera, and pretend that they were looking at their fellow \nactors. Hence, when their images were projected onto the Cinerama screen, it \nwould appear as though they were looking at each other. It was a very difficult \nprocess for actors, which is one of the reasons that three-panel Cinerama was \nabandoned for narrative films after this film was released.\n\n    * During the Indian attack that was filmed in Lone Pine, California, a \nConestoga Wagon tumbles down a hill. In order to create the illusion of the \naudience being inside of a tumbling wagon, a track was built down the slope of a \nsmall hill and the top portion of a Conestoga Wagon, without the wheels, was \naffixed onto a flatbed along with a mechanism that would turn the wagon over and \nover as the flatbed was guided down the hill. The Cinerama camera, in turn, was \nattached to one end of the flatbed so that it could shoot directly through the \nturning wagon as the stuntmen, including Loren Janes, were tumbled around the \ninsides of the wagon along with boxes, barrels, blankets and other cargo. It \ntook more than two days to prepare the scene and several takes to complete. In \nthe final cut, this scene lasts no more than five seconds on the screen.\n\n    * The first non-documentary Cinerama film, it was also one of the last to \nuse the old three-camera technique, resulting in two very visible, somewhat \ndistracting, dividing lines in the non-Cinerama print and all TV and home video \nversions.\n\n    * Hope Lange was cast as a love interest for George Peppard's character, but \nher scenes were cut from the final print of the film. She portrayed young Julie \nStuart, the daughter of Henry Fonda's character, Jethro Stuart. After Lang's \nscenes were deleted from the film, Julie was later portrayed by Carolyn Jones.\n\n    * Stuntman Bob Morgan was seriously injured, and almost died, while \nperforming a stunt in this picture. Toward the end of the film, there is a \ngunfight on a moving train between the sheriff and a gang of train robbers. \nMorgan was one of the stuntmen playing a robber and was crouched next to a pile \nof logs on a flatcar. The chains holding the logs together snapped, and Morgan \nwas crushed by the falling logs. He was so badly hurt it took him five years to \nrecover to the point where he was able to move by himself and walk unaided.\n\n    * Due to the detail that would have been shown via the Cinerama process, the \ncostumes had to be sewn by hand, rather than with a sewing machine, as they \nwould have been during the time periods depicted in the movie.\n\n    * Debbie Reynolds and George Peppard are the only cast members who appear in \nthree of the five sequences in the film. According to Ms. Reynolds, in an \ninterview for the documentary 'Cinerama Adventure,&quot; her character of Lilith was \noriginally supposed to have drowned in the river. However, it was decided that \nLilith would best tie the generations of Prescotts together; so, she remained in \nthe story to become an elderly lady in the film's conclusion.\n\n    * One of the few American films to have its world premiere in London, \nEngland.\n\n    * Because the 2 dividing lines that separate the 3 separate projections \ncould not be totally edited into a seamless match, the directors skillfully used \ncamouflage techniques to disguise the lines. Some of the objects used for this \nwere trees, lamp posts, window edges, porch rails, building corners, doorways \nand wooden crates which were positioned at these points.\n\n    * This was one of only two films made in true Cinerama which were shown in \nregular theatres after their first runs. None of the previous Cinerama films \nwere ever shown in regular theatres because they were travelogues and \ndocumentaries made only to show off the process, as opposed to telling a story, \nand it would have been pointless to show these in a &quot;regular&quot; format.\n\n    * The train station in the film at &quot;Gold City&quot; was shot at Perkinsville, \nArizona, and is still standing, although in a state of disrepair. It is now the \nmid stopping point of the Verde Canyon Scenic Railroad. The train station, the \ntown sign and several other smaller buildings still exist.\n\n    * A comic book version of this film was published in conjunction with the \nfilm's release, as was the practice back then with all family and children's \nfilms. In the comic book, when Sheriff Ramsay (Lee J. Cobb) tries to prevent Zeb \nRawlings (George Peppard) from going after the outlaw Gant (Eli Wallach), \nRawlings whacks Ramsay over the head with his rifle and knocks him unconscious, \nwhich explains the bandage on Ramsay's forehead in the next scene. No such \nexplanation is offered in the film; it is as if somebody had edited something \nout.\n\n    * Features more than 12,000 extras, including several Indian tribes.\n\n\n\n-------------------------------------------------------------------------------\n-------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:895cdcd3dfd66fdf46baeced21b2fb729b24b480","amp;dn":"How+The+West+Was+Won+%5BRePoPo%5D+%28H.264-AC3+5.1%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"895cdcd3dfd66fdf46baeced21b2fb729b24b480","infoHashBuffer":{"type":"Buffer","data":[137,92,220,211,223,214,111,223,70,186,236,237,33,178,251,114,155,36,180,128]},"announce":[],"urlList":[]}}