{"title":"The Final Act - Dee, Bonnie.epub","uid":8887764,"size":793557,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b5c7d7ce5d0a5f781a19d0578d72686d9e8b526&amp;dn=The+Final+Act+-+Dee%2C+Bonnie.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1378502332,"description":"Life imitates art? One can only hope. Elena is a by-the-script actress whose co-star, Michael, has a gift for improvisation that drives her crazy. Fighting a fiery chemistry, they work to keep their on-stage romance where it belongs-on the stage. But a year-long road tour stretches before them. How long can they keep a lid on their simmering passion? When his left-behind boyfriend, Tom, seems withdrawn on the phone, Denny questions his lover's faithfulness. Their once-solid relationship faces its biggest test during the long separation. Inexperienced Gretchen is thrilled to land her first professional role in the musical, Transitions, but the pressures of performing are more than she bargained for. Entranced by her wholesome sweetness, Jake, the pit guitarist, endangers the very qualities he admires by giving her a &quot;little something&quot; to take the edge off her nerves. Every night for a year, they'll play out a &quot;happily ever after&quot; on the stage. Before the last curtain call, will life imitate art? Warning, this title contains the following: explicit sex using graphic terms. Almost public sex, m/m sex, drug-addled sex and a lot of horny backstage fooling around.\nGenre: Erotic Romance","torrent":{"xt":"urn:btih:8b5c7d7ce5d0a5f781a19d0578d72686d9e8b526","amp;dn":"The+Final+Act+-+Dee%2C+Bonnie.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b5c7d7ce5d0a5f781a19d0578d72686d9e8b526","infoHashBuffer":{"type":"Buffer","data":[139,92,125,124,229,208,165,247,129,161,157,5,120,215,38,134,217,232,181,38]},"announce":[],"urlList":[]}}