{"title":"Bending - Dirty Kinky Stories About... (2013) [5 Formats]","uid":10520532,"size":2441157,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b7051547c00901f108ab1730af9013fb9ec4a09&amp;dn=Bending+-+Dirty+Kinky+Stories+About...+%282013%29+%5B5+Formats%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1404968046,"description":"Title: Bending - Dirty Kinky Stories About Pain, Power, Religion, Unicorns, &amp; More\nAuthor: Greta Christina\nCategory: Fiction/Short Stories/Erotic Fiction\nPublisher: Dirty Heathen Publishing (April 11, 2013)\nLanguage: English\nASIN: B00CBWYT5C (no physical edition)\n\nFor my friend Eccles, a sexy and sensual woman not afraid to push boundaries. Love, lust, passion, pain, power and compassion and kindness all in one amazing package. She's fantastic. :)\n\nPromotional info/Publisher's summary - &quot;These are not nice stories.\n\nThey're filthy. They're fearless. Some are even funny. \n\nGreta Christina's erotic stories are written to get you hard and wet -- and to change the ways you think about sex. Be forewarned -- stuff happens here that's borderline consensual. Or not at all consensual. These are dirty, kinky stories about shame, about pain, helplessness and danger, reckless behavior and bad, bad ideas....\n\nA baby dyke is manipulated into fetish porn by her beautiful, self-absorbed porn-star lover.\n\nA good Christian wife follows her duty to obey, even as her husband's sexual demands become bizarre.\n\nA student, hungry for punishment, seeks it from a professor who should know better.\n\nA woman with a dedicated fetish finds a lover who meets her more than halfway.\n\nAnd then there's the one about the unicorn and the rainbow...\n\nRaw, exciting, joyful, intensely believable, Greta's stories are written with a fierce respect for erotic fiction -- and for sex itself.&quot;\n\nReview:\n&quot;Located at some far vanishing point of sex and language, Greta Christina's wildly hot and masterfully written stories make you rethink what you supposed you already knew -- about command and consent, fantasy, belief, and that whole body-mind thing. The payoff is pleasure; the price of the ticket is to leave a few certainties at the door.&quot; - Molly Weatherfield, author of &quot;Carrie's Story&quot; and &quot;Safe Word&quot;\n\nThis torrent contains the retail quality copies of the EPUB and MOBI editions, as well as conversions into AZW3, LIT, and large print PDF formats done in Calibre. The front cover image and generated metadata.opf are also included. Please seed, and enjoy.\n\nPlease visit and support my Suprbay release thread here, I would appreciate it:       &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&lt;/a&gt;","torrent":{"xt":"urn:btih:8b7051547c00901f108ab1730af9013fb9ec4a09","amp;dn":"Bending+-+Dirty+Kinky+Stories+About...+%282013%29+%5B5+Formats%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b7051547c00901f108ab1730af9013fb9ec4a09","infoHashBuffer":{"type":"Buffer","data":[139,112,81,84,124,0,144,31,16,138,177,115,10,249,1,63,185,236,74,9]},"announce":[],"urlList":[]}}