{"title":"King Pleasure~Golden Days (HiFiJazz) [FLAC] {MKOP}","uid":7697622,"size":180341405,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8bc61ceb179cf35aca47e3001aab406e8fcd396d&amp;dn=King+Pleasure%7EGolden+Days+%28HiFiJazz%29+%5BFLAC%5D+%7BMKOP%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mudmashers","files":10,"time":1349406725,"description":"King Pleasure~Golden Days (HiFiJazz) [FLAC] {MKOP}\n\nKing Pleasure (March 24, 1922 - March 21, 1981) was a jazz vocalist and an early master of vocalese, where a singer sings words to a famous instrumental solo. Born as Clarence Beeks in Oakdale, Tennessee, he moved to New York City in the mid-1940s and became a fan of bebop music. King Pleasure first achieved popularity by singing the Eddie Jefferson vocalese classic &quot;Moody's Mood for Love,&quot; based on a James Moody saxophone solo to &quot;I'm in the Mood for Love&quot; in 1949. Pleasure's recording in 1952 is considered a jazz classic. He and Betty Carter also recorded a famous vocalese version of &quot;Red Top,&quot; a jazz classic penned by Kansas Citian Ben Kynard and recorded by Gene Ammons and others. Other notable recordings include a presciently elegiac version of &quot;Parker's Mood&quot;, the year before Charlie Parker died in 1955, and Pleasure's take on Ammons's &quot;Hittin' the Jug&quot;, retitled as &quot;Swan Blues&quot;.~wikipedia\n\nThis CD reissue (one of three King Pleasure sets that together contain all of his recordings) has an LP-length session from 1960 (originally put out by HiFi Jazz) that is dominated by spirited remakes of past glories. The vocalese singer revisits such songs as &quot;Moody's Mood for Love,&quot; &quot;Don't Get Scared,&quot; and &quot;Parker's Mood&quot; with the assistance of tenors Teddy Edwards and Harold Land and pianist Gerald Wiggins. \nWorth picking up, although the other two King Pleasure releases are generally on a higher and more creative level.~Scott Yanow (allmusic)\n\n01. Moody's Mood For Love\nThis is a new arrangement of the original 1952 King Pleasure record hit. The girl singer on the old record was Blossom Dearie.The young lady with Pleasure here must, unfortunately, remain anonymous. \n\n02. The New Symphony Sid\nKing Pleasure wrote this 'I Got Rhythmish' number. ''Famous jazz disc jockey Symphony Sid (in New York) has been using Lester Young's 'Jumping With Symphony Sid' since the early 40's,'' King Pleasure explains. ''I figured he should have something new as a theme.'' \n\n03. Don't Worry 'Bout Me\n''This is one of Stan Getz' choruses on this standard,'' Pleasure notes. ''Of course, he doesn't stop where I do.''\n\n04. Little Boy, Don't Get Scared\nThis is a mid tempo blues. King Pleasure took for his melodies five Stan Getz choruses from Stan's 'Don't Get Scared' recorded, with Bengt Hallberg, in Sweden. \n\n05. Parker's Mood\n''This slow blues by Charlie Parker seems to have just the right feeling,'' Pleasure comments. \n\n06. Golden Days\nThis is an original by Pleasure with nice changes and very pretty piano contributed by Gerald Wiggins.\n\n07. Tomorrow Is Another Day\nThe original tune is 'Dear Old Stockholm' - the Swedish anthem. King Pleasure sets his special lyrics to some Stan Getz jazz interpretations recorded, some year ago, with a Swedish rhythm section. \n\n08. No, Not Much\n''I heard this recent top tune sung by some vocal group,'' King Pleasure informs. ''I liked it so much so i wanted to record it.''\n\n09. All of Me\n''The melodies for my lyrics to this version are from Illinois Jacquet's\nrecording.'' This is Pleasure all the way and it's a a great example of his unique invention.\n\nMusic Keep On Playing*Thank You Seeders","torrent":{"xt":"urn:btih:8bc61ceb179cf35aca47e3001aab406e8fcd396d","amp;dn":"King+Pleasure%7EGolden+Days+%28HiFiJazz%29+%5BFLAC%5D+%7BMKOP%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bc61ceb179cf35aca47e3001aab406e8fcd396d","infoHashBuffer":{"type":"Buffer","data":[139,198,28,235,23,156,243,90,202,71,227,0,26,171,64,110,143,205,57,109]},"announce":[],"urlList":[]}}