{"title":"Tulku-A Universe to come","uid":4661721,"size":92042202,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8bfa74ae43f25a73413bafe1eab0d555f7d315e5&amp;dn=Tulku-A+Universe+to+come&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"globalrhythms","files":13,"time":1232416419,"description":"Audio CD\nArtist: Tulku(Jim Wilson)\nAlbum: A Universe to Come\nOriginal Release Date: February 2, 2002\nNumber of Discs: 1\nLabel: New Earth Records\nNo: of tracks: 12\nBit Rate: 192 kbps\nFormat: WMA file\n\nThe man behind Tulku is JIM WILSON, aka Tulku, aka Little Wolf. Jim Wilson is a prolific musician and producer who's done much to advance the artform of ambient techno and the cause of Native American recognition. Dispelling rustic stereotypes with state-of-the-art electronics even as he draws heavily on the rhythms and found voices of his own and other indigenous cultures, Wilson is at the forefront of emphasizing the First Peoples' contemporary presence while preserving their ancient heritage. By Tulku - Peruvian, Indian and Mediterranean influences suffuse the rhythms and music. The story of Tulku is one of constant renewal. Indeed the word Tulku means the emergence of an old soul into a new body. Tulku is also a renowned voyage, a journey into mystic traditions of the world, an exploration of our global rhythms. One of my favorite artists and a must have in the collection of all the New age and World Beat Music lovers. \n\n\nEditorial Reviews: \n\n&quot;Combining modern technology with indigenous acoustics, Tulku is a melting pot of global musical styles, resulting in a stew wherein every ingredient can be distinctly noted and relished... rapturous in its rhythms.&quot; -ALTERNATIVE PRESS\n\n\n&quot;Peruvian, Indian and Mediterranean influences suffuse the selections on this filled with exciting narration, rhythms and music. It might require two or three listenings to become used to the different types of music. Shamanic chants, techno-beat and mystic music all combine to present a diverse selection of songs that includes original and cover tunes as well as adaptations of such works as the Gnostic Gospels such as in 'I Am,' an interesting blend of background music and vocals along with the spoken word. Producer Jim Wilson has also done Walela with Rita Coolidge and his music has been featured in several motion pictures.&quot;\n\nSynchronicity\n\n\n\n&quot;Welcome to a world of renewal and constant reemergence, where an old soul returns to a new body. This is the revolving ensemble Tulku, dedicated to exploring mystic musical traditions and the diversity of voices from global origins. Original members Jai Uttal and Geoffrey Gordon rejoin producer/programming wizard Jim Wilson and meld with newcomers Consuelo Luz, Gina Sala, Sita Jamieson, Benjamin Mahua of the Shippibo tribe from Peru, and others, considerable talents that weave and wend, unleashing primal sounds and unearthly vocals, channeling deep meditative grooves, and invoking divine visions: memories of other times/places and images of a universe to come. Twelve tracks traverse dub, East Indian, flamenco, Gnostic gospels, and the profound influence of traditional Ayahuasca healing rituals. Samples of songs from these ceremonies blend seamlessly on Tulku's psychedelic canvas. Bonus: and MPEG video of 'Ayahuasca Healing'.&quot;\n\nNapra Review\nMay/June 2002\n\n\n\n&quot;The word Tulku means 'the emergence of an old soul into a new body.' This is a journey into the mystic traditions of the world. It includes voices of many peoples - Indian, Persian, Egyptian, Mayan, Aboriginal and Native American. I especially liked the song 'A Universe to Come,' sung by Peruvian Consuelo Luz. Her voice is refreshing yet haunting - I'd buy the CD just to get this one song!&quot;\n\nChristina Lord\nCreations Magazine, April 2002\n\n\n&quot;The expansion of technology is bringing musical traditions from across the globe into our popular culture. Tulku, a musical ensemble produced by world music pioneer Jim Wilson, reveals these global voices and rhythms in its latest venture, A Universe to Come. The word 'Tulku' means &quot;the emergence of an old soul into a new body.&quot; And the group Tulku, as befits its name, is an evolving ensemble of voices. Featuring Mayan, Persian, Aboriginal, and Native American voices among others, this new CD incorporates these voices with trance-like electronic and native music.\n\nIn the cut 'I Am,' Bernard Pomerance narrates a text fragment from the Gnostic Gospels. The music a rich blend of techno and traditional voice, moves the words to a climax as Pomerance narrates, &quot;My offspring are my own birth, the source of my power. What happens to me is their wish.\n\nA Universe to Come also includes the video Ayahuasca Healing, featuring dramatic footage of Peruvian shaman Benjamin Mahua and the voices of Ayahuasca chants. Both haunting and energetic, A Universe to Come is a great addition to a global music collection.&quot;\n\nRandall Friesen\n\n\n\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/globalrhythms&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/globalrhythms&lt;/a&gt;","torrent":{"xt":"urn:btih:8bfa74ae43f25a73413bafe1eab0d555f7d315e5","amp;dn":"Tulku-A+Universe+to+come","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bfa74ae43f25a73413bafe1eab0d555f7d315e5","infoHashBuffer":{"type":"Buffer","data":[139,250,116,174,67,242,90,115,65,59,175,225,234,176,213,85,247,211,21,229]},"announce":[],"urlList":[]}}