{"title":"Alice_In_Chains-Facelift-(Retail)-1990-HHI","uid":3930579,"size":83760573,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8c0cd2a5ea17e046f72650beaca204f4f2fc640a&amp;dn=Alice_In_Chains-Facelift-%28Retail%29-1990-HHI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"raidy","files":15,"time":1197428012,"description":"Artist......: Alice in chains                                                   \n               Album.......: Facelift                                                          \n               Grabber     : EAC                                                               \n               Encoder     : LAME v3.90.3                                                      \n               Release Date: Aug 1990                                                          \n               Rip Date....: Feb-03-2007                                                       \n               Genre.......: Rock                                                              \n               Quality     : VBRkbps / 44.1kHz / Joint-Stereo                                  \n               Playtime    : 54:09 min                                                         \n               Ripper      : Happy Hacker Industries                                           \n               CD Songs    : 12                                                                \n               Label.......: Columbia                                                          \n               Album Info..:                                                                   \n                                                                                               \n          When Alice in Chains&amp;#039; debut album, Facelift, was released in 1990, about a year      \n          before Nirvana&amp;#039;s Nevermind, the thriving Seattle scene barely registered on the      \n          national musical radar outside of underground circles (although Soundgarden&amp;#039;s        \n          major-label debut, Louder Than Love, was also released that year and brought them a  \n          Grammy nomination). That started to change when MTV jumped all over the video for    \n          &quot;Man in the Box,&quot; giving the group a crucial boost and helping to pave the way for   \n          grunge&amp;#039;s popular explosion toward the end of 1991. Although their dominant influences\n          -- Black Sabbath, the Stooges -- were hardly unique on the Seattle scene, Alice in   \n          Chains were arguably the most metallic of grunge bands, which gave them a definite   \n          appeal outside the underground; all the same, the group&amp;#039;s sinister, brooding,        \n          suffocating sound resembled little else gaining wide exposure on the 1990 hard rock  \n          scene. Neither hedonistic nor especially technically accomplished, Alice in Chains&amp;#039;  \n          songs were mostly slow, oppressive dirges with a sense of melody that was undeniable,\n          yet which crept along over the murky sludge of the band&amp;#039;s instrumental attack in a   \n          way that hardly fit accepted notions of what made hard rock catchy and accessible.   \n          Although some parts of Facelift sink into turgid, ponderous bombast (particularly    \n          over the erratic second half), and the lyrics are sometimes immature, the overall    \n          effect is fresh, exciting, and powerful. While Alice in Chains would go on to do     \n          better and more consistent work, Facelift was one of the most important records in   \n          establishing an audience for grunge and alternative rock among hard rock and heavy   \n          metal listeners, and with its platinum sales certification, it also made Alice in    \n          Chains the first Seattle band to break through to a wider, less exclusively          \n          underground audience.                                                                \n                                                                                               ","torrent":{"xt":"urn:btih:8c0cd2a5ea17e046f72650beaca204f4f2fc640a","amp;dn":"Alice_In_Chains-Facelift-%28Retail%29-1990-HHI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c0cd2a5ea17e046f72650beaca204f4f2fc640a","infoHashBuffer":{"type":"Buffer","data":[140,12,210,165,234,23,224,70,247,38,80,190,172,162,4,244,242,252,100,10]},"announce":[],"urlList":[]}}