{"title":"Exit Ten Give Me infinity 2011","uid":8710619,"size":103665533,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8e1e6f3fe81743a16810cc02d36aff516a542542&amp;dn=Exit+Ten+Give+Me+infinity+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Kohouri","files":15,"time":1374226742,"description":"       EXIT TEN \nalbum: &quot;Give Me Infinity&quot; (2011)\n1. Suggest A Path\n2. Curtain Call\n3. Life\n4. Eyes Never Lie\n5. How Will We Tire\n6. Drama\n7. The Cursed\n8. Sunset\n9. Smoke\n10. Mountain\n11. Lion\n\n\nMany outfits would not have survived the misfortune that Exit Ten have had to endure. After record label Deep Burn went into administration, stocks of the bands releases were effectively put out of print, and the future looked bleak as the Reading quintets forward momentum ground to a halt. So it is testament to the bands resolve and musical integrity that three years later they return with such a refined and majestic album as 'Give Me Infinity'.\n\nAlthough already known for their melodic sensibilties (due in no small part to frontman Ryan Redmans enchanting vocals), the tuneful nature of the songs as been pushed considerably here. Opening track 'Life' is abudant in hooks, with Redman turning in not only some of his strongest writing but also one of the performances of his career. Indeed, his performance throughout is wholly impressive, as he is able to switch between a brooding, silky croon (see debut single 'Curtain Call') and, such as in the last minute of 'Sunset', a impassioned outpouring.\n\nThe instrumentation has also made a welcome progression, and stirs surprisingly by utilizing both the ambitious and the subdued . The orchestral touches dotted throughout the record, the strings in the slow burning 'Eyes Never Lie' for example, generate a grandiose ambience which really does add much to the songs, making for a certain bombastic and impressive experience which would be difficult to create without the inclusion of this new element. Coupled with this is some guitar work which refreshingly concentrates predominatly on shimmering soundscapes instead of constant riffing violence. This is not too say that the album is lacking in riffs (the aforementioned 'Curtain Call' features some fantastic hulking grooves), yet the understated chord work and gentley picked sections again work to boost the melancholic atmosphere of the tracks and allow Redmans melodies to take precidence.\n\nAfter such a prolonged period away from the limelight, Exit Ten needed to return with a strong album, and this they have undoubtedly done. 'Give Me Infinity' is a stellar collection of cerebral rock songs which should see this original and undervalued outfit take their rightful place amongst the British elite.","torrent":{"xt":"urn:btih:8e1e6f3fe81743a16810cc02d36aff516a542542","amp;dn":"Exit+Ten+Give+Me+infinity+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e1e6f3fe81743a16810cc02d36aff516a542542","infoHashBuffer":{"type":"Buffer","data":[142,30,111,63,232,23,67,161,104,16,204,2,211,106,255,81,106,84,37,66]},"announce":[],"urlList":[]}}