{"title":"El Circo De Los ExtraÃƒÂ±os VHS-Screener Spanish-Latino 2009","uid":5298131,"size":1468516352,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8e2ee6c18bfbcbe5a4106bc0bf65b58761f73cb0&amp;dn=El+Circo+De+Los+Extra%C3%83%C2%B1os+VHS-Screener+Spanish-Latino+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mois20","files":1,"time":1264128036,"description":"''El Circo de los ExtraÃƒÂ±os'' cuenta la aterradora historia de un chico que rompe, por desconocimiento, la tregua establecida hace mÃƒÂ¡s de 200 aÃƒÂ±os entre dos facciones enemigas de vampiros. Atrapado en un mundo fantÃƒÂ¡stico poblado por monstruos incomprendidos y grotescas criaturas nocturnas, el adolescente abandona la seguridad de una vida aburrida para cumplir su destino en un lugar sacado de las pesadillas.\n\nDarren (Chris Massoglia) tiene 14 aÃƒÂ±os y se parece a la mayorÃƒÂ­a de los crÃƒÂ­os de su barrio residencial. Pasa mucho tiempo con su mejor amigo, saca buenas notas y no suele meterse en lÃƒÂ­os. Pero el destino ha querido que un circo ambulante se cruce con Darren y con su amigo, y algo empieza a cambiar dentro de ÃƒÂ©l. A partir de ese momento, un vampiro llamado Larten Crepsley (John C. Reilly) le convierte en algo, digamos, sanguinario.\n\nEste reciÃƒÂ©n no muerto se une al Cirque du Freak, un espectÃƒÂ¡culo ambulante poblado de criaturas monstruosas, entre las que hay un chico serpiente, un hombre lobo y una mujer barbuda (Salma Hayek), encabezadas por un gigantesco voceador (Ken Watanabe). Mientras Darren aprende a usar sus nuevos poderes en el oscuro mundo, se convierte en una importante pieza para los vampiros y sus temibles enemigos. AdemÃƒÂ¡s de intentar sobrevivir, el adolescente deberÃƒÂ¡ luchar para que la guerra entre los dos bandos no devore lo que queda del mundo de los vivos.","torrent":{"xt":"urn:btih:8e2ee6c18bfbcbe5a4106bc0bf65b58761f73cb0","amp;dn":"El+Circo+De+Los+Extra%C3%83%C2%B1os+VHS-Screener+Spanish-Latino+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e2ee6c18bfbcbe5a4106bc0bf65b58761f73cb0","infoHashBuffer":{"type":"Buffer","data":[142,46,230,193,139,251,203,229,164,16,107,192,191,101,181,135,97,247,60,176]},"announce":[],"urlList":[]}}