{"title":"Samuel James - And For The Dark Road Ahead (2012)[FLAC]","uid":8113883,"size":230219269,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8e99e2ef8725dc29e9985bffce8a00c3e2ff387a&amp;dn=Samuel+James+-+And+For+The+Dark+Road+Ahead+%282012%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":14,"time":1360250526,"description":"NorthernBlues Music / NBM 0063 FLAC / Lossless / Log (100%) / CD\n\n1. Tan Sedan 4:19 \n2. Turkish Curse 2:23 \n3. Nineteen 4:29 \n4. Sleep Through All My Dreams 3:20 \n5. The Execution of Big Black Ben, Part 1 1:41 \n6. Rocket Man 3:14 \n7. The Secret 2:02 \n8. Camus 3:13 \n9. The Execution of Big Black Ben, Part 2 1:48 \n10. Holding Down The Sun 4:43 \n11. The Gurdon, Arkansas, One-Legged Table Blues 4:49 \n12. Another Backyard Burial 3:58 \n13. Ghost 4:09\n\nNo other music genre on its very own can crawl under your skin, shake you to the bones and reverberate in your soul like the blues. This music was made to affect you -- a visceral experience unlike any other -- and Samuel James captures this spirit with an unbridled vigor that the listener cannot help but sit up and pay attention.\n\nJames' latest CD, the 13-track &quot;And For the Dark Road Ahead,&quot; is a blend of straightforward blues. Much of it is accompanied only by harmonica, slide guitar and Samuel's unique style, which is nothing short of astounding to witness and hear.\n\nThe first track, &quot;Another Backyard Burial,&quot; puts the listener right there in the 1920s-era Delta blues, with traditional blues licks chugging through and reminding us of our instinctive and emotional roots. Yet James also exudes a vulnerability with his whispery/talking style of singing. He is never fully singing a line; he is talking, telling stories.\n\nTwo tracks on the CD are only spoken word in poem form, the two-part &quot;The Execution of Big Black Ben.&quot; In poignant fashion, James takes a break from all the stomping and in a few short phrases expresses a short story of a man who suffers from the horrors of racism, but inevitably is vindicated. Big Black Ben could have been living anywhere in the U.S. before the 1960s.\n\n&quot;Nineteen&quot; highlights James' unbelievable ability to play guitar and use it for the rhythm component, with his guitar pick tapping and plucking a single string to form the base to his playing. At the same time, he sings/talks/whispers,\n\n&quot;Without a good woman/ You're as much use as a cigarette ash in a flood/ Better settle down, son/ Adventure just ain't in your blood.&quot;\n\nJames wavers back and forth from plucking and tapping to breaking out with a tasteful, upbeat, bluesy guitar picking refrain.\n\nAll the songs on &quot;And For the Dark Road Ahead&quot; are cohesive. James never falters from his roots, but at the same time, the songs are surprisingly different and full of character. What James accomplishes is a dance between heart, soul and hands; the making of something from nothing but a darkness that tells a story of hope in the end.\n\nI suppose this is the blues in the true sense of the word, and James does it with integrity and resolve.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:8e99e2ef8725dc29e9985bffce8a00c3e2ff387a","amp;dn":"Samuel+James+-+And+For+The+Dark+Road+Ahead+%282012%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e99e2ef8725dc29e9985bffce8a00c3e2ff387a","infoHashBuffer":{"type":"Buffer","data":[142,153,226,239,135,37,220,41,233,152,91,255,206,138,0,195,226,255,56,122]},"announce":[],"urlList":[]}}