{"title":"Penoza S04 2015 Seizoen 4 Deel 1 -5","uid":12560339,"size":2019646930,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:8f59ab199af7c019f3d661ed43b7cdd1b2be6482&amp;dn=Penoza+S04+2015+Seizoen+4+Deel+1+-5&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":5,"time":1444695679,"description":"AFLEVERING 1 - De Weduwe loopt weer\r\n\r\nCarmen ontwaakt een aantal maanden na het ongeluk uit haar coma. Tijdens haar revalidatie wordt ze overgebracht naar de gevangenis. Officier van Justitie Justine de Heer wil een deal met haar sluiten. Ze laat Carmen vrij in ruil voor infiltratie in het Mexicaanse drugskartel. Boris bedenkt ondertussen een plan om de dader van de aanslag op zijn moeder op te sporen. Natalie en Storm runnen samen een eigen restaurant en hebben besloten om samen te gaan wonen.\r\n\r\n\r\nAFLEVERING 2 - DUBBELE MOORD\r\n\r\nDe vreugde en verbazing over de vrijlating van Carmen worden overschaduwd door het verdwijnen van Carmens zoon Boris. Ze moet haar infiltratie geheimhouden en een dekmantel opzetten om met de Mexicanen te kunnen dealen. Samen met Sandrina wendt ze zich tot een oude bekende, Van Zon. Natalie, die met Storm een goedlopend restaurant heeft, is niet gelukkig met de keuzes van haar moeder. Zoon Lucien krijgt een nieuwe liefde. Carmen komt erachter waar Boris zit.\r\n\r\nAFLEVERING 3 - Waar is mijn zoon?\r\n\r\nCarmen houdt de Mexicaanse bende verantwoordelijk voor de aanslag op John en Koen. Ze moet een ontmoeting arrangeren en realiseert zich dat de Mexicanen de zaak niet vertrouwen. El Almarillo, de baas van de Mexicanen, eist dat Carmen als test een kleine partij cocaïne het land binnensmokkelt. Thuis wordt haar geheim onhoudbaar en Carmen bekent haar familie dat ze voor Justitie werkt. Van Zon wil wel investeren in Carmens zaak. En waar ligt Boris' loyaliteit?\r\n\r\nAFLEVERING 4 - WANHOPIGE ZOEKTOCHT\r\n\r\nNu El Almarillo Carmen verdenkt van infiltratie, geeft hij haar een tweede test. Vanuit de gevangenis adviseert Luther haar hierover. Carmen begint te beseffen dat de Mexicanen niets te doen hebben met de verdwijning van Boris. Carmen krijgt een tip waar hij zich bevindt, maar wil hij nog wel terug naar Carmen?\r\n\r\nAFLEVERING 5 - GEVAARLIJKE ONTMOETING\r\n\r\nBerry treft Boris bij de Coach waar hij een gedegen opleiding krijgt. De Mexicanen vinden het bewijs dat Carmen een infiltrant is. Ze besluit met hen een deal op te zetten, en Justine de Heer buitenspel te zetten. Natalie werkt met tegenzin mee met haar moeder, maar zij heeft ook een eigen geheim. Alles lijkt goed te gaan... Ondertussen moet er alles aan gedaan worden om een partij coke veilig te stellen","torrent":{"xt":"urn:btih:8f59ab199af7c019f3d661ed43b7cdd1b2be6482","amp;dn":"Penoza+S04+2015+Seizoen+4+Deel+1+-5","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f59ab199af7c019f3d661ed43b7cdd1b2be6482","infoHashBuffer":{"type":"Buffer","data":[143,89,171,25,154,247,192,25,243,214,97,237,67,183,205,209,178,190,100,130]},"announce":[],"urlList":[]}}