{"title":"Bible Stories for Children #4 - MP3 version","uid":4693464,"size":747640959,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8fcb3c61be494bbfdb25add96fdcc514628961cb&amp;dn=Bible+Stories+for+Children+%234+-+MP3+version&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ruthchiun","files":24,"time":1233476479,"description":"Bible Stories (Dramatized) for children.  To purchase the tapes or CDs, please visit the following website: &lt;a href=&quot; http://yourstoryhour.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://yourstoryhour.org/&lt;/a&gt;\n\nThis is the MP3 format.\n\n\nThis is the fourth series which contain the following stories:\n\nThe Daring Act.  Queen Esther saves her people.\t\n\nThe Land of Uz.  Job is tested for his faithfulness.\t\n\nThe Charming Prince.  Nebuchadnezzar becomes king of Babylon and he takes Jews captive from Jerusalem, including Daniel and his three friends.\t\n\nThe Four Friends.  Daniel and his three friends are taken to Babylon.  Their first test of faithfulness to God comes in the area of diet.\t\n\nIn the King's Court.  King Nebuchadnezzar has a dream but can not remember the dream.  His advisers are of no help but God gives Daniel the same dream and the interpretation.\t\n\nThe Fiery Affair at Dura.  Shadrach, Meschach and Abednego are thrown into the fiery furnace.\t\n\nSeven Years a Beast.  Nebuchadnezzar loses his mind after forsaking God.\t\n\nThe Bloodless Hand.  God's judgment comes during Belshazzar's drunken feast.\t\n\nThe Lions and the Villains.  Daniel in the lion's den.\t\n\nThe Man Who Ran From God.  The story of Jonah and the whale.\t\n\nMary of Nazareth.  This story presents the birth of Jesus, and the events just prior to the Savior's birth.\t\n\nBorn Under a Star.  Events surrounding the birth of Jesus.\t\n\nThe King Grows Up.  Jesus childhood at home.\t\n\nA Voice in the Desert.  John the Baptist's preaching and Jesus' baptism.\t\n\nJourney to Jerusalem.  First cleansing of the temple, and Jesus visits with Nicodemus and the woman at the well.\t\n\nHappiness in Galilee.  Miracle of Jesus\t\n\nJesus the Healer.  Jesus heals a leper and the paralytic let down through the roof.\t\n\nMatthew's Magnificent Party.   Matthew is called by Jesus to be a disciple.\t\n\nTroubled Waters.  Jesus heals on the Sabbath.\t\n\nRoad to Happiness.  The ordination of the 12 disciples and healing of the Roman officer's servant.\t\n\nThe Greatest Miracle.  The stories of the resurrection of the widow's son, Simon's feast and a demon cast out.\t\n\nPrisoner in a Dungeon.  The death of John the Baptist.\t\n\nStormy Times.  Jesus calms the storm, heals Jairus' daughter and cast out demons from the two demoniacs.\t\n\nA Boy's Amazing Lunch -  Jesus feeds 5,000 with a small boy's lunch.  A Fisherman Who Couldn't Swim - Peter walks on water.","torrent":{"xt":"urn:btih:8fcb3c61be494bbfdb25add96fdcc514628961cb","amp;dn":"Bible+Stories+for+Children+%234+-+MP3+version","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fcb3c61be494bbfdb25add96fdcc514628961cb","infoHashBuffer":{"type":"Buffer","data":[143,203,60,97,190,73,75,191,219,37,173,217,111,220,197,20,98,137,97,203]},"announce":[],"urlList":[]}}