{"title":"David Ebershoff - The Danish Girl","uid":13494491,"size":3459859,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8fdb721d2d857e0654038ea5a5962f4d79510165&amp;dn=David+Ebershoff+-+The+Danish+Girl&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"i019s","files":4,"time":1455148320,"description":"The danish girl\r\ndi David Ebershoff (Autore), A. Mioni (Traduttore)\r\n\r\n\r\n\r\nChe cosa succede quando vedi la persona che ami cambiare radicalmente sotto i tuoi occhi? Tutto nasce da un semplice favore che una moglie chiede a suo marito durante una giornata qualsiasi. &quot;The Danish Girl&quot; di David Ebershoff, un romanzo sui lati oscuri e misteriosi dell'amore e della sensualità. Siamo a Copenaghen, inizi Novecento: entrambi stanno dipingendo nel loro atelier, lui realizza paesaggi velati dalla nebbia del Nord; lei ritrae su enormi tele i ricchi committenti della borghesia cittadina. Proprio per completare uno di questi lavori, il ritratto di una nota cantante d'opera, Greta domanda al marito di posare in abiti femminili. Da principio Einar è riluttante, ma presto viene completamente sedotto dal morbido contatto della stoffa sulla sua pelle. Via via che si abbandona a questa esperienza, il giovane entra in un universo sconosciuto, provando un piacere che né lui né Greta avrebbero mai potuto sospettare. Quel giorno Einar ha un'autentica rivelazione: scopre infatti che la sua anima è divisa in due e forse lo è stata sempre: da una parte l'artista malinconico e innamorato di sua moglie, dall'altra Lili, una donna mossa da un prepotente bisogno di vivere...\r\n\r\nTorrent Hash: 8FDB721D 2D857E06 54038EA5 A5962F4D 79510165","torrent":{"xt":"urn:btih:8fdb721d2d857e0654038ea5a5962f4d79510165","amp;dn":"David+Ebershoff+-+The+Danish+Girl","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fdb721d2d857e0654038ea5a5962f4d79510165","infoHashBuffer":{"type":"Buffer","data":[143,219,114,29,45,133,126,6,84,3,142,165,165,150,47,77,121,81,1,101]},"announce":[],"urlList":[]}}