{"title":"Fobi - Organic Sources 2012 [psychedelic trance]","uid":7349207,"size":136852897,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:92019e7e5a1d7eaa8ec8dbd62c945ada47f7061b&amp;dn=Fobi+-+Organic+Sources+2012+%5Bpsychedelic+trance%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ClydeL","files":-1,"time":1339536264,"description":"Fobi - Organic Sources\n\n\nGenre: Psychedelic\nLabel: No Comment Records\nCatalog#: NCRCD006\nRls Date: May 2012\nMedium: CDDA                                          \nBitrate: VBR kbps\nMode: Joint Stereo\nTracks: 10\nLength: 74:11 min\nSize: 135.84MB\n\nTracklist:\n\n01. I Think U Know 7:58\n02. Organic Sources 7:42\n03. Illusions 7:18\n04. Fireplace (with Zaiklophobia) 8:32\n05. Wood Masks 6:34\n06. Archeological Artefacts 7:24\n07. This World Is A Room For Everyone 7:21\n08. Things from the Future 7:34\n09. Psychometric Properties 6:13\n10. Organic Sources 7:35\n\nNew tunes have been growing! Take a grasp at the tail of the shooting star!\n\nFresh, brilliant and crystalline clear tunes by 'Fobi', presenting his new album 'Organic Sources', that will for sure make you feel as if you just had a Pan-Galactic Gargel Blaster, like having your brain smashed out by a slice of lemon wrapped round a gold brick!\n\nAgain this promising, young new talent is following the urge inside to give us a view into his inner world, giving a part of himself to everyone to enjoy, to reflect and recognize themselves inside the music. Staying true to his personal, individually developed style, he seeks to push trough limits of psychedelic-night trance once more by keeping the Groove inside his chunky, jumpy, full-frontal baselines that let your feet move all on themselves. Combining natural with constructed, hard and regardless but still all soft edged, focused and to the point, beautifully un-overpacked so u can actually listen to each part of the well composed tunes. Mixing organic, mysterious, magic sounds with joyful madness into spooky, wobbly, bubbly, aquatic frequencies, powerful breaks and samples I recommend u should pay attention to! Each track is a story for itself, as you can find a red thread following trough every song and those collected on an album that can be called a high standard, strong, and truly recognizable piece of art. You will find the 'Orgon Energy', the energy that is conceived as anti-entropic principle of the universe, a massless, omnipresent substance, flowing through yourself when you give yourself in to this music! Overcome your fears, transcend your phobias, there is no chance to escape these merciless tunes!","torrent":{"xt":"urn:btih:92019e7e5a1d7eaa8ec8dbd62c945ada47f7061b","amp;dn":"Fobi+-+Organic+Sources+2012+%5Bpsychedelic+trance%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92019e7e5a1d7eaa8ec8dbd62c945ada47f7061b","infoHashBuffer":{"type":"Buffer","data":[146,1,158,126,90,29,126,170,142,200,219,214,44,148,90,218,71,247,6,27]},"announce":[],"urlList":[]}}