{"title":"Zotrix","uid":12177883,"size":311629399,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:922945de6ba0af3e9eae6bfe458837af0655f083&amp;dn=Zotrix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1438354674,"description":"About This Game\nZotrix is an arcade space shooter inspired by early shooter games on arcade machines from 80's and early 90's. Designed for all generations it contains missions with nice and colorful enemies while focused on the arcade element of the gameplay.\n\nYou dive into deep space escorting a cargo ship from your fleet. Quickly you realize you're within the boundaries of enemy territory. Chains of enemy ships are lining up one by one while you perform maneuvers to clear the perimeter and avoid being cleared out yourself. Victory doesn't come easy as you have to earn every single space credit out there fighting in over 50 missions.\n\nBy clearing your mission objectives, reward is coming to your account and you're ready to upgrade your ship with decoys, shields, laser boosters and much more. You can even buy a new, better fighter. As you progress, you will get engaged in trading earned resources such as cobalt, nickel, palladium and others in trading room every space station features.\n\nBuild your strategy by carefully choosing routes from your space station towards another and have your take in every mission. Each mission will pit a challenge in front of you and most of the missions will get you to face a bigger and badder alien ships","torrent":{"xt":"urn:btih:922945de6ba0af3e9eae6bfe458837af0655f083","amp;dn":"Zotrix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"922945de6ba0af3e9eae6bfe458837af0655f083","infoHashBuffer":{"type":"Buffer","data":[146,41,69,222,107,160,175,62,158,174,107,254,69,136,55,175,6,85,240,131]},"announce":[],"urlList":[]}}