{"title":"Book of Words Trilogy by J.V. Jones","uid":8826327,"size":1511681,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:926f6df0c265c26786fe0eeacda1ab5b665f010c&amp;dn=Book+of+Words+Trilogy+by+J.V.+Jones&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":3,"time":1376856644,"description":"The Baker's Boy (Book of Words, #1) At vast Castle Harvell, Where King Lesketh lies dying, two fates collide. In her regal suite, young Melliandra, the daughter of an influential lord, rebels against her forced betrothal to the sinister Prince Kylock. In the kitchens, an apprentice named Jack is terrified by his sudden, uncontrolled power to work miracles. Together they flee the castle, stalked by a sorcer who has connived for decades to control the crown, committing supernatural murder to advance his schemes. Meanwhile, a young knight begins a quest leaving behind his home and family to seek out the treacherous Isle of Larn, where lies a clue to his desperate search for the truth. And a wondrous epic of darkness and beauty begins...\n\nA Man Betrayed (Book of Words, #2) At Castle Harvell demented Prince Kylock grabs the reins of power and hate by murdering his father. Harvell's two young refugees are torn apart by the storms of war: Headstrong young Melliandra is captured by brutal slavers and Jack, whose wild power works miracles, falls prey to a smuggler's lying charms and a woman's seductive schemes. Meanwhile, in the distant stronghold of Bren, Kylock's betrothed, beautiful, mad Catherine, dabbles with darkest sorceries. A knight's shattered destiny is about to lead from death-sport pits to the blood-strewn creation of an empire--and a wondrous epic of grandeur and magic continues...\n\nMaster and Fool (Book of Words, #3) The Known Lands are teetering on the brink of war. Desperate to avert worldwide catastrophe, Jack, the baker's boy, must learn to harness the full strength of his magic to face his ultimate destiny--a final confrontation with the murderously evil Kylock.","torrent":{"xt":"urn:btih:926f6df0c265c26786fe0eeacda1ab5b665f010c","amp;dn":"Book+of+Words+Trilogy+by+J.V.+Jones","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"926f6df0c265c26786fe0eeacda1ab5b665f010c","infoHashBuffer":{"type":"Buffer","data":[146,111,109,240,194,101,194,103,134,254,14,234,205,161,171,91,102,95,1,12]},"announce":[],"urlList":[]}}