{"title":"Coast to Coast AM July 09, 2013 - Property Issues Food Imperiali","uid":8672985,"size":55500388,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:92d7798f10a20f2dcbb570a98117280231e1bdc5&amp;dn=Coast+to+Coast+AM+July+09%2C+2013+-+Property+Issues+Food+Imperiali&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pyramid91","files":5,"time":1373532876,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n07-09-13\nHost:\nGeorge Noory\nGuests:\nReid Lance  Rosenthal,                   Scott  Tips\nIn the first half, rancher, realtor, and author Reid Lance Rosenthal talked about Agenda 21 anti-private property edicts, and government encroachment on freedoms. Agenda 21 got its start at a conference of UN environmental organizations in 1992, and over the years it's become &quot;a 40 chapter ever-evolving bible of globalism,&quot; obliterating the rights of sovereign nations, and eliminating personal liberties for the good of the collective, he remarked. Under the guise of such terms as sustainable development, and viable communities, the Agenda seeks to increasingly control human activity, Rosenthal suggested. Agenda 21 promotes the concept of &quot;regionalism,&quot; pushing for everyone to live in compact urban areas, and casts a negative light on suburbs and rural areas, he continued. \nGovernmental property confiscation is up 100 fold in the last 10 years, and &quot;the heyday of property seizures by government for political and fiscal reasons is just beginning,&quot; he warned. Agenda 21 has come to Brazil in full force, and there's been more than 4,000 people displaced with their homes demolished, and troops sporting a UN logo were involved in the re-locations, Rosenthal reported. Eminent domain, the right of a government to take a property from a private landowner &quot;for the public good,&quot; is a growing problem, with 13 million acres in the US being targeted for &quot;federalization,&quot; he added. Rosenthal was also critical of the push for alternative energy in the US, characterizing it as a &quot;cloak of crony capitalism&quot; in which most of its green jobs created go overseas, and further, the industry is highly subsidized, and can't stand on its own.  \n------------------------------------------------- \nIn the latter half, attorney Scott Tips, the General Counsel for the National Health Federation, the world's oldest health-freedom organization for consumers, discussed how corporations are attempting to dominate markets though global food imperialism, and deny the public access to vitamins and supplements. Big agriculture and 'big pharma' are &quot;dumbing down&quot; the food supply and filling it with toxins, &quot;so they're basically poisoning us and devitalizing the foods,&quot; he said. Codex Alimentarius, created 50 years ago, to establish international guidelines and standards for foods and supplements has been pushing to lower the amount of recommended daily intakes of vitamins as well as control or restrict health supplements. FDA bureaucrats who attend the Codex meetings don't represent the American consumer but rather big business, and the US is connected to their rulings via various trade agreements, he detailed. \nStatistics show that supplements are generally quite safe, he cited, much more so than hospitals, and pharmaceutical drugs, for instance. People like Senator Dick Durbin, who is promoting a bill to control supplements as a way to protect the consumer, is actually more interested in protecting the existing big business, Tips opined. The answer isn't to build up more government powers-- this doesn't secure freedom, he continued. His organization has looked into such problems as excessive vaccinations, water fluoridation, over-farming reducing nutrients, and GMOs, and the common denominator in all of them is that they serve to lower fertility rates. \nNews segment guest: Neil Slade\nWebsite(s):\n thenhf.com\n reidlancerosenthal.com\n landforloveandmoney.com\nBook(s):\n Threads West\n Land For Love And Money\n Maps of Fate\n Codex Alimentarius - Global Food Imperialism \n","torrent":{"xt":"urn:btih:92d7798f10a20f2dcbb570a98117280231e1bdc5","amp;dn":"Coast+to+Coast+AM+July+09%2C+2013+-+Property+Issues+Food+Imperiali","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92d7798f10a20f2dcbb570a98117280231e1bdc5","infoHashBuffer":{"type":"Buffer","data":[146,215,121,143,16,162,15,45,203,181,112,169,129,23,40,2,49,225,189,197]},"announce":[],"urlList":[]}}