{"title":"Ultimate Rule34 Image Collection","uid":5251796,"size":71062182436,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:932957aa06f700866afa5c3fc54d1ea4e0fa9fbd&amp;dn=Ultimate+Rule34+Image+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Gearbox80","files":301,"time":1262387350,"description":"If you still have any innocence left over from your childhood and you want to keep it, don't continue any farther. Rule 34 is 'If it exists, there is p0rn of it, no exceptions'. Generally, 34 is of your (or your kid's) childhood cartoon characters (such as Frog and Toad, Sonic the Hedgehog, Pooh Bear, Digimon, Pokemon, Sgt. Frog, Bucky O'Hare, Bugs Bunny, Tiny Toons, Animaniacs, etc) and it is almost exclusively drawn.\n\nSince before the internet was the internet, and before there were 'rules of the internet' I have been keeping rule 34 images. However, they don't do any good if I am the only one who can look at them. To that end, I am going to upload my collection; all of it. This collection contains about 400,000 unique Rule 34 images in 299 zip files.\n\nThe files I have are all de-duped (no duplicates, though there may be different resolutions of the same pic) via hash functions.  Metadata for each image is also included in CSV format.  This data includes MD5 &amp; SHA1 hashes, an artist, and tags for each image.\n\nBe aware my upload is intermittent, but I will seed this for years.  The collection is too large to be lost.\n\n--Gearbox8080","torrent":{"xt":"urn:btih:932957aa06f700866afa5c3fc54d1ea4e0fa9fbd","amp;dn":"Ultimate+Rule34+Image+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"932957aa06f700866afa5c3fc54d1ea4e0fa9fbd","infoHashBuffer":{"type":"Buffer","data":[147,41,87,170,6,247,0,134,106,250,92,63,197,77,30,164,224,250,159,189]},"announce":[],"urlList":[]}}