{"title":"Dirty Job, A - Christopher Moore-viny","uid":6414803,"size":1048973,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:93772252a64a1e44baf3b2f265ab3d57af2533ce&amp;dn=Dirty+Job%2C+A+-+Christopher+Moore-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1306134821,"description":"Dirty Job, A - Christopher Moore-viny\n\nCharlie Asher is a pretty normal guy. A little hapless, somewhat neurotic, sort of a hypochondriac. He's what's known as a Beta Male: the kind of fellow who makes his way through life by being careful and constant -- you know, the one who's always there to pick up the pieces when the girl gets dumped by the bigger/taller/stronger Alpha Male.\n\nBut Charlie's been lucky. He owns a building in the heart of San Francisco, and runs a secondhand store with the help of a couple of loyal, if marginally insane, employees. He's married to a bright and pretty woman who actually loves him for his normalcy. And she, Rachel, is about to have their first child.\n\nYes, Charlie's doing okay for a Beta. That is, until the day his daughter, Sophie, is born. Just as Charlie -- exhausted from the birth -- turns to go home, he sees a strange man in mint-green golf wear at Rachel's hospital bedside, a man who claims that no one should be able to see him. But see him Charlie does, and from here on out, things get really weird. . . .\n\nPeople start dropping dead around him, giant ravens perch on his building, and it seems that everywhere he goes, a dark presence whispers to him from under the streets. Strange names start appearing on his nightstand notepad, and before he knows it, those people end up dead, too. Yup, it seems that Charlie Asher has been recruited for a new job, an unpleasant but utterly necessary one: Death. It's a dirty job. But hey, somebody's gotta do it.\n\nChristopher Moore, the man whose Lamb served up Jesus' &quot;missing years&quot; (with the funny parts left in), and whose Fluke found the deep humor in whale researchers' lives, now shines his comic light on the undiscovered country we all eventually explore -- death and dying -- and the results are hilarious, heartwarming, and a hell of a lot of fun. ","torrent":{"xt":"urn:btih:93772252a64a1e44baf3b2f265ab3d57af2533ce","amp;dn":"Dirty+Job%2C+A+-+Christopher+Moore-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93772252a64a1e44baf3b2f265ab3d57af2533ce","infoHashBuffer":{"type":"Buffer","data":[147,119,34,82,166,74,30,68,186,243,178,242,101,171,61,87,175,37,51,206]},"announce":[],"urlList":[]}}