{"title":"[Kung Fu] The Young Master (1980) - DVD/Rmvb","uid":3673561,"size":401456555,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:940ecc115255c881c32ecf2a278fddd7690bb3f3&amp;dn=%5BKung+Fu%5D+The+Young+Master+%281980%29+-+DVD%2FRmvb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"John Smith","files":4,"time":1177588116,"description":"The Young Master \n\nHKFlix Says:  \t4.5 Stars\n\nPlot:\tWhen Dragon&amp;#039;s brother falls in with bad company, he sets out to find him. Along the way, he finds himself at odds with the local sheriff and his son. To clear his brother&amp;#039;s name, he&amp;#039;s forced to engage in a fight to the finish with a villainous bandit.\n\nOverview:\tThe Young Master (1980) marks the first film Jackie Chan starred in (and also directed) for Golden Harvest, the film company that made Chan classics like Drunken Master II and Police Story III (a.k.a. Supercop). Chan plays Dragon, a student whose martial arts school is in competition against a more affluent rival school. The two groups face off in an annual lion dance competition in which Chan finds himself up against his own schoolmate Tiger, who is secretly being paid to perform for the rival school. When Tiger is found out and ejected from the group, Dragon goes after him. Tiger gets deeper into trouble, taking part in a robbery and jailbreak of the rival school&amp;#039;s crooked headmaster, Kam. Through a series of mixups, Dragon is mistaken for Tiger and he has to clear his name in a final showdown against Kam (Whang Inn-sik). The last 30 minutes of The Young Master consists of nonstop fighting scenes, the first with Chan donning a makeshift dress to employ skirt-style kung fu. The second fight sequence is a 20-minute showdown of Chan vs. Whang, which showcases Whang&amp;#039;s talents as a master of hapkido (a Korean style of martial arts). The opening scene is equally stunning, with the two lion dance teams playing chicken on a six-inch-wide plank suspended in midair. The Young Master broke all box-office records in Hong Kong upon its release, solidifying Chan&amp;#039;s position as a star and setting a high bar of action sequence and stunt standards for his many films to come.\n-Shannon Gee\n\nCast: \tJackie Chan (Sing Lung)  ||  Yuen Biao  ||  Wei Pei  ||  Li Li-Li  ||  Whong In Sik \n","torrent":{"xt":"urn:btih:940ecc115255c881c32ecf2a278fddd7690bb3f3","amp;dn":"%5BKung+Fu%5D+The+Young+Master+%281980%29+-+DVD%2FRmvb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"940ecc115255c881c32ecf2a278fddd7690bb3f3","infoHashBuffer":{"type":"Buffer","data":[148,14,204,17,82,85,200,129,195,46,207,42,39,143,221,215,105,11,179,243]},"announce":[],"urlList":[]}}