{"title":"Total Marvel Week of 3/4/2014 (darkhomr) [ALL]","uid":9720797,"size":515640087,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:94c65d14c5b5693b88fb07e41e10ad345f36f811&amp;dn=Total+Marvel+Week+of+3%2F4%2F2014+%28darkhomr%29+%5BALL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dadrkhomr","files":14,"time":1394233114,"description":"Each week I will be posting the current week's Marvel titles These are the titles for February 18, 2014. \n\n Included in this pack will be all Marvel comics and Marvel NOW comics. What will NOT be included is Disney stuff, TV stuff, and the kids books. Those will be included (when available) in my Zero Day pack.\n\n My release packs are as follows: \n\n\nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\nIndependent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning) \nTotal DC (all DC comics released for the current week.  Released by Saturday each week.  Does not include digital only releases)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\n\n\nAvengers AI #10 (3/5/2014)\n\nS.H.I.E.L.D. priority alert: Monica Chang and her robot-hunting partner Jocasta (?!) have been ordered to confiscate and/or eliminate unregistered artificial intelligences on sight. UNAUTHORIZED ENTRY: Hank Pym, Vision and the Uncanny Avengers have been spotted in the Diamond. All citizens are advised to be cautious of this rebel element. WARNING: All hail Dimitrios OR ELSE! \n\nCaptain America #18 (3/5/2014)\n\nWill Dr. Mindbubble shatter Captain America's already fragile psyche? The Iron Nail rises. SHIELD's greatest secrets revealed to the world's most dangerous man. \n\nDeadpool:  the Gauntlet #9\n\nDeadpool finally gets Queen Shiklah to New York City, but it turns out, and I know you're all shocked by this...Dracula was not entirely forthcoming about the mission! Get ready for a panic in the streets with Deadpool's epic Infinite Comics tale! \n\nIron Man #22 (3/5/2014)\n\n'IRON METROPOLITAN' CONCLUSION! MANDARIN CITY is aflame. Troy is in ruins. Who comes to help TONY STARK in his hour of need? Will Tony make the ultimate sacrifice to save the city? And WHO is hunting the ring-bearers? \n\nLoki Agent Of Asgard #2 (3/5/2014)\n\nLoki vs. Lorelei! It's the battle of the Asgardian younger siblings--from the casinos of Monte Carlo to a speed date in New York! Loki goes speed dating. We should have mentioned that earlier, really. \n\nMagneto #1 (3/5/2014)\n\nOnce the deadliest, most feared mutant mastermind on the planet, MAGNETO is no longer the man he once was. After falling in with Cyclops and the X-Men, Erik Lehnsherr became just one more pawn in another man's war. But now, determined to fight the war for mutantkind's survival on his own terms, Magneto sets out to regain what he's lost . . . and show the world exactly why it should tremble at the sound of his name. Magneto will safeguard the future of the mutant race by hunting down each and every threat that would see his kind extinguished--and bloody his hands that they may never be a threat again. \n\nMoon Knight #1 (3/5/2014)\n\nMarc Spector is Moon Knight!...Or is he? It's hard to tell these days, especially when New York's wildest vigilante protects the street with two-fisted justice and three--that's right, count 'em--different personalities! But even with the mystical force of Khonshu fueling his crusade, how does the night's greatest detective save a city that's as twisted as he is? The road to victory is going to hurt. A lot. Marvel's most mind-bending adventure begins NOW as Moon Knight sleuths his way to the rotten core of New York's most bizarre mysteries!\n\nNew Warriors #2 (3/5/2014)\n\nThe Evolutionaries are on the war path! If it's not human, it DIES. What does the High Evolutionary want with Nova? All across the world, the New Warriors come together... SEE! Sun Girl and Haechi deal with Morlocks! WITNESS! Justice and Speedball fight to save magic! CRINGE! As Scarlet Spider refuses to play well with others. \n\nNight Of Living Deadpool #4 (of 4) (3/5/2014)\n\nDeadpool's battle with the ambulatory dead comes to a close! This is going to be a dark series, my friends. Dark. \n\nNova #14 (3/5/2014)\n\nIT'S A BAD TIME TO BE A NOVA! David Baldeon (Scarlet Spider) joins Gerry Duggan for an interstellar adventure with Beta Ray Bill begins with a bang (and a massive robotic battle)! It's clean-up time as Sam and Bill ride through the cosmos attempting to right the wrongs that Sam caused!\n\nPunisher #3 (3/5/2014)\n\nFrank discovers the Dos Sols gang's newest weapon. Bad news for Frank. The Punisher dukes it out with one of the Marvel U's BIG BADS! A daring raid on the Dos Sols compound goes absolutely NOT according to plan! \n\nShe-Hulk #2 (3/5/2014)\n\nJennifer opens her own practice, but things aren't going as smoothly as she'd like. A new client rides into town...but is he hero or villain? Guest-starring Patsy Walker, Hellcat!\n\nUncanny X-Men #18 (3/5/2014)\n\nCyclops finds himself in serious trouble. Who's got Scott Summers at gunpoint? \n\nWolverine and the X-Men #1 (3/5/2014)\n\nWELCOME TO THE JEAN GREY SCHOOL OF HIGHER LEARNING! The ALL NEW MARVEL NOW smash hit series schools with Jason Latour (WINTER SOLDIER) and Mahmud Asrar (X-MEN) leading the charge with drama, action and homework(?)! World-famous X-Men Wolverine, Storm, and a star-studded faculty must educate the next generation all-powerful, but inexperienced mutants! But with their own lives steeped in deadly enemies and personal crises, how can the X-Men guide and educate--let alone defend--the school? At the Jean Grey School, you never know who will enroll...or who will lead the class! And what mysterious organization waits in the shadows to destroy Wolverine's mutant sanctuary? These questions and more are answered in the All-New Marvel Now sure-to-be-smash, WOLVERINE AND THE X-MEN #1! \n \n\n\n\n","torrent":{"xt":"urn:btih:94c65d14c5b5693b88fb07e41e10ad345f36f811","amp;dn":"Total+Marvel+Week+of+3%2F4%2F2014+%28darkhomr%29+%5BALL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94c65d14c5b5693b88fb07e41e10ad345f36f811","infoHashBuffer":{"type":"Buffer","data":[148,198,93,20,197,181,105,59,136,251,7,228,30,16,173,52,95,54,248,17]},"announce":[],"urlList":[]}}