{"title":"BraveStarr Ep. 34-44","uid":9096148,"size":2010466351,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:94d85918771ac3549e67967246261dc366ffe5af&amp;dn=BraveStarr+Ep.+34-44&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lonewolfmoon","files":12,"time":1382681201,"description":"The discovery of Kerium, a rare and powerful magic crystal, brings an infinite number of colonists from all the corners of the galaxy to the distant planet New Texas. Some are good and honest, others very malicious but no one is more dangerous than Tex Hex the leader of the Carrion Bunch, a group of outlaws under the control of the mysterious group Stampede. Hex seeks to control this immense mineral richness at all costs than is Kerium. Only one person can put a stop on his plans: BraveStarr. When there was an obstacle in the way, BraveStarr called for the power of a particular animal and used that ability to move the obstacle, like using the strength of a bear to move a boulder, or the speed of a puma to catch the criminal, the eyes of a hawk, or the ears of a wolf. To help him in the fight for the cause of justice, he had Thirty-Thirty, his horse that can transform into a human-like creature being able to stand on it's hind legs, talk and fight alongside him. BraveStarr lived in Fort Kerium. His advisor was the wise, elderly Shaman.","torrent":{"xt":"urn:btih:94d85918771ac3549e67967246261dc366ffe5af","amp;dn":"BraveStarr+Ep.+34-44","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94d85918771ac3549e67967246261dc366ffe5af","infoHashBuffer":{"type":"Buffer","data":[148,216,89,24,119,26,195,84,158,103,150,114,70,38,29,195,102,255,229,175]},"announce":[],"urlList":[]}}