{"title":"Ubuntu Live CD to ROOT HTC phones, with adb","uid":5738714,"size":657348608,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:955bb4e637ccf77b8e0e9746639defcb88f3d765&amp;dn=Ubuntu+Live+CD+to+ROOT+HTC+phones%2C+with+adb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"downer3d","files":1,"time":1280921246,"description":"Burn the iso to a cd (This can be done with any cd burning software, imgburn found here is free)\n\nPut the CD into your computer cd/dvd drive and reboot your computer.\n\nYou must make your computer boot from CD, there are many different ways to do this depending on what computer you have, most recent computers have this enabled by default. Here is a guide that may help if you can't get this to work:Enable Boot from CD\n\nOnce it boots from the cd it will show a small picture of a keyboard and a person, do not press anything here and it will come to a window that will allow you to select your language.\n\nSelect your language and click &quot;Try Ubuntu 10.04 LTS&quot;. This will boot up to a standard Ubuntu livecd desktop.\n\nOn your phone click menu, settings, applications, development, usb debugging\n\nOn the computer click &quot;Places&quot; on the top menubar and click &quot;Home Folder&quot;. This will open a file explorer window, in that window is a script called &quot;reflash.sh&quot;. \n\nDouble click reflash.sh. A window will pop up asking you what to do with this file, click &quot;Run in Terminal&quot;. This will go get from the internet the current version of Unrevoked recovery installer from unrevoked.com/recovery, unzip/tar it, and run it as root.\n\nOnce it is complete you will be looking at the unrevoked3 screen and you should follow the prompts on screen.\n\nYou will then follow the prompts on the screen to plug in your phone, from the notification pane in android select charge only.\n\nunrevoked3 will reboot your phone twice and leave you in ClockworkMod Recovery. On the computer at the bottom of the window it will say &quot;Done&quot;.\nClose the window, if you do not need to do anything further you can shut down the machine and be back in windows with nothing changed on your windows system.\n\nCongratulations, your phone is now rooted and has ClockworkMod recovery installed.\n\nread more, see original thread at xda-developers: http://forum.xda-developers.com/showthread.php?t=741824","torrent":{"xt":"urn:btih:955bb4e637ccf77b8e0e9746639defcb88f3d765","amp;dn":"Ubuntu+Live+CD+to+ROOT+HTC+phones%2C+with+adb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"955bb4e637ccf77b8e0e9746639defcb88f3d765","infoHashBuffer":{"type":"Buffer","data":[149,91,180,230,55,204,247,123,142,14,151,70,99,157,239,203,136,243,215,101]},"announce":[],"urlList":[]}}