{"title":"Jack Williamson - Legion of Space Series [1-4]","uid":12589273,"size":757988671,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:95f502d53164a4d4547afcd6cc7dd5f8391bc541&amp;dn=Jack+Williamson+-+Legion+of+Space+Series+%5B1-4%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":18,"time":1445075272,"description":"The Legion of Space (Legion of Space #1)\r\n\r\nHer name was Aladoree Anthar, and her safety was critical to the Solar System. Because she was the only person alive who knew the secret of AKKA—the most awesome weapon humanity possessed.\r\n\r\nNot surprisingly, the job of protecting Aladoree was normally reserved for trusted Legion veterans. Yet John Star was assigned that duty right after graduating from the Academy, and he intended to prove himself worthy of the distinction.\r\n\r\nBut there were factors at work that John knew nothing about—a sinister plot to restore Imperial rule to the system ... and a disastrous &quot;alliance&quot; with a race of malevolent aliens. And before too long, John found himself up to his ears in trouble, with less than one chance in a billion of getting out.\r\n\r\n---\r\nThe Cometeers (Legion of Space #2)\r\n\r\nIn the second book in the Legion of Space series, Jay Kalam, Hal Samdu and Giles Habibula fight The Cometeers, an alien race of energy beings controlling a &quot;comet&quot; which is really a giant force field containing a swarm of planets populated by their slaves. The slave races are of flesh and blood, but none are remotely similar to humans.\r\n\r\nThe Cometeers cannot be destroyed by AKKA, as they are incorporeal from the Universe's point of view and exist for the most part in an alternate reality. The ruling Cometeers feed on their slaves and literally absorb their souls, leaving disgusting, dying hulks in their wake. It is said that they do so, as they were once fleshly entities themselves of various species. Hence, the ruling Cometeers keep other intelligent beings as slaves and &quot;cattle.&quot; They fear AKKA, though, as it can erase all their possessions.\r\n\r\n---\r\nOne Against The Legion (Legion of Space #3)\r\n\r\nSPACE VENGEANCE!\r\n\r\n&quot;I am omnipotent and omniscient. I want every man on every planet to shudder and grow pale when he thinks of Me. For I have suffered gross injuries that must be avenged...&quot;\r\n\r\nThis sinister message - and a loathsome serpent-like trademark - were the only clues the Legion of Space had to the identity of Mankind's most evasive and horrible enemy. But meanwhile, He or IT - had meticulously begun to destroy the world...\r\n\r\nThe Legion of Space was well accustomed to facing mortal peril in the black depths of outer space in order to defend humanity against its unearthly foes. But even they were to find their courage and ingenuity tested to the utmost limits in their fight against the vile phantom that called itself God and shrouded the Universe in an incredible web of terror...\r\n\r\n---\r\nThe Queen of the Legion (Legion of Space #4)\r\n\r\nDecades after the murderous assaults on the civilized worlds by the Medusae and the Cometeers—worlds protected by the Legion of Space—the Hawkshead Nebula is a new setting of conflict and intrigue.\r\n\r\nJil Gyrel is a lonely girl on a dismal planet at the edge of that nebula. Her life is changed forever when her father's long-missing spaceship reappears. The only survivor is her father's best friend Shon Macharn. Macharn's sudden marriage to Jil's mother sends Jil on a course of events that ends with all civilization at stake.\r\n\r\nFor AKKA—the cosmos' ultimate weapon—has been stolen by mysterious agents, and the horrors from within the Hawkshead Nebula have rendered the Legion of Space powerless. Jil encounters the wonders of the galaxy and leads a motley crew against the terrors of the Nebula in an effort to find her father and recover the secret of AKKA!\r\n\r\n\r\nRead by Sam A. Mowry\r\nFormat: MP3\r\nBitrate: 64 Kbps","torrent":{"xt":"urn:btih:95f502d53164a4d4547afcd6cc7dd5f8391bc541","amp;dn":"Jack+Williamson+-+Legion+of+Space+Series+%5B1-4%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95f502d53164a4d4547afcd6cc7dd5f8391bc541","infoHashBuffer":{"type":"Buffer","data":[149,245,2,213,49,100,164,212,84,122,252,214,204,125,213,248,57,27,197,65]},"announce":[],"urlList":[]}}