{"title":"Batman - Arkham Asylum","uid":5302742,"size":274004775,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:95f7850d387a4fa4d170ed876e7a4c2af8933b55&amp;dn=Batman+-+Arkham+Asylum&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"brodahisou","files":-1,"time":1264278694,"description":"Collection of stories and mini-series featuring Arkham Asylum, a psychiatric hospital in the DC Comics Universe, usually appearing in stories featuring Batman.\n\n\nBatman: Arkham Asylum (also known as Arkham Asylum: A Serious House on Serious Earth)\nCommissioner Gordon informs Batman that the patients of Arkham Asylum have taken over the building, and will murder the staff unless Batman agrees to meet with them.  Batman is forced into a game of hide and seek, and told he has one hour to make his way through the maze-like corridors and find a way out before his old foes are sent to find him.\nWritten by Grant Morrison and illustrated by Dave McKean. \n\n\nBatman: The Last Arkham\n&quot;The Last Arkham&quot; was a four-part Batman story arc that ran through Batman: Shadow of the Bat #1-4 in mid-1992.  The old Arkham Asylum is destroyed, to be replaced by a new and more modern facility.  The story introduces Jeremiah Arkham, the asylum's director, and nephew of Amadeus Arkham; and serial killer Victor Zsasz.  In an attempt to discover how criminals, specifically Zsasz, keep escaping, Batman has himself committed to the asylum. Jerimiah uses various methods, such as unleashing many inmates on Batman at once, in an attempt to see what makes him tick.\nWritten by Alan Grant and drawn by Norm Breyfogle.\n\n\nArkham Asylum: Living Hell\nThis six-issue miniseries provided an intricate and multi-layered look at Arkham Asylum from several points of view: the director (Dr. Jeremiah Arkham), a psychiatrist (Dr. Anne Carver), the guards (particularly one Aaron Cash), and the inmates.  Ruthless investor, Warren &quot;The Great White Shark&quot; White, facing charges of massive fraud, pleads insanity and has himself committed to Arkham.  He soon realizes the horrors of the place and tries to survive. \nWritten by Dan Slott, penciled by Ryan Sook with inks by Sook, Wade Von Grawbadger and Jim Royal.  Eric Powell created the painted cover art.\n\n\nArkham Reborn\nFollowing the Black Mask's destruction of Arkham Asylum in Battle For The Cowl, Dr. Jeremiah Arkham has rebuilt the Asylum following the design of his mad Uncle Amadeus.  Intended as a model for enlightened treatment of mental illness, the building soon mutates into a torture house, and the inmates find themselves trapped in a living hell.\nWritten by David Hine, with art by Jeremy Haun.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:95f7850d387a4fa4d170ed876e7a4c2af8933b55","amp;dn":"Batman+-+Arkham+Asylum","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95f7850d387a4fa4d170ed876e7a4c2af8933b55","infoHashBuffer":{"type":"Buffer","data":[149,247,133,13,56,122,79,164,209,112,237,135,110,122,76,42,248,147,59,85]},"announce":[],"urlList":[]}}