{"title":"Inherited Metabolic Epilepsies, 1E (2013)","uid":11628243,"size":65153746,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:96cba49dc4782237f5a04d6fd4488a95d020d59c&amp;dn=Inherited+Metabolic+Epilepsies%2C+1E+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cawihizilifa","files":1,"time":1417648824,"description":"The explosion of information in neurogenetics and metabolism mandates increasing awareness of appropriate diagnostic and therapeutic strategies in the setting of certain epilepsies, especially those of very early onset. There are over 200 inherited disorders that are associated with seizures and prompt identification and intervention is crucial for a positive outcome. This text brings together leading authorities presenting state-of-the-art clinical reviews covering the science, recognition, and treatment of the inherited metabolic epilepsies and related disorders.\nInherited Metabolic Epilepsies opens with a section on general principles for diagnosis and targeted intervention including screening protocols, laboratory testing, neuroimaging, seizure patterns and EEG findings, new technologies, and the ketogenic diet in metabolic epilepsies. The next two sections are devoted to the cohort of specific small molecule disorders (aminoacidopathies, organic acidopathies, mitochondrial disorders, urea cycle disorders, neurotransmitter disorders, and glucose-related disorders) and large molecule disorders (lysomal storage disorders, peroxisomal diseases, glycosylation defects, and leukodystrophies) that are treatable yet can be so vexing to clinicians and investigators. The book concludes with a clinical algorithm designed to be a resource for the physician in search of direction when considering an inherited metabolic disorder as the explanation for a patient with epilepsy.\n\nInherited Metabolic Epilepsies Key Features:\n\n- Presents the latest scientific thinking and clinical wisdom for a poorly understood group of disorders that have devastating consequences if unrecognized or not promptly treated\n- Expert authorship from both the genetic-metabolic and epilepsy communities provides state-of-the-art guidance for understanding and managing these disorders\n- A readable text for clinicians highlighting the relation between metabolic errors and epilepsy\n- Concludes with a practical algorithm for evaluating a patient with a possible metabolic epilepsy","torrent":{"xt":"urn:btih:96cba49dc4782237f5a04d6fd4488a95d020d59c","amp;dn":"Inherited+Metabolic+Epilepsies%2C+1E+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96cba49dc4782237f5a04d6fd4488a95d020d59c","infoHashBuffer":{"type":"Buffer","data":[150,203,164,157,196,120,34,55,245,160,77,111,212,72,138,149,208,32,213,156]},"announce":[],"urlList":[]}}