{"title":"Hittite Warrior","uid":11735258,"size":24354413,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9704369a8baf71d699a4329908be326f3411934a&amp;dn=Hittite+Warrior&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425544820,"description":"Written by Trevor Bryce, one of the world's leading experts on the Hittites, this book charts the rise and fall of a warrior people famed for their ferocity, who built an empire which stretched from Mesopotamia to Syria and Palestine. Regarded as barbarians by the Egyptians, for a hundred years the Hittites fought a draining war against the Egyptians - the climax of which saw the Hittites defeated and their 400-year-old empire destroyed at the Battle of Qadesh (1274 BC).\n\nThought to have invented iron, used to forge their weapons, and known for pioneering a revolutionary three-man chariot system, Bryce details the day-to-day lives of Hittite warriors. He examines their training, equipment, tactics, and motivations, as well as their unique attitude to religion which saw them adopt the gods of the people they conquered. The inclusion of a Hittite manual which describes, in detail, the training of horses and the warriors that rode them in battle, as well as original full color illustrations make this book a fascinating and enlightening addition to an often ignored subject","torrent":{"xt":"urn:btih:9704369a8baf71d699a4329908be326f3411934a","amp;dn":"Hittite+Warrior","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9704369a8baf71d699a4329908be326f3411934a","infoHashBuffer":{"type":"Buffer","data":[151,4,54,154,139,175,113,214,153,164,50,153,8,190,50,111,52,17,147,74]},"announce":[],"urlList":[]}}