{"title":"Spine Chillers by M R James (BBC Audio - Derek Jacobi)","uid":4549336,"size":99709649,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:97166e4db7e677af6de40aad38b6a4c1f324bf81&amp;dn=Spine+Chillers+by+M+R+James+%28BBC+Audio+-+Derek+Jacobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dougietrotter","files":-1,"time":1228245743,"description":"Five atmospheric dramatizations of classic ghost stories, introduced by Derek Jacobi as the voice of M. R. James. \n\nWidely acknowledged as the master of the supernatural, M. R. James penned many of his classic ghost stories to be read aloud to friends, by candlelight, in his study on Christmas Eve. \n\nThese five adaptations, originally broadcast on BBC Radio 4, perfectly capture the mood of nerve-jangling suspense that would surely have been present during those readings.\n\nIn &quot;Oh, Whistle, and I'll Come to You, My Lad&quot;, Professor Parkins embarks on a terrifying journey of discovery after he removes a curious artifact from the ruins of a Templar preceptory, while &quot;The Tractate Middoth&quot; sees diligent curator David Garrett caught up in the machinations of the mysterious Dr Rant when he's sent to retrieve an obscure manuscript from the library stacks. &quot;Lost Hearts&quot; tells of a young boy haunted by two ghostly children and in &quot;The Rose Garden&quot;, terrifying forces are unleashed when the Goodmans tear down their old summer house. Finally, &quot;Number 13&quot; takes us to the Danish town of Viborg, where Dr. Anderson puts himself in terrible danger as he investigates why the hotel he's staying at does not contain a room 13. \n\nStarring BAFTA and Emmy-award winning actor Derek Jacobi (&quot;Cadfael&quot;, &quot;Gosford Park&quot;, &quot;I Claudius&quot; and &quot;Doctor Who&quot;), and with powerfully chilling music and sound effects, these rich, riveting dramatizations make for irresistible listening.","torrent":{"xt":"urn:btih:97166e4db7e677af6de40aad38b6a4c1f324bf81","amp;dn":"Spine+Chillers+by+M+R+James+%28BBC+Audio+-+Derek+Jacobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97166e4db7e677af6de40aad38b6a4c1f324bf81","infoHashBuffer":{"type":"Buffer","data":[151,22,110,77,183,230,119,175,109,228,10,173,56,182,164,193,243,36,191,129]},"announce":[],"urlList":[]}}