{"title":"Music from the Golden Age of Piracy","uid":3591386,"size":807518634,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:97c50ec0602e9d9bed08acd79bd7a836288867f2&amp;dn=Music+from+the+Golden+Age+of+Piracy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Rivenshield","files":146,"time":1168154194,"description":"Here&amp;#039;s a collection of music spanning the period between the English Civil War and the French &amp; Indian War -- roughly the hundred years between 1650 and 1750. Pirates and townsfolk alike would have heard all of these at one time or another in the pubs, at dances, and at various affairs of state. All are fine reproductions played on period instruments. Sound quality is 320 kbs or better. Enjoy!\n\nColonial America/Early American Roots -- music from the very early colonial American period by Hesperus. This is the music of my ancestors. You can tell they had a lot of fun with it.\n\nItalian Dance Music -- my favorite of the lot. This is the stuff that Baroque music grew out of. A lot of it sounds almost modern -- really swings! You&amp;#039;ve got to hear it to believe it!\n\nLa Music du Grand Siecle -- court music written for old Louie the Fourteenth, the Sun King. Church hymns, marching tunes, dance music -- it&amp;#039;s all there.\n\nLa Roque N Roll -- folk music from the late French renaissance. The Anglo-French boucaniers of the Caribbean doubtless danced many a jig to these tunes.\n\nPenny Merriments -- a shot of dirty filthy wicked fun straight from the taverns of London, some 350 years ago. Sex drugs and rock &amp; roll has been around for a long time, folks...","torrent":{"xt":"urn:btih:97c50ec0602e9d9bed08acd79bd7a836288867f2","amp;dn":"Music+from+the+Golden+Age+of+Piracy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97c50ec0602e9d9bed08acd79bd7a836288867f2","infoHashBuffer":{"type":"Buffer","data":[151,197,14,192,96,46,157,155,237,8,172,215,155,215,168,54,40,136,103,242]},"announce":[],"urlList":[]}}