{"title":"Faith Evans - Gone Already (2nafish)","uid":5908948,"size":94537732,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:986f52f1bc657632d19ededa63d3f6ecea96c3c0&amp;dn=Faith+Evans+-+Gone+Already+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1287988151,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logo.\n\n\n&quot;Gone Already&quot; is the first single from Faith Evans' 2010 album Something About Faith. The song has so far peaked at #32 on the U.S. Hot R&amp;B/Hip-Hop Singles Chart. It is her first charting single since 2005's Tru Love.\n\nEvans performed the song live on The Wendy Williams Show on October 8, 2010.\n\nSomething About Faith is the sixth studio album by American singer Faith Evans, to be released on Prolific Music Group on October 5, 2010 in the United States. Distributed by E1 Music, the album marks Evans' first independent release, following her departure from Bad Boy Records in 2003 and her subsequent but short-lived engagement with Capitol Records in 2005.\n\nThe project is said to involve production by Chucky Thompson, Mike City, and Salaam Remi, among others and Evans collaborated with singer Keyshia Cole, and rappers Redman and Snoop Dogg for the album. The album's first single, &quot;Gone Already,&quot; was released in August 2010 and has so far managed to rise to number 35 on the U.S. Billboard Hot R&amp;B/Hip-Hop Songs with only an Urban AC add thus far.\n\nSomething About Faith debuted (in the U.S.) at #15 on the Billboard 200, #4 on the Billboard R&amp;B/Hip-Hop Albums chart and #1 on the Billboard Independent Albums chart - selling 24,000 copies in its first week of release.\n\nIn its second week, Something About Faith placed at #63 on the Billboard 200, #13 on the Billboard R&amp;B/Hip-Hop Album chart, and #10 on the Billboard Independent Albums chart, selling 7,500 copies. Bringing the total sales of the album (thus far) to 31,500.\n\nFaith RenÃƒÂ©e Evans (born June 10, 1973) is an American singer-songwriter, record producer, actress and author. Born in Lakeland, Florida, and raised in Newark, New Jersey, Evans moved to Los Angeles in 1993 for a career in the music business. After working as a backing vocalist for Al B. Sure, and Christopher Williams, she became the first female artist to be signed to Sean &quot;Puff Daddy&quot; Combs' Bad Boy Entertainment label in 1994, on which she released three platinum-certified studio albums between the years of 1995 and 2001. In 2003, she left the label to sign with Capitol Records.She released one studio album and a christmas compilation on the label before leaving and signing with E1 Entertainment in 2009.\n\nNext to her recording career, Evans is widely known as the widow of New York rapper Christopher &quot;The Notorious B.I.G.&quot; Wallace, whom she married on August 4, 1994, three weeks after meeting at a Bad Boy photoshoot. The turbulent marriage led to Evans' involvement in the East Coast-West Coast hip hop feud, dominating the rap scene at the time, and ended with Wallace's murder in a yet-unsolved drive-by shooting in Los Angeles, California in March 1997. A 1997 tribute single featuring Puff Daddy and 112, entitled &quot;I'll Be Missing You&quot;, became Evans' biggest-selling hit to date and won her a Grammy Award in 1998.\n\nAlso an avocational actress and writer, Evans made her big screen debut in the 2000 musical drama Turn It Up by Robert Adetuyi. Her self-written autobiography Keep the Faith: A Memoir was released by Grand Central Publishing in 2008 and won a 2009 African American Literary Award for the Best Biography/Memoir category.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:986f52f1bc657632d19ededa63d3f6ecea96c3c0","amp;dn":"Faith+Evans+-+Gone+Already+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"986f52f1bc657632d19ededa63d3f6ecea96c3c0","infoHashBuffer":{"type":"Buffer","data":[152,111,82,241,188,101,118,50,209,158,222,218,99,211,246,236,234,150,195,192]},"announce":[],"urlList":[]}}