{"title":"The Encyclopedia of Recreational Drugs","uid":4965081,"size":54087650,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:987400c11848b22a754308fb86d36d2cd70d53b4&amp;dn=The+Encyclopedia+of+Recreational+Drugs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":-1,"time":1245496291,"description":"(Taken from back cover)\n\n&quot;Did you know that Pope Leo XIII, was supported in his ascetic retirement with frequent dosages of Vin Mariani, the celebrated wine of coca? And that other noted enthusiasts included Thomas Edison, Emile Zola and Jules Verne? However brilliant and celebrated were these individuals (and others like them), they had to conduct their interior exploration without tguides and, usually, with scant reliable information. Now, for the first time, the modern explorer (or interested observer) has a book to turn to! The High Times Encyclopedia is the first comprehensive, authoritative and unbiased sourcebook and guide to the so-called &quot;recreational drugs&quot; including cannabis and its derivatives, psychedelics, cocaine, pharmaceuticals, herbs, alcohol, tobacoo and a lot more! More than three years in preparation by the editors of High Times magazine working with leading doctors, scientists, scholars and writers, the Encyclopedia is essential, fascinating, factual . . . . a clear step in the direction of greater understanding for millions upon millions of people.&quot;\n\n460 pages, plenty of illustrations.\n\nDTOM's note:  My opinion on the usage of drugs (along with anyone else's for that matter) is irrelevant.  I think people have a right to put whatever they want into their body (assuming they are not damaging someone's property or harming someone) as long as they are fully aware of it's effects.  Education is key here.\n\nFor more information regarding drugs, check out erowid.org.\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:987400c11848b22a754308fb86d36d2cd70d53b4","amp;dn":"The+Encyclopedia+of+Recreational+Drugs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"987400c11848b22a754308fb86d36d2cd70d53b4","infoHashBuffer":{"type":"Buffer","data":[152,116,0,193,24,72,178,42,117,67,8,251,134,211,109,44,215,13,83,180]},"announce":[],"urlList":[]}}