{"title":"Jean-Marie Pelt - 19 livres (Ecologie.Nature.Medecine)","uid":14633435,"size":8468092,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98c162be06b78540218fd84605a1480b586cca3a&amp;dn=Jean-Marie+Pelt+-+19+livres+%28Ecologie.Nature.Medecine%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"asperge","files":19,"time":1463395985,"description":"Jean-Marie Pelt, pharmacien agrégé, est un botaniste-écologiste français et le fondateur de l'Institut européen d’écologie (Metz).\r\n\r\nIl effectue de nombreuses missions scientifiques à l’étranger. Durant l’été 1967 il voyage pour l’Office de la recherche scientifique et technique outre-mer (ORSTOM) à Lomé au Togo où il participe à une étude des pharmacopées traditionnelles. Il est envoyé également en Afghanistan en 1964 et 1967 par le Ministère des Affaires Etrangères et le CNRS et consacre de nombreuses publications scientifiques à l'écologie végétale et aux pharmacopées traditionnelles de ce pays.\r\n\r\nIl obtient en 1978 le Grand Prix des lectrices de Elle.\r\n\r\nL'Académie française lui remet en 1982 le Prix Nicolas Missarel pour son livre La médecine par les plantes et en 1984 la médaille d’argent du prix Antoine Girard pour Drogues et plantes magiques.\r\n\r\nEn 2006, l’Académie des sciences morales et politiques lui remet le prix Édouard Bonnefous pour son œuvre consacrée à la défense de l'environnement.\r\n\r\nJean-Marie Pelt a été nommé Chevalier dans l'Ordre national de la Légion d'honneur le 24 mai 1995 et Officier le 13 juillet 2005.\r\n\r\nJean-Marie Pelt a été nommé officier dans l'Ordre national du Mérite le 11 décembre 1989 et commandeur le 15 novembre 1997.\r\n\r\nÀ l'occasion de ses 80 ans, un colloque sur le thème de l'amitié et de la solidarité est organisé le 24 octobre 2013 à Metz","torrent":{"xt":"urn:btih:98c162be06b78540218fd84605a1480b586cca3a","amp;dn":"Jean-Marie+Pelt+-+19+livres+%28Ecologie.Nature.Medecine%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98c162be06b78540218fd84605a1480b586cca3a","infoHashBuffer":{"type":"Buffer","data":[152,193,98,190,6,183,133,64,33,143,216,70,5,161,72,11,88,108,202,58]},"announce":[],"urlList":[]}}