{"title":"I Misteri di Marte, [XviD - Ita - Mp3]","uid":5165531,"size":347265276,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:993f4e5590099c8c9e0718fdb9ca2b922201a4e9&amp;dn=I+Misteri+di+Marte%2C+%5BXviD+-+Ita+-+Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Duracell72","files":1,"time":1258385918,"description":"Marte ÃƒÂ¨ il quarto pianeta del sistema solare in ordine di distanza dal Sole e l'ultimo dei pianeti di tipo terrestre, dopo \n\nMercurio, Venere e la Terra. Viene inoltre chiamato il Pianeta rosso, a causa del suo colore caratteristico dovuto alle \n\ngrandi quantitÃƒÂ  di ossido di ferro che lo ricoprono.\nIl pianeta, pur presentando un'atmosfera molto rarefatta e temperature medie superficiali piuttosto basse (tra -140 Ã‚Â°C e 20 \n\nÃ‚Â°C), ÃƒÂ¨, tra i pianeti del sistema solare, quello piÃƒÂ¹ simile alla Terra: infatti, nonostante le sue dimensioni siano intermedie fra \n\nquelle del nostro pianeta e della Luna (il diametro ÃƒÂ¨ circa la metÃƒÂ  di quello della Terra e la massa poco piÃƒÂ¹ di un decimo), \n\npresenta inclinazione dell'asse di rotazione e durata del giorno simili a quelle terrestri; inoltre la sua superficie presenta \n\nformazioni vulcaniche, valli, calotte polari e deserti sabbiosi, oltre a formazioni geologiche che suggeriscono la presenza, \n\nin un lontano passato, di un'idrosfera. Tuttavia la superficie del pianeta appare fortemente craterizzata, a causa della quasi \n\ntotale assenza di agenti erosivi (attivitÃƒÂ  geologica, atmosferica e idrosferica in primis) in grado di modellare le strutture \n\ntettoniche; inoltre, la bassissima densitÃƒÂ  dell'atmosfera non ÃƒÂ¨ in grado di consumare buona parte dei meteoriti, che quindi \n\nraggiungono il suolo con maggior frequenza che non sulla Terra.\nFra le formazioni geologiche piÃƒÂ¹ notevoli di Marte si segnalano l'Olympus Mons, il vulcano piÃƒÂ¹ grande del sistema solare \n\n(alto 27 km), e la Valles Marineris, un lungo canyon piÃƒÂ¹ esteso di quelli terrestri; nel giugno 2008 la rivista Nature ha \n\nesposto le prove di un enorme cratere sull'emisfero boreale circa quattro volte piÃƒÂ¹ grande del cratere chiamato il Bacino \n\nPolo Sud-Aitken.\nMarte all'osservazione presenta delle variazioni di colore, imputate inizialmente alla presenza di vegetazione stagionale, \n\nche al variare dei periodi dell'anno cambiava di colore. Tuttavia le osservazioni spettroscopiche dell'atmosfera avevano \n\nda tempo fatto abbandonare l'ipotesi che vi potessero essere mari, canali e fiumi oppure un'atmosfera sufficientemente \n\ndensa. Il colpo di grazia a questa ipotesi fu dato dalla missione Mariner 4 nel 1965, che mostrÃƒÂ² un pianeta desertico e \n\narido, caratterizzato da periodiche ma particolarmente violente tempeste di sabbia. La speranza che Marte possa \n\naccogliere la vita ÃƒÂ¨ tuttavia stata ripresa in considerazione da quando il modulo Phoenix ha scoperto acqua sotto forma di \n\nghiaccio, il 31 luglio 2008. Attualmente sono tre i satelliti artificiali funzionanti che orbitano attorno a Marte: il Mars \n\nOdyssey, il Mars Express e il Mars Reconnaissance Orbiter. Il Phoenix Mars Lander ha recentemente concluso la sua \n\nmissione di studio della geologia marziana e ha fornito le prove dell'esistenza di acqua allo stato liquido in passato su \n\nampie zone della superficie. Inoltre ha suggerito che sulla superficie possano essersi verificati nell'ultimo decennio dei \n\nflussi d'acqua simili a geyser.\nOsservazioni da parte del Mars Global Surveyor manifestano una contrazione della calotta di ghiaccio al polo sud.\nAttorno a Marte orbitano due satelliti naturali, Phobos e Deimos, di piccole dimensioni e dalla forma irregolare, \n\nprobabilmente due asteroidi catturati dal suo campo gravitazionale. Marte ha anche alcuni asteroidi troiani, tra cui 5261 \n\nEureka.\nMarte prende il nome dall'omonima divinitÃƒÂ  della mitologia romana; il simbolo astronomico del pianeta ÃƒÂ¨ la \n\nrappresentazione stilizzata dello scudo e della lancia del dio.\n\nFile Information   \n                                                   \nFile Nam: I MISTERI DI MARTE.avi                     \nFile Size [in bytes]: 347,265,276                     \n                                                                                \nContainer Information    \n                                              \nBase Type: AVI[.AVI]               \nSubtype: AVI v1.0                \nInterleave [in ms]: 85          \nAudio alignment: Split         \nNumber of Audio Streams: 1       \n                                                                                \nVideo Information \n                                                      \nVideo Codec Type: XVID              \nVideo Codec Name: XviD ISO MPEG-4              \nVideo Codec Status: Codecs are Installed            \nDuration [hh:mm:ss]: 43:51.000                \nFrame Count: 65775             \nFrame Width [pixels]: 720                  \nFrame Height [pixels]: 400                  \nStorage Aspect Ratio: 1.800                     \nPixel Aspect Ratio: 1.000                     \nDisplay Aspect Ratio: 1.800                     \nFrames Per Second: 25.000          \nPics Per Second: 25.000            \nVideo Bitrate [kbps]: 946                 \nQuality Factor [bits/pixel/frame]: 0.131                  \n                                                                         \nAudio Information                                                    \nAudio Codec: 0x0055 MPEG-1 Layer 3                   \nAudio Codec Status: Codecs are Installed            \nAudio Sample Rate [Hz]: 48000             \nAudio Bitrate [kbps]: 96                 \nAudio Bitrate Type: CBR            \nAudio Channel Count: 2     ","torrent":{"xt":"urn:btih:993f4e5590099c8c9e0718fdb9ca2b922201a4e9","amp;dn":"I+Misteri+di+Marte%2C+%5BXviD+-+Ita+-+Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"993f4e5590099c8c9e0718fdb9ca2b922201a4e9","infoHashBuffer":{"type":"Buffer","data":[153,63,78,85,144,9,156,140,158,7,24,253,185,202,43,146,34,1,164,233]},"announce":[],"urlList":[]}}