{"title":"Run and Jump 2013 DVDRip Sonata Premiere","uid":9843677,"size":735578934,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9aecbe375ec57f83e9228505f06d6f93122072e6&amp;dn=Run+and+Jump+2013+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"klinho","files":2,"time":1396035704,"description":"A headstrong Irish housewife finds her life transforming in ways she never thought possible after her husband suffers a life-altering stroke, and an American doctor arrives to chronicle the family's recovery process in this intimate drama from director Steph Green (whose short film New Boy was nominated for an Oscar in 2007). In the wake of her husband's stroke, loving wife and mother Vanetia (Maxine Peake) gradually comes to realize that her household will never be the same again. Much to Vanetia's relief, a research grant from American doctor Ted Fielding (Will Forte) provides the funds needed to remain financially afloat. Ted wants to study how the family copes with such a severe trauma, and though at first his presence in the home strikes a chord of resentment in the overburdened Vanetia, he exhibits an air of tranquility that soon becomes a source of deep comfort to her. Likewise, Vanetia's unwavering strong will awakens a newfound sense of vitality in the reserved Dr. Fielding, resulting in growth and healing for all involved. ","torrent":{"xt":"urn:btih:9aecbe375ec57f83e9228505f06d6f93122072e6","amp;dn":"Run+and+Jump+2013+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9aecbe375ec57f83e9228505f06d6f93122072e6","infoHashBuffer":{"type":"Buffer","data":[154,236,190,55,94,197,127,131,233,34,133,5,240,109,111,147,18,32,114,230]},"announce":[],"urlList":[]}}