{"title":"Richard Dawkins - E-Books Collection 2010","uid":5693142,"size":126650888,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9b20d4cfe960bc4744bf006c30f57c2acdbf1583&amp;dn=Richard+Dawkins+-+E-Books+Collection+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rockstar3","files":10,"time":1279159546,"description":"Clinton Richard Dawkins is a British ethologist, evolutionary biologist and popular science author. He was formerly Professor for Public Understanding of Science at Oxford and was a fellow of New College, Oxford.[1][2][3][4]\n\nDawkins came to prominence with his 1976 book The Selfish Gene, which popularised the gene-centred view of evolution and introduced the term meme. In 1982, he introduced into evolutionary biology an influential[5] concept, presented in his book The Extended Phenotype, that the phenotypic effects of a gene are not necessarily limited to an organism's body, but can stretch far into the environment, including the bodies of other organisms.\n\nDawkins is well known for his candid criticism of creationism and intelligent design. In his 1986 book The Blind Watchmaker, he argued against the watchmaker analogy, an argument for the existence of a supernatural creator based upon the complexity of living organisms. Instead, he described evolutionary processes as analogous to a blind watchmaker. He has since written several popular science books, and makes regular television and radio appearances, predominantly discussing these topics.\n\n[Source: Wikipedia]\n\n\n\n\n\nE-Books in this collection:\n\n\n# The Selfish Gene. Oxford: Oxford University Press. 1976. ISBN 0-19-286092-5.\n\n# The Extended Phenotype. Oxford: Oxford University Press. 1982. ISBN 0-19-288051-9. \n\n# The Blind Watchmaker. New York: W. W. Norton &amp; Company. 1986. ISBN 0-393-31570-3. \n\n# River Out of Eden. New York: Basic Books. 1995. ISBN 0-465-06990-8. \n\n# Climbing Mount Improbable. New York: W. W. Norton &amp; Company. 1996. ISBN 0-393-31682-3. \n\n# Unweaving the Rainbow. Boston: Houghton Mifflin. 1998. ISBN 0-618-05673-4. \n\n# A Devil's Chaplain. Boston: Houghton Mifflin. 2003. ISBN 0-618-33540-4. \n\n# The Ancestor's Tale. Boston: Houghton Mifflin. 2004. ISBN 0-618-00583-8.\n \n# The God Delusion. Boston: Houghton Mifflin. 2006. ISBN 0-618-68000-4. \n\n# The Greatest Show on Earth: The Evidence for Evolution. Free Press (United States), Transworld (United Kingdom and Commonwealth). 2009. ISBN 0-593-06173-X.","torrent":{"xt":"urn:btih:9b20d4cfe960bc4744bf006c30f57c2acdbf1583","amp;dn":"Richard+Dawkins+-+E-Books+Collection+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b20d4cfe960bc4744bf006c30f57c2acdbf1583","infoHashBuffer":{"type":"Buffer","data":[155,32,212,207,233,96,188,71,68,191,0,108,48,245,124,42,205,191,21,131]},"announce":[],"urlList":[]}}