{"title":"Lucy Wainwright Roche - There's a Last Time for Everything[2013]","uid":9440215,"size":228198979,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9e04cc67d9d8e21ad32d62ecbc3bd5b5c538d6d6&amp;dn=Lucy+Wainwright+Roche+-+There%27s+a+Last+Time+for+Everything%5B2013%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":13,"time":1388998085,"description":"Artist: Lucy Wainwright Roche\nRelease: There's a Last Time for Everything\nReleased: 2013\nLabel: One Ear Up MusicLimited\nCatalog#: \nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: pop/FOLK\n\nimage\n\n\n\n1 The Year Will End Again\n2 Seek and Hide (feat. Colin Meloy)\n3 Last Time\n4 Monte Rosa Range\n5 Look Busy\n6 Canturbury Song\n7 Call Your Girlfriend\n8 A Quiet Line (feat. Mary Chapin Carpenter)\n9 The Same\n10 Take What You're Given\n11 Under the Gun\n\n\n\n\nThere's a Last Time for Everything is Lucy Wainwright Roche's follow-up to 2010's Lucy. Recorded in Nashville with co-producer, multi-instrumentalist, and songwriter Jordan Brooke Hamlin, ten of these 11 tracks are originals. As a set, the vibe here is dreamy, intimate, the songs often confessional. But it's not shrouded in mope. &quot;Seek and Hide&quot;'s lyric is a sad look at lost love, but drifting organs, a glockenspiel, rolling reverbed snare, sparse strings, and a tight little vocal hook -- with great backing from the Decemberists' Colin Meloy -- transform that heartbreak into elegant pop. Conversely, the skeletal cover of Robyn's dance hit &quot;Call Your Girlfriend&quot; poetically exhorts a lover to make the break with his paramour in her favor. Accompanied only by an acoustic guitar and a chorus of backing vocalists until some snail-paced percussion echoes in the backdrop, its arrangement is the polar opposite of the original, but feels right at home in this singer's parlance. And in that way, it could be heard as the song's protagonist singing to herself in a mirror. Mary Chapin Carpenter duets on the heartworn waltz &quot;A Quiet Line,&quot; adorned by plucked cello, guitars, and a brushed snare. Set closer &quot;Under the Gun&quot; feels like it's being sung from inside the frame of a sepia-tinted photograph, complete with a lonely clarinet creeping in from the edges to underscore its nostalgic sadness. Through its quiet, tender song settings, There's a Last Time for Everything reveals that Wainwright Roche's confidence as a writer, arranger, and producer has grown far beyond what her debut suggested....","torrent":{"xt":"urn:btih:9e04cc67d9d8e21ad32d62ecbc3bd5b5c538d6d6","amp;dn":"Lucy+Wainwright+Roche+-+There%27s+a+Last+Time+for+Everything%5B2013%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e04cc67d9d8e21ad32d62ecbc3bd5b5c538d6d6","infoHashBuffer":{"type":"Buffer","data":[158,4,204,103,217,216,226,26,211,45,98,236,188,59,213,181,197,56,214,214]},"announce":[],"urlList":[]}}