{"title":"Stephen Graham Jones-Zombie Bake Off","uid":10771411,"size":148389778,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9e339c22f88cdbec39540c7d0a1167ac69b59e5a&amp;dn=Stephen+Graham+Jones-Zombie+Bake+Off&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twocows","files":44,"time":1408081083,"description":"It's time for the annual Recipe Days bake-off in Lubbock, Texas. Soccer moms and grandmothers gather to show off their family recipes, learn new secrets for the perfect shortcake, and perhaps earn a chance to be on the famous cooking show, How Would You Cook It, Then? When the bake-off is crashed by a federation of pro wrestlers -- including American Badass, Jersey Devil Jill, Tiny Giant, The Village Person, Jonah the Whale, the Hellbillies, and the fan favorite Xombie -- all hell is set to break loose. Your heart beats faster as you anticipate who will come out on top in the ultimate showdown of the century: soccer moms or pro wrestlers. Anything can happen. An infected batch of donuts has transformed most of the wrestlers into mindless brain-eaters and the doors of the convention center have been chained shut, leaving the survivors locked inside, forced to fend for themselves against the hungry dead. Possessing the intensity of a shotgun to the face, Zombie Bake-Off is a stripped-down masterpiece of blood and doughnuts from celebrated author Stephen Graham Jones. ","torrent":{"xt":"urn:btih:9e339c22f88cdbec39540c7d0a1167ac69b59e5a","amp;dn":"Stephen+Graham+Jones-Zombie+Bake+Off","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e339c22f88cdbec39540c7d0a1167ac69b59e5a","infoHashBuffer":{"type":"Buffer","data":[158,51,156,34,248,140,219,236,57,84,12,125,10,17,103,172,105,181,158,90]},"announce":[],"urlList":[]}}