{"title":"Democracy Now - 09 jan 2012","uid":6943444,"size":457559865,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9e59729be1a5f91d1b08cc191b0862bff80ba4d9&amp;dn=Democracy+Now+-+09+jan+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1326126130,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 09, 2012\n\n- Republicans Debate Ahead of New Hampshire Primary\n- Gingrich Accuses Romney of Looting Companies\n- Billionaire Casino Mogul Gives $5 Million to Pro-Gingrich SuperPac\n- Panetta Admits Iran is Not Trying to Develop a Nuclear Weapon\n- U.S. and Iran to Hold Major Military Exercises in the Persian Gulf\n- 100,000 Displaced by By Ethnic Violence in South Sudan\n- Nigeria General Strike Begins Over Rising Fuel Costs\n- Texas Teen Returns Home After Being Mistakenly Deported to Colombia\n- Occupy Our Homes Action in New York City Enters Second Month\n- African National Congress Celebrates 100th Anniversary\n\n\nSpecial reports\n\n- Drones, Asia and Cyber War: Pentagon Shifts Priorities in New Review; Budget Still Exceeds Bush Era\n\nDuring the Republican presidential debates this weekend, candidates took aim at the military strategy President Obama unveiled late last week, which vows cuts in military spending and a stepped-up focus on the Asia-Pacific region, as well as increased use of drone strikes that have targeted militants in Pakistan, Afghanistan, Yemen and throughout Horn of Africa. We speak with William Hartung, director of the Arms and Security Project at the Center for International Policy, about Obama's new strategy, which leaves spending at levels equal to the Bush administration, and examine alternatives presented by the GOP front-runner in New Hampshire, Mitt Romney. &quot;His plan would be sort of laughable if it wasn't so obscene,&quot; Hartung says. &quot;He's talking about, let's keep the military budget at 4 percent of GDP, as if it was some sort of entitlement program for the Pentagon ... He would spend something like $6.5 trillion over 10 years, which would be about a trillion and a half more than the Obama plan. ... If he's not gonna raise taxes, it's going to come straight out of domestic programs which are already being hit quite substantially.&quot;\n\n\n- Death of Private Danny Chen: Military Admits Chen Was Target of Race-Based Hazing on Daily Basis\n\nU.S. Army investigators have released explosive new details about the death of Private Danny Chen, who allegedly took his own life just weeks after he was deployed to Afghanistan last October. The family of the 19-year-old Chinese-American soldier says the Army told them Chen had been abused by comrades on an almost daily basis, including racist hazing, with soldiers throwing rocks at him, calling him ethnic slurs and forcing him to do push-ups or hang upside down with his mouth full of water. &quot;This is not a situation where you can expect Danny to make complaints to higher-ups when they're the ones that are causing this hazing,&quot; says Liz OuYang of the civil rights group OCA-New York. &quot;It was incumbent upon the officer, the highest leader in this platoon, to take action. ... Had he reported it to higher-ups, there's a great possibility that Danny may still be alive today.&quot; Chen's family and supporters have called for eight soldiers charged in his death to be tried in the United States, instead of overseas.\n\n\n- As Arizona Remembers Tucson Shooting, Virginia Tech Massacre Survivor Calls For New Gun Control\n\nThousands of people gathered Sunday in Tucson, Arizona, for a candlelight vigil remembering the six people killed in last year's deadly shooting that left Congresswoman Gabrielle Giffords gravely wounded. Giffords, still recovering from her injuries, addressed the crowd. Meanwhile, Jared Loughner, who was arrested and charged with attempting to assassinate Giffords, has pleaded not guilty and been found unfit to stand trial because of mental illness. Despite repeated calls for greater gun control in the year since the shooting, little has been done and the National Instant Criminal Background Check System for gun purchases has not been fully implemented. &quot;I think a lot of Americans already think that we do background checks on everybody and are surprised to learn that we don't ... at the minimum we should be doing a background check,&quot; says Colin Goddard, who has worked tirelessly for gun control since he survived the 2007 shooting on the Virginia Tech campus that left 32 people dead.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:9e59729be1a5f91d1b08cc191b0862bff80ba4d9","amp;dn":"Democracy+Now+-+09+jan+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e59729be1a5f91d1b08cc191b0862bff80ba4d9","infoHashBuffer":{"type":"Buffer","data":[158,89,114,155,225,165,249,29,27,8,204,25,27,8,98,191,248,11,164,217]},"announce":[],"urlList":[]}}