{"title":"Fervid Filmmaking:66 Cult Pictures of Vision, Verve and No Self-","uid":9118678,"size":4589322,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9e90a91d00ad2fd5260ea747877f31160065dda5&amp;dn=Fervid+Filmmaking%3A66+Cult+Pictures+of+Vision%2C+Verve+and+No+Self-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1383081580,"description":"For fervid or feverish film professionals and buffs, there is a term--&quot;Kitchen Sink movies&quot;--referring to films that take severe-angle turns at unexpected moments, where a filmmaker will borrow from across the artistic spectrum to create a wild, disorienting ride. They are what this book is about.\nThrowing marketing reports and box-office projections to the wind, the writer-director-producers conjure a whirl of ideas, of images, of themes or plots, that inexplicably come together despite conventional reason. Almost always cult films, these movies rarely succeed in their first run. Indeed, some of the very best remain unknown to mainstream audiences.\nThis volume provides in-depth examinations of 66 of these cultural oddities, from such disparate films as La Morte en direct, The Final Programme, and Head to lesser known independents like The Prodigy, Land of College Prophets, and Scrapbook. Putting these unusual films into a cultural context promotes an under appreciated but fascinating facet of movie-making.\n\nAbout the Author\n\nMike Watt has written for Fangoria, Film Threat, The Dark Side, the late Frederick Clarke's Cinefantastique, and Femme Fatales. Through the production company, Happy Cloud Pictures, he has written and produced or directed the award-winning feature film The Resurrection Game, as well as Splatter Movie: The Director's Cut, A Feast of Flesh, Demon Divas and the Lanes of Damnation and the upcoming feature Razor Days.","torrent":{"xt":"urn:btih:9e90a91d00ad2fd5260ea747877f31160065dda5","amp;dn":"Fervid+Filmmaking%3A66+Cult+Pictures+of+Vision%2C+Verve+and+No+Self-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e90a91d00ad2fd5260ea747877f31160065dda5","infoHashBuffer":{"type":"Buffer","data":[158,144,169,29,0,173,47,213,38,14,167,71,135,127,49,22,0,101,221,165]},"announce":[],"urlList":[]}}