{"title":"Boy's Life By Robert R McCammon (EPUB,MOBI,PDF,AZW)","uid":10570708,"size":4361023,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9eace0d5c8dca95a3efa1ad81fbdf60907906cb9&amp;dn=Boy%27s+Life+By+Robert+R+McCammon+%28EPUB%2CMOBI%2CPDF%2CAZW%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"gratefuldawg77","files":4,"time":1405570903,"description":"\nAnother one I couldn't find. :) Was my favorite book as a teen, so i feel it needs to be shared. Could only find it in azw, so I converted it to the other formats myself, added the metadata- probably worked harder on this torrent than any other. So, enjoy, seed, and please give feedback even if its negative so I can improve. ;)\n\n&quot;In me are the memories of a boy's life, spent in that realm of enchantments. These are the things I want to tell you.... \n\nRobert McCammon delivers &quot;a tour de force of storytelling&quot; (BookPage) in his award-winning masterpiece, a novel of Southern boyhood, growing up in the 1960s, that reaches far beyond that evocative landscape to touch readers universally. \n\nBoy's Life is a richly imagined, spellbinding portrait of the magical worldview of the young -- and of innocence lost. \n\nZephyr, Alabama, is an idyllic hometown for eleven-year-old Cory Mackenson -- a place where monsters swim the river deep and friends are forever. Then, one cold spring morning, Cory and his father witness a car plunge into a lake -- and a desperate rescue attempt brings his father face-to-face with a terrible, haunting vision of death. As Cory struggles to understand his father's pain, his eyes are slowly opened to the forces of good and evil that surround him. From an ancient mystic who can hear the dead and bewitch the living, to a violent clan of moonshiners, Cory must confront the secrets that hide in the shadows of his hometown -- for his father's sanity and his own life hang in the balance....&quot; &lt;a href=&quot;\nhttp://www.goodreads.com/book/show/11553.Boy_s_Life&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.goodreads.com/book/show/11553.Boy_s_Life&lt;/a&gt;","torrent":{"xt":"urn:btih:9eace0d5c8dca95a3efa1ad81fbdf60907906cb9","amp;dn":"Boy%27s+Life+By+Robert+R+McCammon+%28EPUB%2CMOBI%2CPDF%2CAZW%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9eace0d5c8dca95a3efa1ad81fbdf60907906cb9","infoHashBuffer":{"type":"Buffer","data":[158,172,224,213,200,220,169,90,62,250,26,216,31,189,246,9,7,144,108,185]},"announce":[],"urlList":[]}}