{"title":"Slydris v1.05 [PD]","uid":8859094,"size":37066046,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:9fab819e77113aef8092ba1f48622d4ddc55048a&amp;dn=Slydris+v1.05+%5BPD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1377732689,"description":"\nSlydris is a unique and engaging puzzle game with a simple premise but deceptively deep gameplay:\n\n* Slide and drop blocks to create full lines of blocks.\n* Create combos of falling blocks and clearing lines to fill up your bomb meter faster.\n* Create a row of a single color for a color burster.\n* Other special blocks (Shatter, Upcoming, Locked, and Magnet) add gameplay variety and challenge.\nThe three modes are Infinite Mode, Zen Mode, and Survival Mode:\n* In Infinite Mode, a new set of blocks drops after every move you make, so take as much time as you want. Clear 25 lines to move onto the next level.\n* Zen Mode functions similarly to Infinite Mode, but the difficulty is more dynamic, there are no achievements or scores to worry about, and your game will never end (in Infinite Mode, the game ends if the stack reaches the top row).\n* In Survival Mode, you have 10 seconds to make as many moves as you can to clear the lines of blocks, then a barrage of blocks will drop, and the cycle begins again. Quick thinking and nimble fingers are required to do well.\n\nSlydris is a highly polished and customizable puzzle game for all ages. Select from 3 music tracks and dark or light backgrounds.\nLike all Radiangames' titles, Slydris works great on tablets too!\n\nWhat's New:\n\n1.05\nHigher levels limit the number of starting blocks (so the game doesn't crash)\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.radiangames.slydris&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.radiangames.slydris&lt;/a&gt;\n","torrent":{"xt":"urn:btih:9fab819e77113aef8092ba1f48622d4ddc55048a","amp;dn":"Slydris+v1.05+%5BPD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fab819e77113aef8092ba1f48622d4ddc55048a","infoHashBuffer":{"type":"Buffer","data":[159,171,129,158,119,17,58,239,128,146,186,31,72,98,45,77,220,85,4,138]},"announce":[],"urlList":[]}}