{"title":"Bat for Lashes - The Haunted Man (2012) [FLAC]","uid":8094939,"size":313498590,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9fe1bbc96a229b04f8d57ca0041608afc3b308eb&amp;dn=Bat+for+Lashes+-+The+Haunted+Man+%282012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1359813717,"description":"\n  Bat for Lashes - The Haunted Man (2012) [FLAC]\n\n  Released: 2012\n  Duration: 51:44\n  Genre: Pop/Rock\n  Style: Indie, Alternative\n  Codec: FLAC\n  Bit Rate: ~ 800 kpbs\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  Cover: Front\n\n  01 Lilies \n  02 All Your Gold \n  03 Horses of the Sun \n  04 Oh Yeah\n  05 Laura \n  06 Winter Fields\n  07 The Haunted Man\n  08 Marilyn\n  09 A Wal\n  10 Rest Your Head\n  11 Deep Sea Diver\n\nNatasha Khan's two previous Bat for Lashes albums - 2006's Fur and Gold and 2009's Two Suns - were lavish affairs from their cover images to their intricate songs. However, The Haunted Man's album artwork, which depicts Khan as naked except for the also nude man slung over her shoulders, was one of the first hints that she was taking a slightly different tack with this set of songs. More proof came with &quot;Laura,&quot; the soft, spare ballad she picked to be the album's lead single. While Khan explored her flair with character studies on Two Suns, this song's intimacy and the keenly observed details in lyrics like &quot;your tears feel hot on my bedsheets&quot; felt more like a natural progression from songs like &quot;Sad Eyes,&quot; off of Fur and Gold. As that album (and Two Suns' more restrained moments) showed, Khan's singing and writing are more than strong enough to be more or less naked, and she finds freedom in this throughout most of The Haunted Man. \n\n  Feeling alive is a refrain on many of these songs, most vividly on the proudly sexual &quot;Oh Yeah,&quot; where Khan is &quot;waiting like a flower to open wide&quot; and the unearthliness of her upper register adds a fairytale sparkle to her desire. This mix of rawness and delicacy makes her among the best of all the Kate Bush disciples dotting the early 21st century pop landscape at emulating the will-o-the-wisp willfulness of La Bush's work, particularly on the silvery, shivery opening track &quot;Lilies&quot; and &quot;Winter Fields,&quot; which soars above the English countryside with just a little bit of fear shading its wonder. \n\n  When The Haunted Man strays from these sparer sounds, the results are mixed: the tribal/primal rhythms and vocals on &quot;Horses of the Sun&quot; add to its rough-hewn beauty, but the electronic squiggles and processed vocals on &quot;Marilyn&quot; are distracting and indulgent. Still, much of The Haunted Man caters to Khan's strengths, and songs such as &quot;All Your Gold,&quot; &quot;A Wall,&quot; and &quot;Rest Your Head&quot; are among the catchiest she's written in some time. Focus and restraint might not sound exciting in and of themselves, but The Haunted Man is more direct than any of Bat for Lashes' previous work, and manages to keep the air of mystique around Khan that has made her one to watch and listen to since her early days.","torrent":{"xt":"urn:btih:9fe1bbc96a229b04f8d57ca0041608afc3b308eb","amp;dn":"Bat+for+Lashes+-+The+Haunted+Man+%282012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fe1bbc96a229b04f8d57ca0041608afc3b308eb","infoHashBuffer":{"type":"Buffer","data":[159,225,187,201,106,34,155,4,248,213,124,160,4,22,8,175,195,179,8,235]},"announce":[],"urlList":[]}}