{"title":"Voyager dans le temps (Science.Einstein)","uid":13059796,"size":9282480,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a05d08142fecca619c0b7ac1e32223f40ac4a517&amp;dn=Voyager+dans+le+temps+%28Science.Einstein%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"asperge","files":4,"time":1450701992,"description":"Marc Lachièze-Rey - Voyager dans le temps\r\nSeuil | ISBN : 2021003523 | 2013-10 | EPUB | 191 pages | 3.9 MB\r\n\r\nL'idée de voyage temporel est l'une des plus séduisantes que nous propose la littérature, de science-fiction en particulier. Mais l'examen de ses évocations révèle bien vite contradictions, incohérences, paradoxes... Peut-on tenter, à la lumière des acquis de la science contemporaine, de réfléchir à ce que seraient des voyages dans le temps et d'évaluer leur possibilité effective ?\r\n\r\nCet ouvrage nous initie à certaines des recherches actuelles les plus subtiles de la physique contemporaine sur la temporalité, et nous amène à la lisière de ses hypothèses les plus novatrices, que proposent la théorie des cordes, la gravité quantique, ou d'autres approches.\r\n\r\nAu-delà de la seule physique, ces débats concernent ses relations avec d'autres disciplines (biologie, théorie de l'information, philosophie). Sans oublier les développements historiques, littéraires, cinématographiques... que le thème a suscités.\r\n\r\nC'est finalement la notion même de temps qui se trouve, à l'issue de ce livre exigeant et important, profondément remaniée.\r\n\r\nMarc Lachièze-Rey est directeur de recherches au CNRS et travaille au laboratoire APC (Astroparticule et cosmologie).\r\nSpécialiste de physique théorique fondamentale, il s'intéresse aux rapports de cette discipline avec les mathématiques et la philosophie.\r\nAuteur de nombreux articles spécialisés, il a aussi écrit plusieurs ouvrages pour le lectorat cultivé","torrent":{"xt":"urn:btih:a05d08142fecca619c0b7ac1e32223f40ac4a517","amp;dn":"Voyager+dans+le+temps+%28Science.Einstein%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a05d08142fecca619c0b7ac1e32223f40ac4a517","infoHashBuffer":{"type":"Buffer","data":[160,93,8,20,47,236,202,97,156,11,122,193,227,34,35,244,10,196,165,23]},"announce":[],"urlList":[]}}