{"title":"BBC.Blondie.One.Way.Or.Another.XviD.AC3.MVGroup.Forum.avi","uid":6424795,"size":842296564,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a1a25ccf6b7000ba1ec496608d81210b267ed8a8&amp;dn=BBC.Blondie.One.Way.Or.Another.XviD.AC3.MVGroup.Forum.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DocFreak08","files":-1,"time":1306416028,"description":"Blondie is perhaps the most commercially successful band to emerge from the 1970s punk scene. The original lineup consisted of Deborah Harry (vocals), Clem Burke (drums / percussion), Jimmy Destri (keyboards), Chris Stein (guitar / bass guitar) and Gary Valentine (bass guitar / guitar). New York City-based Blondie was formed in 1974, honing its musical skills at the famous punk rock club, CBGBs, and eventually emerging on top of the new wave scene and then crossing over to the pop music mainstream. Their self-titled first album, Blondie, reflected a punk ethos and 1960s girl group sensibilities or, the Ramones meets the Ronettes, as one music critic opined. Blondie made six albums from 1976 to 1982, the most successful being Parallel Lines, considered by many music critics to be one of the best rock albums of all time. Within this time span, from the late seventies to the early eighties, Blondie constituted a major force on the rock/pop scene, producing a string of hit singles internationally. The most well-known of these singles are the reggae-inspired &quot;The Tide Is High,&quot; the rap song &quot;Rapture,&quot; and the disco-flavored &quot;Heart of Glass&quot; and &quot;Call Me.&quot; More recently, in 1999, the single, &quot;Maria,&quot; debuted at number one in the United Kingdom, making this song the sixth number one single for the group there. With this hit single, Blondie reached yet another milestone-the first band to have had a number one single in each of the last three decades in the United Kingdom. And the new album, The Curse of Blondie, and its first single &quot;Good Boys&quot; build on that success. So Blondie continues to make music history and the band's legacy grows. The members of Blondie are true pioneers in every sense of the word.\n\nMark Radcliffe narrates a documentary about New York band Blondie, from their early beginnings in Bowery clubs like CBGBs alongside other up and coming bands like The Ramones, Patti Smith &amp; Talking Heads. The documentary tracks their years of international success, through their internal problems and decline and then to their recovery and re-establishment leading to their being inducted into the Rock and Roll Hall of Fame in 2006 - an event that wasn't without its problems. With exclusive backstage and performance footage from their recent UK tour plus in-depth interviews with current and ex band members and friends Iggy Pop, Shirley Manson, Tommy Ramone and Chris Frantz and Tina Weymouth of Talking Heads. Also lots of clips of them performing through the years.\n\nExecutive Producer Ricky Kelehar\nProduced &amp; Directed by Matt O'Casey\n\nA BBC Production (2006)\n\n\nTechnical Specs\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 1365 kbps\nVideo Resolution: 608x352\nVideo Aspect Ratio: 1.727:1\nFrames Per Second: 25.000\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 44100 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 1:11:41\nNumber Of Parts: 1\nPart Size: 842,296,564 Bytes\nEncoded by: DocFreak08","torrent":{"xt":"urn:btih:a1a25ccf6b7000ba1ec496608d81210b267ed8a8","amp;dn":"BBC.Blondie.One.Way.Or.Another.XviD.AC3.MVGroup.Forum.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1a25ccf6b7000ba1ec496608d81210b267ed8a8","infoHashBuffer":{"type":"Buffer","data":[161,162,92,207,107,112,0,186,30,196,150,96,141,129,33,11,38,126,216,168]},"announce":[],"urlList":[]}}