{"title":"Frank Zappa - 1993 - The Yellow Shark","uid":5524696,"size":457381566,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a22e4e5b339cd15902f927b0743a7c4a8633811e&amp;dn=Frank+Zappa+-+1993+-+The+Yellow+Shark&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lonesomecowboy","files":-1,"time":1272736384,"description":"F R A N K   Z A P P A\n- The Yellow Shark (Ensemble Modern) -\n\nDuring his last years, Frank Zappa concentrated on his &quot;serious music,&quot; trying to impose himself as a composer and relegating the rock personality to the closet. His last two completed projects topped everything he had done before in this particular field. The Yellow Shark, an album of orchestral music, was released only a few weeks before he succumbed to cancer (the computer music/sound collage album Civilization Phaze III was released 14 months later). This CD, named for a plexiglas fish given to Zappa in 1988, culls live recordings from the Ensemble Modern's 1992 program of the composer's music. The range of pieces goes from string quartets (&quot;None of the Above&quot;) to ensemble works, from very challenging contemporary classical to old Zappa favorites. The latter category includes a medley of &quot;Dog Breath Variations&quot; and &quot;Uncle Meat,&quot; &quot;Pound for a Brown,&quot; &quot;Be-Bop Tango,&quot; and the Synclavier compositions &quot;The Girl in the Magnesium Dress&quot; and &quot;G-Spot Tornado&quot; transcribed for orchestra. Being more familiar, these bring a lighter touch, but the real interest of the CD resides in the premiere recordings. &quot;Outrage at Valdez,&quot; the piano duet &quot;Ruth Is Sleeping,&quot; and &quot;Food Gathering in Post-Industrial America, 1992&quot; are all the gripping works of a mature composer, strongly influenced by Varese and Stravinsky but overwhelmed by them. But the crowning achievement is &quot;Welcome to the United States,&quot; a more freeform piece based on the U.S. visa form. Zappa shined when ridiculing stupidity. The average fan of the man's rock music will most probably feel lost in The Yellow Shark, but for those with interests in his serious music it is an essential item, more so than the London Symphony Orchestra and Orchestral Favorites albums.\n~ Francois Couture, All Music Guide \n\n\ncomplete booklet is included","torrent":{"xt":"urn:btih:a22e4e5b339cd15902f927b0743a7c4a8633811e","amp;dn":"Frank+Zappa+-+1993+-+The+Yellow+Shark","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a22e4e5b339cd15902f927b0743a7c4a8633811e","infoHashBuffer":{"type":"Buffer","data":[162,46,78,91,51,156,209,89,2,249,39,176,116,58,124,74,134,51,129,30]},"announce":[],"urlList":[]}}