{"title":"The Stryder - Masquerade in the Key of Crime [FLAC]","uid":8353494,"size":336243199,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a23cab8c973350f7ebc8120187f3196df911051d&amp;dn=The+Stryder+-+Masquerade+in+the+Key+of+Crime+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"politux","files":-1,"time":1365420203,"description":"Punk rock band the Stryder consists of Peter Toh (guitar), Scottie Redix (drums), Nick Wendell (bass), and John Johansen (vocals). Growing up together in the same Long Island, NY, neighborhood, the four had been playing in various bands since they were very young. Toh and Redix originally formed the band Yearly, but when their bassist, Eben d'Amico, left to join Saves the Day, they decided to re-form as the Stryder, rounded out by Wendell and Johansen. the Stryder credits bands like Green Day and Operation Ivy as having influence on their sound. They debuted with the two-song 7&quot; The Hits Just Keep on Comin'... on Elkion before their first full-length, Masquerade in the Key of Crime, was released in September 2000 on Equal Vision. Johansen exited the group before work began on their second album, so some lineup shuffling was in order. Redix switched to guitar and shared vocals with Toh, as ex-Glassjaw drummer Durijah Lang came on board behind the kit. Jungle City Twitch appeared in July 2002. The Savor the Danger! EP was issued by the year's end, which included old songs with Johansen still on vocals and the tracks from their Hits EP. However, the Stryder had officially called it quits by early 2003. Toh went on to release solo work, including 2004's Cleopatra EP on Elkion and 2006's Shoes of a Beast on Hidden Track.","torrent":{"xt":"urn:btih:a23cab8c973350f7ebc8120187f3196df911051d","amp;dn":"The+Stryder+-+Masquerade+in+the+Key+of+Crime+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a23cab8c973350f7ebc8120187f3196df911051d","infoHashBuffer":{"type":"Buffer","data":[162,60,171,140,151,51,80,247,235,200,18,1,135,243,25,109,249,17,5,29]},"announce":[],"urlList":[]}}