{"title":"Stossel.2013.09.19.[Innovation Nation].Fox Business.CF.avi","uid":8944851,"size":343031438,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a23d3457d5206b9e254c1991d0c4a276f1f897ab&amp;dn=Stossel.2013.09.19.%5BInnovation+Nation%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"skJGZV6z","files":-1,"time":1379750575,"description":"----------\n\nSTOSSEL - [Innovation Nation] - Fox Business Network\n2013, September 19, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nSPACE TRAVEL: People once assumed that only government would, or could, launch people into space. NASA got us to the moon, after all. But that was more than 40 years ago. In the remaining years they haven't sent people to anyplace new. But Bas Lansdorp, of Mars One, plans to send people to Mars in just 10 years. 165,000 people have already signed up.\n\nOTHER INNOVATION: James Canton, Institute for Global Futures founder, says the future will bring us many wonderful things, like robot doctors, and Elon Musk's Hyperloop- the high-speed train that promises to get you from LA to San Francisco in 30 minutes.\n\nSOCIAL MEDIA: Matt Kibbe runs Freedomworks and uses social media to spread liberty online. Freedomworks runs Facebook posts like this one, showing that Congress passes bills without reading them, and exempts its own staffers from laws. 24-year-old Julie Borowski posts YouTube videos about liberty. They are viewed by hundreds of thousands of people.\n\nBITCOIN: Government prints so much money that I fear I may have to pay for my retirement with bills like this-- a billion dollar bill from Zimbabwe:\n\nOur dollar hasn't been devalued that much. But how can we hedge against inflation and other government manipulation? Jerry Brito of the Mercatus Center says one option is to invest in Bitcoins.\n\n3D PRINTING: 3D printing lets you create all kinds of things right at home. That's wonderful! Except 3D printing upsets some people because it will soon allow most anyone at home to print a gun. In Texas, Cody Wilson did just that. He calls his printed gun &quot;The Liberator.&quot; Special Correspondent Kennedy went to visit him and shoot one of his guns.\n\nCITIZEN WATCHDOGS: Can innovation stop America's politicians from spending us broke? Adam Andrzejewski thinks so. He started a website that allows users to track government spending\n\nMY TAKE: In a free market, a symphony of desires come together... and are met by people constantly expanding their brains to invent solutions that make us all better off. I rarely fear new technology. I fear government will get in the WAY. Don't let it!","torrent":{"xt":"urn:btih:a23d3457d5206b9e254c1991d0c4a276f1f897ab","amp;dn":"Stossel.2013.09.19.%5BInnovation+Nation%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a23d3457d5206b9e254c1991d0c4a276f1f897ab","infoHashBuffer":{"type":"Buffer","data":[162,61,52,87,213,32,107,158,37,76,25,145,208,196,162,118,241,248,151,171]},"announce":[],"urlList":[]}}