{"title":"Kami Thompson...Love Lies(2011)[FLAC]","uid":6858964,"size":231060505,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a256c1b239acd27a2cbc5d81f0b7427f66ec3b8f&amp;dn=Kami+Thompson...Love+Lies%282011%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":15,"time":1322814254,"description":"[img]http://www.kamithompson.com/images/lovelies.png[/img]\n\n[color=Green] Love Lies(2011)Warner World 2564665549[/color]\n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\nLittle Boy Blue (4.11)\n4,000 Miles (2.17)\nNice Cars (2.18)\nGotta Hold On (4.09)\nStormy (4.04)\nNever Again (4.19)\nTick Tock (2.46)\nWant You Back (4.56)\nBlood Wedding (4.12)\nDon't Bother Me (2.59)\n\nLondon native Kamila Thompson popped out in the early eighties, the third and youngest child of folk duo Richard and Linda Thompson. Although she made occasional appearances with her family over the years, Kami remained galvanized against the draw of the music business until, in early 2006, Will Oldham (Bonnie 'Prince' Billy) invited her on tour. She had never heard of him, but she loved the records he posted to her, so she gave in to her deepest, darkest urges, quit her job and accepted the gig. It turned out to be a good decision.\nThere followed tours opening for brother Teddy Thompson, Hal Wilner's 'Came so Far for Beauty' tribute to Leonard Cohen, alongside Beth Orton and Nick Cave, a US tour with Sean Lennon and guest appearances at the Wainwrights' Carnegie Hall Christmas Concert alongside friends Martha and Rufus Wainwright, which earned her a glowing mention in the New York Times... she also notched up the regulation eight-hundred sparsely attended dive-bar gigs everywhere from Back to Beyond.\nIn between outings, Kami wrote and recorded the songs for her first record, LOVE LIES. The album was recorded in Brooklyn and Manhattan with producers Brad Albetta and Ed Haber and is slated for release this year. Guest artists include Richard and Teddy Thompson, Martha Wainwright and Sean Lennon as well as a host of other acclaimed musicians from both sides of The Pond.\nKami's rich voice and more-ish songs hint at her musical influences - PJ Harvey, Jeff Buckley, Elliot Smith - and her folk roots, but they lead you somewhere new. Kami's distinctive sound and heart-wrenching, intelligent fare will lure you to a place that feels like home, only everything's slightly off-centre.\n\ncd ripped by EAC\n\nplease seed\n\n[url]http://dickthespic.org/2011/12/02/kami-thompson/[/url]","torrent":{"xt":"urn:btih:a256c1b239acd27a2cbc5d81f0b7427f66ec3b8f","amp;dn":"Kami+Thompson...Love+Lies%282011%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a256c1b239acd27a2cbc5d81f0b7427f66ec3b8f","infoHashBuffer":{"type":"Buffer","data":[162,86,193,178,57,172,210,122,44,188,93,129,240,183,66,127,102,236,59,143]},"announce":[],"urlList":[]}}