{"title":"Beethoven Symphonies (complete) Skrowaczewski Saarbrucken","uid":9830613,"size":1562416724,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a32f13c49ef85aa928264a8ee9cd6919ae79cc9f&amp;dn=Beethoven+Symphonies+%28complete%29+Skrowaczewski+Saarbrucken&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"magneez","files":26,"time":1395833968,"description":"random amazon review:\n\nSubime performances! February 17, 2008\n\nI can't claim to have heard all of the sets of the complete Beethoven symphonies, but I've heard more than my share, and this set, in terms of both performance and recording, is far and away the best I've heard. Skrowaczewski's performances always sound perfectly natural, neither inflated nor trivialized, and the work of his orchestra is beyond praise. Though all of the performaces are outstanding, I would single out the Pastoral, the finest performance of the work I've heard. As one example among so many, listen to the rapt slow movement, particularly the second theme, which opens with a solo bassoon, joined after a few measures by the violas and cellos. As Skrowaczewski plays it, the frail sound of the bassoon registers very softly (but audibly) until the theme is underlined by the strings. It's absolutely beautiful here. Over the years I've found it harder and harder to listen to the Ninth, since performances are so often overloaded with gestures of profundity that usually translate into sheer ponderousness. Skrowaczewski plays the first movement as if it were middle rather than late Beethoven, and if he misses some of the mystery of the movement more than compensates with energy and structural coherence. I found the performance shattering. If I have any complaint at all, it's that the slow movement of the Seventh seems to me a bit too fast and detached and its finale could use a bit more adrenaline, but those are tiny complaints and may reflect my taste more than any reasonably objective opinion. By the way, Skrowaczewski separates first and second violins, producing some marvellous effects, particularly in the Fourth and Seventh symphonies. Add glorious sound to the performances (the Eroica is a live performance, the rest are studio performances) and you have a set indispensable to beginners and veterans alike.","torrent":{"xt":"urn:btih:a32f13c49ef85aa928264a8ee9cd6919ae79cc9f","amp;dn":"Beethoven+Symphonies+%28complete%29+Skrowaczewski+Saarbrucken","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a32f13c49ef85aa928264a8ee9cd6919ae79cc9f","infoHashBuffer":{"type":"Buffer","data":[163,47,19,196,158,248,90,169,40,38,74,142,233,205,105,25,174,121,204,159]},"announce":[],"urlList":[]}}