{"title":"HotLegsAndFeet - Vinna Reed (Carnal Affection, Psychologist Sedu","uid":12651741,"size":463066209,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:a4189d4964383d7b656fdbcfb99143eb397ed2b1&amp;dn=HotLegsAndFeet+-+Vinna+Reed+%28Carnal+Affection%2C+Psychologist+Sedu&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EndYou","files":1,"time":1446150412,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/image/ZvJ \nhttp://imgpremium.com/image/ZvV \r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nThe name of the actress: Vinna Reed\r\nName movie: Carnal Affection: Psychologist Seduces Foot Fetish Lover\r\nNPP site and the site: HotLegsAndFeet.com / DDFNetwork.com\r\n\r\nYear: 2015\r\nGenre: Cum on feet, Foot fetish, Footjob, High Heels, Pussy fucking, Leg fetish, Stockings, Foot licking, Shoe Licking\r\nDuration: 00:44:22\r\n\r\nLutro has an appointment with psychologist Vinna Reed. After a short conversation, she puts her leg onto her patient and triggers his carnal affection and love for foot fetish hardcore sex. Lutro can not resist and starts stroking the blonde babe's calves, takes off her high heels and takes a deep sniff of that breath taking scent of attraction. He licks her white nylon stockings before they switch places and she gives him a blowjob. The horny stuf rubs his helmet on her heels while sniffing her shoes and she gives him a footjob and massages his glans with her toes.\r\n\r\nHe returns the favor by eating her pussy while she sits on his face. That shaved pink pussy tastes so good, and while he sucks her clit, she forms a foot soles twat around his shaft and gives him a warm up before riding him like a cowgirl. Vinna wears whit lingerie and slides his cock deep into her box while giving our DDF Network DSLR cameras a nice pussy gape here and there. After banging the psychologist doggy style, Lutro sucks her toes in and peels off her stockings to finally enjoy a naked toe sucking experience.\r\n\r\nAlmost fully naked, the two horny lovers get down in a wide variety of positions and our Full HD lenses catch a glimpse of all those dirty details. While Lutro penetrates the Czech chick's quim spoon style, he enjoys her ankles and licks her soles before she gives him that fully naked footjob until he blows his cum all over her sexy feet and toes!\r\n\r\nVideo Quality: SiteRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 640x360 29.97fps 1198kbps\r\nAudio: AAC 48000Hz stereo 189kbps","torrent":{"xt":"urn:btih:a4189d4964383d7b656fdbcfb99143eb397ed2b1","amp;dn":"HotLegsAndFeet+-+Vinna+Reed+%28Carnal+Affection%2C+Psychologist+Sedu","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4189d4964383d7b656fdbcfb99143eb397ed2b1","infoHashBuffer":{"type":"Buffer","data":[164,24,157,73,100,56,61,123,101,111,219,207,185,145,67,235,57,126,210,177]},"announce":[],"urlList":[]}}