{"title":"PBS.Empires.Napoleon.4of5.The.End.XviD.AC3..avi","uid":6461140,"size":854863872,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a722a5dd161ca98cae8428eccc4a8b2593ee0b69&amp;dn=PBS.Empires.Napoleon.4of5.The.End.XviD.AC3..avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DocFreak08","files":-1,"time":1307782932,"description":"For nearly two decades he strode the world stage like a colossus -- loved and despised, venerated and feared. From his birth on the rugged island of Corsica to his final exile on the godforsaken island of St. Helena, NAPOLEON brings this extraordinary figure to life.\n\nNAPOLEON bears passionate witness to a man whose charisma swayed an empire and sparked his exalted belief in his own destiny. He is a figure riddled with contradictions that are the essence of his glory and undoing: his youthful enthusiasm for the ideals of the French Revolution did not prevent him from crowning himself Emperor. His passionate love of Josephine did not prevent him from divorcing her to marry the eighteen year Archduchess of Austria. His military genius did not save him from the disastrous invasion of Russia. His love of France was so compromised by his notions of personal glory that he repeatedly plunged his beloved country into war.Framed by the grand sweep of history, woven from intimate accounts of and by the man himself. NAPOLEON is a tale as grand as any novel, a story of passion, vaunting ambition and pride ending in exile and loss.\n\nWritten and Directed by David Grubin\nNarrated by David McCullough\nProducers David Grubin and Alyson Luchak\n\nProduced by David Grubin Productions in association with PBS Docstar and Devillier Donegan Enterprises (2000)\n\n\nEpisode 4 : The End\n\nEpisode IV describes Napoleon's downfall, including the invasion and subsequent retreat from Russia, and his final battles, in which all of Europe is arrayed against him. Exiled to Elba, he returns to France after just ten months, only to be defeated for the last time at Waterloo. Napoleon spends his final days exiled on an island far out in the Atlantic, where he writes his memoirs and reinvents his legend.\n\n\n\nTechnical Specs\n\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 1836 kbps\nVideo Resolution: 720x432\nVideo Aspect Ratio: 1.667:1\nFrames Per Second: 29.970\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 224kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 55:06.536\nNumber Of Parts: 5\nPart Size: 854,847,488 Bytes\nRipped by: DocFreak08","torrent":{"xt":"urn:btih:a722a5dd161ca98cae8428eccc4a8b2593ee0b69","amp;dn":"PBS.Empires.Napoleon.4of5.The.End.XviD.AC3..avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a722a5dd161ca98cae8428eccc4a8b2593ee0b69","infoHashBuffer":{"type":"Buffer","data":[167,34,165,221,22,28,169,140,174,132,40,236,204,74,139,37,147,238,11,105]},"announce":[],"urlList":[]}}