{"title":"The Nick Revell Show - Series 01 &amp; 02 - Audio Comedy - 128K - Mp","uid":5396700,"size":332094347,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a72598035679adffbf9e49be8d12c895fe246f9f&amp;dn=The+Nick+Revell+Show+-+Series+01+%26+02+-+Audio+Comedy+-+128K+-+Mp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_Slimoo_","files":12,"time":1267261957,"description":"The Nick Revell Show - Series 01 &amp; 02 - Audio Comedy - BBC7 via DVB-T\n12 x 30 Minute Episodes - 128Kbps - Mp3 - Slimoo \n\n\nBilled as a &quot;sitcom for the nineties&quot; -- whatever that might mean -- this was a fresh and funny series written by and starring Nick Revell, who created The Million Pound Radio Show with Andy Hamilton and wrote for countless television projects from the early eighties onwards.  In many ways, the set-up was fairly conventional: the central character (who had Revell's own name, after the fashion of American sitcom) was a struggling North London writer with a selection of dysfunctional friends, a domineering agent, a sympathetic barman, etc, etc.  But what made The Nick Revell Show unique was that Nick also conversed on a regular basis with Vince, a talking geranium who lived in his flat.  \n\n\n\nNotable faces among the changing cast were Doon Mackichan and Alistair McGowan as the bickering Dundonians Shona and Craig.  Two series were made.  It might have been considered that the presence of Vince the geranium rendered the show a strictly radio phenomenon, but before long a TV pilot appeared entitled N7 (from the London postal code; the name was changed because Revell did not actually appear, with the 'Nick' role going to actor James Larkin).  No TV series followed, in spite of the magnificent performance of Phil Daniels as Vince.\n\n\n\nThe Nick Revell Show - S01 - E01 - Holy Water\nThe Nick Revell Show - S01 - E02 - The Burglary\nThe Nick Revell Show - S01 - E03 - The Street Party\nThe Nick Revell Show - S01 - E04 - The Holiday\nThe Nick Revell Show - S01 - E05 - The Lodger\nThe Nick Revell Show - S01 - E06 - Committments\n\nThe Nick Revell Show - S02 - E01 - Homeless\nThe Nick Revell Show - S02 - E02 - Visitors\nThe Nick Revell Show - S02 - E03 - The Wedding\nThe Nick Revell Show - S02 - E04 - Health And Fitness\nThe Nick Revell Show - S02 - E05 - The Promised Land\nThe Nick Revell Show - S02 - E06 - All's Well That Ends Well-- Well, Well, Well\n.\n\n\nAudio Format    : MP3\nDuration        : 28mn 1s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n[","torrent":{"xt":"urn:btih:a72598035679adffbf9e49be8d12c895fe246f9f","amp;dn":"The+Nick+Revell+Show+-+Series+01+%26+02+-+Audio+Comedy+-+128K+-+Mp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a72598035679adffbf9e49be8d12c895fe246f9f","infoHashBuffer":{"type":"Buffer","data":[167,37,152,3,86,121,173,255,191,158,73,190,141,18,200,149,254,36,111,159]},"announce":[],"urlList":[]}}