{"title":"At Risk - Stella Rimmington  (Unabridged)","uid":6045655,"size":185651153,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a7fa6e2ca37855ef2fbd7afd19534ad8f5df11e2&amp;dn=At+Risk+-+Stella+Rimmington++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lucy1948","files":14,"time":1292539121,"description":"Unabridged and read by Maggie Mash. 12 hours 53 mins duration. 12 CD's. (Fraunhofer CBR 32 kbit/s 22050 Hz Mono).\n\n\n\n\n'Our concern - and we've communicated this over the weekend to all stations - is that the opposition may be about to deploy an invisible.'An invisible is CIA speak for the ultimate intelligence nightmare: the terrorist who, because he or she is an ethnic native of the target country, can cross its borders unchecked, move around that country unquestioned and infiltrate its institutions with ease. An invisible on mainland Britain was the worst possible news. For Liz Carlyle, an MI5 Intelligence officer, this report from MI6 marks the start of an operation which will test her to the limit and put her own life in jeopardy. As she sifts the incoming evidence and gets reports from her agents she realizes there is an immanent terrorist threat. But who or what is the target? And who and where is the invisible? Time is of the essence in this desperate search and it becomes clear that it is Liz's intuitive skills, her ability to get inside her enemy's head, which offer the only hope of averting disaster. In this terrifying and tautly drawn debut thriller Stella Rimington takes us to the heart of the Intelligence world. It is a place she is uniquely qualified to describe.\n\nStella Rimington joined the Security Service (MI5) in 1965 and during her career she worked in all the main fields of the Service's responsibilities - counter-subversion, counter-espionage and counter-terrorism - and became successively Director of all three branches. She was appointed Director-General of MI5 in 1992. She was the first woman to hold the post and the first Director-General whose name was publicly announced on appointment.\n","torrent":{"xt":"urn:btih:a7fa6e2ca37855ef2fbd7afd19534ad8f5df11e2","amp;dn":"At+Risk+-+Stella+Rimmington++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7fa6e2ca37855ef2fbd7afd19534ad8f5df11e2","infoHashBuffer":{"type":"Buffer","data":[167,250,110,44,163,120,85,239,47,189,122,253,25,83,74,216,245,223,17,226]},"announce":[],"urlList":[]}}