{"title":"Dallas 10x29 Fall of the House of Ewing.avi","uid":4809432,"size":221328958,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a883345986a62fd3fcbbed6a2fe79bc3e153f128&amp;dn=Dallas+10x29+Fall+of+the+House+of+Ewing.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"juuzto","files":1,"time":1238325131,"description":"Yes boys and girls: DALLAS is back, and now that the dream is over, its even better than ever!\n\nJenna gives birth; Christopher learns of his adoption; J.R. and Bobby continue negotiations with the Justice Department; Mrs. Scottfield and Jeremy Wendell reveal their plans; Sue Ellen and Mandy fight over J.R.; Pam receives wonderful medical news, and races toward home to tell Bobby.\n\nFirst Aired: 5/15/1987\n\nWhen this season began, Donna went to Washington to start the oil lobby idea that J.R., Cliff, Marilee, Jordan, and the rest of the independents came up with. After a while there was no mention of the lobby anymore and the storyline just fizzled out.\n\nThe episode title is an allusion to the short story, &quot;The Fall of the House of Usher&quot;, by Edgar Allen Poe. \n\nVictoria Principal appeared in almost each and every episode of the series, since its debut in 1978, having to miss only 1 episode, due to illness, for a total of 250 of the 357 episodes. In an interview with TV Guide, the real reason why she decided to leave Dallas is because being the avid fan she was, her character was growing tired, and it was also time for her to move on to other things.\n\n\nDallas the complete 11th season is released on april 2009 on DVD, I will upload it during the summer IF I can find it, hopefully someone else will upload it soon.","torrent":{"xt":"urn:btih:a883345986a62fd3fcbbed6a2fe79bc3e153f128","amp;dn":"Dallas+10x29+Fall+of+the+House+of+Ewing.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a883345986a62fd3fcbbed6a2fe79bc3e153f128","infoHashBuffer":{"type":"Buffer","data":[168,131,52,89,134,166,47,211,252,187,237,106,47,231,155,195,225,83,241,40]},"announce":[],"urlList":[]}}