{"title":"KG Dogfighting v2.32","uid":9023706,"size":10187876,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:a90d2af799b1aadb4e489b2e7d7fa6dfee103914&amp;dn=KG+Dogfighting+v2.32&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1381323878,"description":"\nRaise your dog to beat the best!\nAN APP THAT WILL NEVER APPEAR IN THE iPHONE APP STORE!\n\nThe Controversial Dogfighting Android &quot;DogWars - Beta&quot; app by Kage Games LLC has been renamed to KG Dogfighting!\nFeed, water, train and FIGHT your virtual pet dog against others...\n\n-Interactive action training games\n-Chatroom\n-Many characters and dogs to choose from\n-Virtual store (training gear, weapons, guns, steroids, bling)\n-Shoot outs with the 'authorities' trying to catch you for dogfighting\n\nThis game is more fun than MMORPGs like iMobsters or gangwars, because it has action games of skill utilizing the touchscreen for swiping gestures like papertoss or angry birds, and the accelerometer like many racing games and crazy snowboarder. \n\nThere is no sex, nudity, or naked girls, but it is an adult multiplayer game that could have swear words from other users and offensive material. It has kind of a ghetto, hood rat type feel with rap theme music.\nNO PITBULLS WERE HARMED IN THE MAKING OF THIS APP... a few flies got swatted. YOU MUST BE 13 YEARS OF AGE TO PLAY.\n\nDrop your cred codes and ideas in the comments section or message boards on the web. Check the shoutbox in the game for news and game updates, or just talk fight and smack with other players.\n\nPLEASE REMEMBER:\n\n1. It is just A VIDEO GAME\n2. Perhaps one day we will make gerbil wars or betta fish wars for people who can't understand fantasy role play games\n3. Just because something is illegal in real life in certain countries, does not mean it is illegal to make a song, movie, or video game about it\n4. Just go slingshot some virtual birds to kill some virtual pigs.\n5. Go complain to someone who cares about Call of Duty, Grand Theft Auto, Weed Farmer, Smoke a Bowl and maybe even Sierra's Leisure Suit Larry from 1987. (We heard it is actually coming to Android soon!)\n6. This is listed as a HIGH MATURITY app, and does NOT violate the Terms of Use with the Google market in any way!!!\n\nLet's Get it On!\n\nWhat's New:\n\n-NEW Advanced Bite Training Game!\n-NEW Messages from the Pitboss!\n-FETA BUSTS / SHOOTOUTS w/ the AUTHORITIES!\n-FULL FIGHT HISTORY NOW - OH YES!\n-UI tweaks\n-Transfer code displayed in options\n-Apps2SD is back\n-Changes to the way user accounts are stored on phones\n-CAUTION --&gt; Bait dog fights are recognized by server...\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=kagegames.apps.KG_AppD1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=kagegames.apps.KG_AppD1&lt;/a&gt;\n","torrent":{"xt":"urn:btih:a90d2af799b1aadb4e489b2e7d7fa6dfee103914","amp;dn":"KG+Dogfighting+v2.32","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a90d2af799b1aadb4e489b2e7d7fa6dfee103914","infoHashBuffer":{"type":"Buffer","data":[169,13,42,247,153,177,170,219,78,72,155,46,125,127,166,223,238,16,57,20]},"announce":[],"urlList":[]}}