{"title":"Angels Make Their Hope Here by Breena Clarke  (retail) {dwg}","uid":10971093,"size":6211062,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab0a1b42a78191364c7901877359f2c41792ef24&amp;dn=Angels+Make+Their+Hope+Here+by+Breena+Clarke++%28retail%29+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"gratefuldawg77","files":6,"time":1409793171,"description":"From the author of the bestselling River, Cross My Heart-a compelling and lyrical new novel about a young black woman in the Civil War era who finds refuge in a racially tolerant community.\n\n\nRussell's Knob is not paradise. But already in 1863 this New Jersey highlands settlement is home to a diverse population of blacks and whites and reds who have intermarried and lived in relative harmony for generations. It is a haven for Dossie Bird, who has escaped north along the Underground Railroad and now feels the embrace of the Smoot family: Duncan (so much older than Dossie; could he expect her to be his helpmeet?), his reticent sister, his exuberant nephews, and a circle of friends that includes the local spirit woman, Noelle. Tentatively, Dossie begins to lay down roots-until an act of violence propels her away from Russell's Knob and eventually into the mayhem of New York City's mean streets.\n\n\nWith the same storytelling brio that distinguished the acclaimed novels River, Cross My Heart and Stand the Storm, Breena Clarke weaves the richly dramatic story of one woman's triumph in the crucible of history.","torrent":{"xt":"urn:btih:ab0a1b42a78191364c7901877359f2c41792ef24","amp;dn":"Angels+Make+Their+Hope+Here+by+Breena+Clarke++%28retail%29+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab0a1b42a78191364c7901877359f2c41792ef24","infoHashBuffer":{"type":"Buffer","data":[171,10,27,66,167,129,145,54,76,121,1,135,115,89,242,196,23,146,239,36]},"announce":[],"urlList":[]}}