{"title":"Hamish And Dougal - Youll Have Had Your Tea - Audio Comedy - 128","uid":5727960,"size":269449874,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ab363c34f29e6b3f6d165fdd06b400dc8498cbc0&amp;dn=Hamish+And+Dougal+-+Youll+Have+Had+Your+Tea+-+Audio+Comedy+-+128&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_Slimoo_","files":18,"time":1280534141,"description":"Hamish and Dougal - Audio Comedy - Complete Series 1 to 3 - Plus Specials - BBC7 via DVB-T\n16 x 15 minute episodes and 2 x 30 minute episode- 128Kbps - Mp3 - Slimoo\n\n\n\nHamish and Dougal are two characters from the long-running BBC Radio 4 &quot;antidote to panel games&quot;, I'm Sorry I Haven't a Clue. One of the rounds in this show is Sound Charades, where a title of a book or film has to be conveyed from one team to the other by means of a story. The result of the story is usually a pun on the title in question.\n\nBarry Cryer and Graeme Garden usually tell their story as two elderly Scottish gentlemen, Hamish and Dougal. It is in essence a minute-long improvised sketch where each performer knows the other well enough to be able to set up joint jokes seamlessly.\n\nEach sketch is started with the line &quot;You'll have had your tea&quot;, with which (un)welcome visitors who have a habit of dropping in at dinnertime are reputed to be greeted in Edinburgh, Scotland. (In the north of the United Kingdom, the evening meal, typically called dinner in the south, is usually called tea; this can sometimes lead to confusion.) This is done either to deter scroungers or because the person in question is quite tight-fisted himself\n\n\nThe scripts were written very carefully, with barely a single line devoid of a joke. Often the fact that it was broadcast on radio was taken advantage of, with sound effects deliberately giving the audience the wrong impression. An example of this is the laird asking Dougal whether he wanted a drink followed by a long drawn out sound of running water, then the laird saying &quot;Ah that's better, now what would you like to drink?&quot;\n\n\n\nDespite the risquÃƒÂ© nature of a lot of the jokes (such as the dance of the seven voles: &quot;Och, where's that little rascal got to&quot;, it is a very gentle comedy, with the usual joyous disregard for storylines that often characterizes this type of material. \n\n\n\nHamish And Dougal - S01 - E01 - The Musical Evening\nHamish And Dougal - S01 - E02 - The Murder Mystery\nHamish And Dougal - S01 - E03 - Romance In The Glen\nHamish And Dougal - S01 - E04 - The Shooting Party\n\nHamish And Dougal - S02 - E01 - The Vampire Of The Glen\nHamish And Dougal - S02 - E02 - Fame Idol\nHamish And Dougal - S02 - E03 - The Fitness Club\nHamish And Dougal - S02 - E04 - The Poison Pen Letters\nHamish And Dougal - S02 - E05 - The Monster In The Loch\nHamish And Dougal - S02 - E06 - Trapped! \nHamish And Dougal - S02 - E07 - Hogmanay Special\n\nHamish And Dougal - S03 - E01 - Gambling Fever\nHamish And Dougal - S03 - E02 - There's Something About Mrs Naughtie\nHamish And Dougal - S03 - E03 - The Subsidence Adventure\nHamish And Dougal - S03 - E04 - Inverurie Jones And The Thimble Of Doom\nHamish And Dougal - S03 - E05 - Look Who's Stalking The Laird\nHamish And Dougal - S03 - E06 - Porridge Votes\nHamish And Dougal - S03 - E07 - Burns Night Special\n\n\n.\n\n\n\nAudio Format    : MP3\nDuration Approx : 13mn 54s\nBit rate mode   : Constant\nBit rate        : 128 Kbps \nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n\n[","torrent":{"xt":"urn:btih:ab363c34f29e6b3f6d165fdd06b400dc8498cbc0","amp;dn":"Hamish+And+Dougal+-+Youll+Have+Had+Your+Tea+-+Audio+Comedy+-+128","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab363c34f29e6b3f6d165fdd06b400dc8498cbc0","infoHashBuffer":{"type":"Buffer","data":[171,54,60,52,242,158,107,63,109,22,95,221,6,180,0,220,132,152,203,192]},"announce":[],"urlList":[]}}