{"title":"Neds 2010 DVDRip Sonata Premiere","uid":8855003,"size":734201061,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:abc4e33130150367a33d39f9da35cc9563f215bd&amp;dn=Neds+2010+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"klinho","files":5,"time":1377629249,"description":"A young man discovers how hard it can be to live down the reputation your family sets for you in this powerful drama. It's 1972, and John McGill (Gregg Forrest) has just completed grade school in Glasgow. John received excellent marks and has high hopes for middle school. However, his older brother Benny (Joe Szula) is well remembered at the school as a troublemaker and the leader of a youth gang, so John finds his teachers have low expectations of him, and offer him few opportunities to prove them wrong. When John is rejected by one of his new friends, Julian (Martin Bell), because his mother believes John is beneath their station, he finds some much needed respect in the company of Fergie (John Joe Hay), a gang leader who knows of Benny's fearsome reputation. Within two years, John (now played by Conor McCarron) has transformed himself into a &quot;NED&quot; -- &quot;non-educated delinquent&quot; in the school system's lingo -- and has exceeded his teachers' worst expectations of him. John has become enough of a thug to even put fear in the heart of his father, an unstable alcoholic with a propensity for violence. NEDS was written and directed by actor turned filmmaker Peter Mullan, who also plays John's father.\n\n\nLanguage: English / Scots\n\nSubs srt: Portuguese / Spanish / French / English\n\n","torrent":{"xt":"urn:btih:abc4e33130150367a33d39f9da35cc9563f215bd","amp;dn":"Neds+2010+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abc4e33130150367a33d39f9da35cc9563f215bd","infoHashBuffer":{"type":"Buffer","data":[171,196,227,49,48,21,3,103,163,61,57,249,218,53,204,149,99,242,21,189]},"announce":[],"urlList":[]}}