{"title":"Desperate Times 2 Gun Control","uid":8177628,"size":387578,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:acc13e6db5a2f015ee92ca9327b1097abdede364&amp;dn=Desperate+Times+2+Gun+Control&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DaRule762","files":-1,"time":1361561116,"description":"Desperate times continue to grind on with no sign of Martial Law ending soon or any hope that the economic crisis has subsided. Jimmy and his group learn of another camp of refugees that live not ten miles away from them. The group has adopted a 1960's era commune theme, complete with hippie slang and a flower child mentality. The commune was created out of one of the grand old lodges of northern Minnesota and is called Utopia, and they have one rule: No guns allowed.\n\nBy chance or design, the population of Utopia is 90% female and for some strange reason, the National Guard seems perfectly content to allow it to exist without harassment. Jimmy's group is evenly split on joining up with the much larger group, who appear to be at peace with the world. Ken Dahlgren, Jimmy's host, is bound and determined to remain where he is. Patty, Ken's wife, suddenly seems to be losing her grip on reality and it only adds more tension to the situation. Julie, Jimmy's girl, seems intent on staying with the hippies and giving up her guns. Jimmy is torn between the two sides.\n\nJimmy is introduced to a new world as he steps back in time to experience the sixties. What he painstakingly learns is that those he considers to be left-wing liberals are every bit as stubborn as the right-wing conservatives, which he has aligned himself with. The storyline here is a no holds barred, Desperate Times, look at regular people pushed to the limit and forced to respond. The result is a powerful story with an interesting message. ","torrent":{"xt":"urn:btih:acc13e6db5a2f015ee92ca9327b1097abdede364","amp;dn":"Desperate+Times+2+Gun+Control","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acc13e6db5a2f015ee92ca9327b1097abdede364","infoHashBuffer":{"type":"Buffer","data":[172,193,62,109,181,162,240,21,238,146,202,147,39,177,9,122,189,237,227,100]},"announce":[],"urlList":[]}}