{"title":"PBS Frontline~ THE CHILD CASES  2011 06 22 ","uid":6514136,"size":384386292,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ad9aa50a682f05c7e98a55d32bdf4eb048d953ff&amp;dn=PBS+Frontline%7E+THE+CHILD+CASES++2011+06+22+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"john1942","files":1,"time":1309760735,"description":"PBS Frontline~ THE CHILD CASES  2011 06 22 \n\n\n366mb/32mns/avi\n\nA joint investigation by ProPublica, PBS FRONTLINE and NPR looks into nearly two dozen cases in which people were accused of killing children based on flawed forensic opinions and then later cleared\n\nHer name was Isis Charm Vas and at 6 months old she was a slight child -- fifth percentile in height and weight.\n\nWhen the ambulance sped her to Northwest Texas Hospital on a Saturday morning in October 2000, doctors and nurses feared that someone had done something awful to her delicate little body.\n\nA constellation of bruises stretched across her pale skin. CT scans showed blood pooling on her brain and swelling. Her vagina was bleeding, as well. The damage was so severe that her body's vital organs were shutting down.\n\nLess than 24 hours later, Isis died.\n\nAn autopsy bolstered the initial suspicions that she'd been abused. Dr. Joni McClain, a forensic pathologist, ruled Isis' death a homicide and said the baby had been sexually violated. McClain would later describe it as a &quot;classic&quot; case of blunt force trauma, the type of damage often done by a beating.\n\nThe police investigation that followed was constructed almost entirely from post-mortem medical evidence. In the end, prosecutors indicted one of the child's babysitters: Ernie Lopez.\n\nToday, Lopez is serving a 60-year prison term for sexual assault and is still facing capital murder charges.\n\nBut in the years since Lopez was sent to the penitentiary, a growing body of evidence has emerged suggesting that McClain and the hospital staffers were wrong about what happened to Isis -- and that her death was not the result of a criminal attack but caused by the child's underlying medical condition that could have been easily known. \n\nOther cases and the general approach to child deaths incidents is critically investigated by the Frontline-Pro Publica team, uncovering numerous cases in which injustice may have resulted.\n\n\nMore Info:http://www.pbs.org/wgbh/pages/frontline/the-child-cases/","torrent":{"xt":"urn:btih:ad9aa50a682f05c7e98a55d32bdf4eb048d953ff","amp;dn":"PBS+Frontline%7E+THE+CHILD+CASES++2011+06+22+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad9aa50a682f05c7e98a55d32bdf4eb048d953ff","infoHashBuffer":{"type":"Buffer","data":[173,154,165,10,104,47,5,199,233,138,85,211,43,223,78,176,72,217,83,255]},"announce":[],"urlList":[]}}