{"title":"Miles Davis - Pangaea - Zimbabwe (1975) [Jazz][mp3 320][h33t][sc","uid":4699605,"size":104870738,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:adf5729d66a8a6821cf2700eb4fe56a734b30154&amp;dn=Miles+Davis+-+Pangaea+-+Zimbabwe+%281975%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bsc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"schon55","files":10,"time":1233674569,"description":"Miles Davis - Pangaea - Zimbabwe (1975)\nRecorded live at Osaka Festival Hall, Japan, February 1, 1975.\nOriginally released on Vinyl in 1975 by Columbia Records.\nPreviously issued in Japan as CBS/SONY 50DP 239-40.\nLabel: Columbia/Legacy\nBitrate: 320 kbps\n\nA huge seething, buckling gigant of a soundtrack...the soundtrack to the beginning of the world and the end of Miles' dalliance with rock...Never again would this heady brew of jazz, rock and funk reach such peaks...No-one has ever come close to this, or Agartha for sheer primal viscerality. ~ P.Bell / Comment @ Amazon UK\n\nAlthough Miles Davis's health was quite weak at the time of this two-CD set, he has a few strong trumpet solos on these two very lengthy pieces ('Zimbabwe' and 'Gondwana'). Just after these concerts, Miles would go into an almost six year hiatus from music. The music here is stunning with the dense ensembles and heated solos ( Sonny Fortune on soprano, alto, and flute and the guitars of Pete Cosey and Reggie Lucas ) being quite boisterous, but very powerful.  Pangaea is one of the finest recordings from the least-understood period of Davis's career (1971-1975). ~ Editorial @ Amazon USA\n\nThis is the second of two performances from February 1975 at the Osaka Festival Hall in Japan. This is the evening show; the Columbia release Agharta was the afternoon show. Pangaea is comprised either as a double LP or double CD of two tracks, 'Zimbabwe' and 'Gondwana.' Each is divided into two parts. The band here is comprised of Sonny Fortune on saxophones, Pete Cosey (who also played synth) and Reggie Lucas on guitars, Michael Henderson on bass, Al Foster on drums, James Mtume on percussion, and Davis on trumpet and organ. The band, no doubt inspired by their amazing performance earlier in the day, comes out swinging, and I mean like Muhammad Ali, not Benny Goodman. This is a take-no-prisoners set. Davis seems to be pushing an agenda of 'What the hell is melody and harmony? And bring on the funk -- and while you're at it, Pete, play the hell outta that guitar. More drums!' If there is anything that's consistent in this free-for-all, as everybody interacts with everyone else in an almighty dirty groove &amp; roll while improv is at an all-time high, it's the rhythmic, or should we emphasize 'polyrhythmic,' invention. Mtume and Foster are monstrous in moving this murky jam session along ( 'Zimbabwe' is one set, and 'Gondwana' is the second of the evening ) some surreal lines. When Cosey's not ripping the pickups out of his guitar, he's adding his hands to various percussion instruments in the pursuit of the all-powerful Miles Davis' inflected voodoo funk. And while it's true that this set is as relentless as the Agharta issue, it's not quite as successful, though it's plenty satisfying. The reason is simple: the dynamic and dramatic tensions of the afternoon session could never have been replicated, they were based on all conditions being right. Here, while the moods and textures are carried and the flow is quite free, the dramatic tension is not as present; the mood is not quite so dark. And while the playing of certain individuals here may be better than it is on Agharta, the band's playing isn't quite at that level. That said, this is still an essential Miles Davis live record and will melt your mind just as easily as Agharta. People would complain on this tour that Davis played with his back to the audience a lot -- Lester Bangs went so far as to say he hated his guts for it. But if you were this focused on creating a noise so hideously beautiful from thin air, you might not have time to socialize either. ~ Thom Jurek / Editorial @ Allmusic\n\nPersonnel:\nMiles Davis - Trumpet, Organ\nSonny Fortune - Soprano Sax, Alto Sax, Flute\nPete Cosey - Guitar, Synthi, Percussion\nReggie Lucas - Guitar\nMichael Henderson - Fender Bass\nAl Foster - Drums\nMTume - Congas, Percussion, Water Drums, Rhythm Box\n\nDisc 1 Zimbabwe ( 41:48 )\nDisc 2 Gondwana ( 46:50 )","torrent":{"xt":"urn:btih:adf5729d66a8a6821cf2700eb4fe56a734b30154","amp;dn":"Miles+Davis+-+Pangaea+-+Zimbabwe+%281975%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bsc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adf5729d66a8a6821cf2700eb4fe56a734b30154","infoHashBuffer":{"type":"Buffer","data":[173,245,114,157,102,168,166,130,28,242,112,14,180,254,86,167,52,179,1,84]},"announce":[],"urlList":[]}}