{"title":"Gareth Stedman Jones - The Cambridge History of Nineteenth-Centu","uid":10000851,"size":5462911,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae82dbf1486dcad09d49eb48a5d216dfbb8be76e&amp;dn=Gareth+Stedman+Jones+-+The+Cambridge+History+of+Nineteenth-Centu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1397981227,"description":"Description\nProduct Details\nBook Title: The Cambridge History of Nineteenth-Century Political Thought (The Cambridge History of Political Thought)\t\nBook Author: Gareth Stedman Jones, Gregory Claeys\nSeries: The Cambridge History of Political Thought\nHardcover: 1156 pages\nPublisher: Cambridge University Press (August 15, 2011)\nLanguage: English\nISBN-10: 0521430569\nISBN-13: 978-0521430562\n--------------------------\nBook Description\nPublication Date: August 15, 2011 | ISBN-10: 0521430569 | ISBN-13: 978-0521430562\nThis major work of academic reference provides the first comprehensive survey of political thought in Europe, North America and Asia in the century following the French Revolution. Written by a distinguished team of international scholars, this Cambridge History is the latest in a sequence of volumes firmly established as the principal reference source for the history of political thought. In a series of scholarly but accessible essays, every major theme in nineteenth-century political thought is covered, including political economy, religion, democratic radicalism, nationalism, socialism and feminism. The volume also includes studies of major figures, including Hegel, Mill, Bentham and Marx, and biographical notes on every significant thinker in the period. Of interest to students and scholars of politics and history at all levels, this volume explores seismic changes in the languages and expectations of politics accompanying political revolution, industrialisation and imperial expansion and less-noted continuities in political and social thinking.\n---------------------------\nBook Description II\nThis Cambridge History provides the first comprehensive survey of political thought in Europe, North America and Asia in the nineteenth century. Written by a distinguished team of international scholars, this is the latest in a sequence firmly established as the principal reference source for the history of political thought.\n---------------------------\nAbout the Author\nGareth Stedman Jones is Professor of Political Thought and Director of the Centre for History and Economics at the University of Cambridge. He is the Cambridge Faculty Director of the Ariane de Rothschild Fellows Program and a Member of the Conseil Scientifique of the CNRS. Professor Stedman Jones has published numerous books and articles, including Outcast London (1971), Languages of Class (1983) and An End to Poverty? (2005), and wrote the introduction to The Communist Manifesto (2003). He is currently working on an intellectual biography of Marx.\nGregory Claeys is Professor of the History of Political Thought at Royal Holloway, University of London. He has edited numerous works including Modern British Utopias. c.1700-1850 (8 volumes, 1997), Restoration and Augustan British Utopias (2000), Late Victorian Utopias (6 volumes, 2008), and The Cambridge Companion to Utopian Literature (2010). Claeys has written several studies of aspects of the Owenite socialist movement, of the French Revolution debate in Britain, and of Thomas Paine's thought.\n","torrent":{"xt":"urn:btih:ae82dbf1486dcad09d49eb48a5d216dfbb8be76e","amp;dn":"Gareth+Stedman+Jones+-+The+Cambridge+History+of+Nineteenth-Centu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae82dbf1486dcad09d49eb48a5d216dfbb8be76e","infoHashBuffer":{"type":"Buffer","data":[174,130,219,241,72,109,202,208,157,73,235,72,165,210,22,223,187,139,231,110]},"announce":[],"urlList":[]}}