{"title":"A Paradise of Reason by J. Rixey Ruffin (2007) [PDF]","uid":10544857,"size":1640291,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af11d7800cd0e2cde4312d482dcda873192059cf&amp;dn=A+Paradise+of+Reason+by+J.+Rixey+Ruffin+%282007%29+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1405273173,"description":"Title: A Paradise of Reason - William Bentley and Enlightenment Christianity in the Early Republic\nAuthor: J. Rixey Ruffin\nCategory: Academic/Religion\nSeries: Religion in America\nPublisher: Oxford University Press (November 26, 2007)\nLanguage: English\nISBN-10: 0195326512\nISBN-13: 978-0195326512\n\nPromotional info/Publisher's summary - &quot;William Bentley, pastor in Salem, Massachusetts from 1783 to his death in 1819, was unlike anyone else in America's founding generation, for he had come to unique conclusions about how best to maintain a traditional understanding of Christianity in a world ever changing by the forces of the Enlightenment.\n\nLike some of his contemporaries, Bentley preached a liberal Christianity, with its benevolent God and salvation through moral living, but he-and in New England he alone-also preached a rational Christianity, one that offered new and radical claims about the power of God and the attributes of Jesus. Drawing on over a thousand of Bentley's sermons, J. Rixey Ruffin traces the evolution of Bentley's theology. Neither liberal nor deist, Bentley was instead what Ruffin calls a &quot;Christian naturalist,&quot; a believer in the biblical God and in the essential Christian narrative but also in God's unwillingness to interfere in nature after the Resurrection. In adopting such a position, Bentley had pushed his faith as far as he could toward rationalism while still, he thought, calling it Christianity.\n\nBut this book is as much a social and political history of Salem in the early republic as it is an intellectual biography; it not only delineates Bentley's ideas, but perhaps more important, it unravels their social and political consequences. Using Bentley's remarkable diary and a vast archive of newspaper accounts, tax records, and electoral returns, Ruffin brings to life the sailors, widows, captains and merchants who lived with Bentley in the eastern parish of Salem.\n\nA Paradise of Reason is a study of the intellectual and tangible effects of rational religion in mercantile Salem, of theology and philosophy but also of ideology: of the social politics of race and class and gender, the ecclesiastical politics of establishment and dissent, the ideological politics of republicanism and classical liberalism, and the party politics of Federalism and Democratic-Republicanism. In bringing to light the fascinating life and thought of one of early New England's most interesting historical figures, Ruffin offers a fresh perspective on the formative negotiations between Christianity and the Enlightenment in the years of America's founding.&quot;\n\nReviews:\n&quot;A Paradise of Reason is far more than simply a book about a quirky eighteenth-century clergyman and his New England town. This impressive weave of social and intellectual history has deep insights about the complex relationships of Christianity, the Enlightenment, and the cultural politics of the early American republic.&quot; -Christopher Grasso, Associate Professor, Department of History, College of William and Mary\n\n&quot;The Reverend William Bentley of Salem was a towering figure in the early American republic, a voice of Jeffersonian liberalism in Federalist New England. He was also driven by a personal history of poverty, deprivation, and rejection. In this beautifully crafted synthesis of intellectual biography and community study, J. Rixey Ruffin restores this irascible loner to his rightful place in our understanding of the politics and theology of the American Enlightenment.&quot; -John L. Brooke, Ohio State University\n\nThis torrent contains a fully indexed, browse-able and searchable PDF copy of the book. The front cover image is also included. Please seed, and enjoy.\n\nPlease visit and support my Suprbay release thread here, I would appreciate it:       &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&lt;/a&gt;","torrent":{"xt":"urn:btih:af11d7800cd0e2cde4312d482dcda873192059cf","amp;dn":"A+Paradise+of+Reason+by+J.+Rixey+Ruffin+%282007%29+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af11d7800cd0e2cde4312d482dcda873192059cf","infoHashBuffer":{"type":"Buffer","data":[175,17,215,128,12,208,226,205,228,49,45,72,45,205,168,115,25,32,89,207]},"announce":[],"urlList":[]}}