{"title":"The Creation-Evolution Debate - Edward J. Larson","uid":11773144,"size":291889,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b059d7c93a51c6cb93eeaceaad72aae568236d97&amp;dn=The+Creation-Evolution+Debate+-+Edward+J.+Larson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427155672,"description":"From Ron Paul's reading list.\n\nFew issues besides evolution have so strained Americans' professed tradition of tolerance. Few historians besides Pulitzer Prize winner Edward J. Larson have so perceptively chronicled evolution's divisive presence on the American scene. This slim volume reviews the key aspects, current and historical, of the creation-evolution debate in the United States.\n\nLarson discusses such topics as the transatlantic response to Darwinism, the American controversy over teaching evolution in public schools, and the religious views of American scientists. He recalls the theological qualms about evolution held by some leading scientists of Darwin's time. He looks at the 2006 Dover, Pennsylvania, court decision on teaching Intelligent Design and other cases leading back to the landmark 1925 Scopes trial. Drawing on surveys that Larson conducted, he discusses attitudes of American scientists toward the existence of God and the afterlife.\n\nBy looking at the changing motivations and backgrounds of the stakeholders in the creation-evolution debate?clergy, scientists, lawmakers, educators, and others?Larson promotes a more nuanced view of the question than most of us have. This is no incidental benefit for Larson's readers; it is one of the book's driving purposes. If we cede the debate to those who would frame it simplistically rather than embrace its complexity, warns Larson, we will not advance beyond the naive regard of organized religion as the enemy of intellectual freedom or the equally myopic myth of the scientist as courageous loner willing to die for the truth.\n\nAbout the author:\nEdward J. Larson is a University Professor in history and holds the Hugh and Hazel Darling Chair in Law at Pepperdine University and retains a professorial appointment at the University of Georgia, where he has taught for twenty years. His many books include Summer for the Gods, winner of the 1998 Pulitzer Prize in History. Larson's articles have appeared in such publications as Nature, Atlantic Monthly, Scientific American, and the Wall Street Journal","torrent":{"xt":"urn:btih:b059d7c93a51c6cb93eeaceaad72aae568236d97","amp;dn":"The+Creation-Evolution+Debate+-+Edward+J.+Larson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b059d7c93a51c6cb93eeaceaad72aae568236d97","infoHashBuffer":{"type":"Buffer","data":[176,89,215,201,58,81,198,203,147,238,172,234,173,114,170,229,104,35,109,151]},"announce":[],"urlList":[]}}