{"title":"Clover Omibus Edition","uid":11836122,"size":285520387,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b077aba10345ef08561107e257918a45783eed51&amp;dn=Clover+Omibus+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":1,"time":1429743514,"description":"Clover Omnibus Edition\n\nDark Horse Manga, 2009, 504 pages\n\nWritten and Illustrated by CLAMP!\n\nKazuhiko is a young, but already deeply wounded black ops agent of a baroque, retro-tech future-pulled out of retirement to escort Sue, a mysterious waif, to a destination she alone knows. Sue and Kazuhiko have never met... yet she knows him, having grown up since the age of four with her only human contact two distant voices: that of her elderly &quot;grandma,&quot; General Ko, and of Kazuhiko's dead girlfriend, Ora. And Sue has been kept in that cage all these years because of what she is, and what the Clover Leaf Project found her to be - a military top secret, and the most dangerous person in the world.\n\n* Clover is a long-out-of-print classic from Japan's shojo artist supergroup CLAMP!\n\n* Never before available in its original Japanese right-to-left reading orientation, Dark Horse not only brings Clover into English for the first time, but also collects all four of the original volumes into one reasonably priced omnibus, with a brand-new cover design especially for this edition!\n\n* &quot;CLAMP manages to present a richly detailed retro-mechanical future using a minimum number of panels per page; reading this book is like looking into a dystopic future through one tiny, perfectly square frame, as the story unfolds across nearly blank pages scattered with repeating love song lyrics. The character designs are magnificent and tiny details on the clockwork birds and imaginative effects are stunning.&quot; -Publisher's Weekly","torrent":{"xt":"urn:btih:b077aba10345ef08561107e257918a45783eed51","amp;dn":"Clover+Omibus+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b077aba10345ef08561107e257918a45783eed51","infoHashBuffer":{"type":"Buffer","data":[176,119,171,161,3,69,239,8,86,17,7,226,87,145,138,69,120,62,237,81]},"announce":[],"urlList":[]}}