{"title":"Dave Matthews Band-Under the Table and Dreaming","uid":9328343,"size":153479014,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b0a042975d6e5d94d2be72a061f8c11d2094f8e9&amp;dn=Dave+Matthews+Band-Under+the+Table+and+Dreaming&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1386685026,"description":"Source: 1994 CD\n-\nDave Matthews Band-Under the Table and Dreaming 320cbr (Big Papi) 1994\n-\nBy Joe S\nI have heard all of the DMB albums, and I can say that &quot;Under the Table..&quot; is the best Dave Mathews CD by a hair. While every CD deserves awards and praise, &quot;Under the Table..&quot; has a sound which is just amazing, especially for their second release! Typical Situation is mesmerizing in the way that the melody develops. Ants Marching is simply amazing, and leaves you wanting more. This song pumps you up, and then Lover Lay Down will relax you and make you want a girl in your arms,(or guy, you know). #34 is so gentle and warm that you could fall asleep to it while mowing the lawn. And coming in at the most amazing song on this CD, or live, is Satelite. The sonic power of this song is over whelming, and when the base chord comes in for the first time on the first word of the song, you get goosebumps. If you want to up the ante, listen to Satelite live. The crowd literally goes insane when that recognizable guiter part begins. If you love the sound of a guiter, buy Dave Mathews. If you love symphonic music, Dave Mathews Band is in your alley. I have yet to hear a better combination of Folk, Jazz, Swing, and Easy Listening. Don't get me wrong. I am a hardcore Mettalica fan and I love hard rock. But Dave Mathews is simply the best written music out there. These are real musicians singing the music that they love. And this love of the music shows itself in the passion of their music, and is why their concerts are so incredibly awesome. For those who scold DMB for being &quot;popular&quot; music, they're popular because they're good! Go listen to your N'SYNC or Backstreet Boys. Dave Mathews will be around while all of them, and you, are filling up my yuppie gas tank! For every one else, its good to know that there are still good bands like Dave Mathews Band out there to irritate the losers. Buy it! Buy it! Buy it! You won't regret it, but you will soon be addicted to DMB music. What's wrong with that?","torrent":{"xt":"urn:btih:b0a042975d6e5d94d2be72a061f8c11d2094f8e9","amp;dn":"Dave+Matthews+Band-Under+the+Table+and+Dreaming","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0a042975d6e5d94d2be72a061f8c11d2094f8e9","infoHashBuffer":{"type":"Buffer","data":[176,160,66,151,93,110,93,148,210,190,114,160,97,248,193,29,32,148,248,233]},"announce":[],"urlList":[]}}