{"title":"Big Chief - Platinum Jive (1994)","uid":6850776,"size":391856248,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b0d316232fb609cf44d5cee5f0e5158a8fb72f8b&amp;dn=Big+Chief+-+Platinum+Jive+%281994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1322513331,"description":"Celebrating 30 years of existence -- of which five had yet to pass at the time of its release -- Platinum Jive mines for golden nuggets from critical picks and pans like 1969's Titty Twist Whitey, 1973's We Gotta Impeach Nixon, and the yet-to-be-released Disco Pete's Clam. It also selects tracks from the members' vanity projects, most notably lead singer Barry Henssler's straight-to-midline 1983 solo outing. (No doubt many urban youths apprehensively uttered its tacky rhyming title when asking for it at their local record mart). It's remarkable that the band could piece together a 30-year retrospective that plays quite fluidly from one track to the next -- although not quite as well as Mack Avenue Skullgame, which suspiciously lacks representation here. But seriously, Platinum Jive is only packaged as a greatest-hits compilation, which is quite a dicey/ballsy move for a band's major label debut. It's something of a step backward musically, because the band seems to resort back to its heavy rock roots, not further developing the funk and soul elements of Skullgame. It's not without its good moments, being more hit than miss and sufficiently enjoyable. If an actual Big Chief best-of sees the light of day, &quot;Lion's Mouth&quot; deserves a spot; surprisingly, it actually won the band some limited exposure on MTV. &quot;Takeover Baby,&quot; a good timey '70s wah-wah stomp, is nearly identical to Primal Scream's &quot;Rocks,&quot; released the same year. &quot;All Downhill From Here&quot; also breaks free from the general riff rock, being bluesier than usual and incorporating some snappy female background vocals on the chorus. A number of brief wild card instrumentals keep the flow going, including the Mo' Wax-like &quot;M.D. 20/20,&quot; which features some nifty ambient funk guitar from Mark Dancey.","torrent":{"xt":"urn:btih:b0d316232fb609cf44d5cee5f0e5158a8fb72f8b","amp;dn":"Big+Chief+-+Platinum+Jive+%281994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0d316232fb609cf44d5cee5f0e5158a8fb72f8b","infoHashBuffer":{"type":"Buffer","data":[176,211,22,35,47,182,9,207,68,213,206,229,240,229,21,138,143,183,47,139]},"announce":[],"urlList":[]}}