{"title":"NubileFilms - Kendall Kayden, Kimmy Granger (Three Way Fantasy)","uid":13030101,"size":300271568,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:b2d6e3ad88f19ac9dc5f27cf297645d96f85081f&amp;dn=NubileFilms+-+Kendall+Kayden%2C+Kimmy+Granger+%28Three+Way+Fantasy%29+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1450440476,"description":"Van Wylde knows that he is one lucky man when Kendall Kayden and Kimmy Granger strut up to him in full-on seduction mode. Their bras are easily removed as Van exchanges kisses with Kendall and then Kimmy. Once the girls are both topless, they sink to their knees in front of Van and go to work pulling out his dick for a shared double blowjob that only gets him hotter and hornier as they take turns deep throating him.Taking things to the bedroom, the girls have Van take a seat so that they can put on a show for him. After enjoying a searing kiss, Kimmy presses Kendall onto the bed so that she can rub her lover's clit over her panties thong. Loving what she finds, Kimmy peels Kendall's thong off and then settles in for a luxurious pussy licking that is augmented by two fingers pushed deep into Kendall's greedy twat.Although Van enjoys his voyeurism, he desperately wants to join in. Approaching the bed from behind Kimmy, he slides her thong down her legs and off so that he can take the lusty coed from behind. Getting her pussy pounded doesn't stop Kimmy from feasting on Kendall's snatch; if anything, Kimmy is even more enthusiastic about putting her talented mouth to work for her lover's pleasure.Switching things up, Kimmy adjusts her position so that she is seated atop Kendall's face with her pussy in the perfect position to be eaten out. That leaves Kendall's twat wide open for Van to press himself inside for his and Kendall's deep pleasure, and the takes full advantage with long thrusts of his hips...\r\nTags: Brunette, Blonde, Long hair, Lingerie, Hardcore, High Heels, Stockings, Girl-Girl-Boy, Blowjob, Deep Throat, Pussy Licking\r\n \nhttp://imgdone.com/viewer.php?file=04834475762828859496.jpg\r\n \nhttp://imgdone.com/viewer.php?file=53793762511625223046.jpg","torrent":{"xt":"urn:btih:b2d6e3ad88f19ac9dc5f27cf297645d96f85081f","amp;dn":"NubileFilms+-+Kendall+Kayden%2C+Kimmy+Granger+%28Three+Way+Fantasy%29+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2d6e3ad88f19ac9dc5f27cf297645d96f85081f","infoHashBuffer":{"type":"Buffer","data":[178,214,227,173,136,241,154,201,220,95,39,207,41,118,69,217,111,133,8,31]},"announce":[],"urlList":[]}}