{"title":"Practical Anarchy - Audiobook","uid":4803289,"size":131632737,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b35e2ebb9765997dafa44b283e66edb9ad470de9&amp;dn=Practical+Anarchy+-+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitrman","files":1,"time":1238111189,"description":"This is Practical Anarchy, an audiobook by Stefan Molyneux, also available at www.freedomainradio.com\n\nPowerful ideas for all lovers of personal and political freedom - Freedomain Radio is the largest and most popular philosophy show on the web, and was a Top 10 Finalist in the 2007 &amp; 2008 Podcast Awards. Topics range from politics to philosophy to psychology to economics to relationships to atheism - and how to achieve real freedom in your life today.\n\nPlease consider donating or becoming a subscriber at  &lt;a href=&quot;\nhttp://www.freedomainradio.com/donate.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freedomainradio.com/donate.html&lt;/a&gt;\n\n\nThe first book from this series is Everyday Anarchy, available at:\nhttp://thepiratebay.se/torrent/4179310/Everyday_Anarchy__by_Stefan_Molyneux\n\n---\nIntro:\nAny author who gives his work away faces the unique challenge of convincing people who have not invested their money in buying it that it is worth investing their time to read it.\n\nSamuel Johnson once wrote: &quot;No man but a blockhead ever wrote, except for money,&quot; which makes my task even harder, since either Mr. Johnson was a blockhead, or I am.\n\nI do think that there are some circumstances under which releasing a work for free does not necessarily imply that it is worth exactly what readers pay for it. Those proposing radical new approaches to age-old problems - the addition of new thought to the human canon - will not find it particularly easy to get people to pay good money for such mad claims. If I am writing a book on Christianity, then I can sell it to Christians; if I am writing a book on libertarianism, then I can sell it to libertarians; if I am writing a book on politics, I can sell it to the deluded...\n\nIf I am writing a book for the future, for a truly free society that is yet to be, who do I sell it to? I cannot even tell in particular detail what this new society might look like, or be able to achieve - save that I am sure that they have not yet found a way to send gold backward through time, and deposit it on my doorstep.\n\nAlthough improbable, it is not completely impossible that you might find something radical, thrilling and new in this book - despite its cover price. The best way to spread new ideas is to make them as available and accessible as possible, which is why I give everything away, and rely - not without reason - on the generosity of my readers and listeners.\n\nDespite our universal abhorrence, evils continue to plague the world, without respite. We fear and hate war, yet war continues. Our souls revolt against unjust imprisonment and torture, yet such injustices continue. We feel powerless in the face of endless tax increases - and with good reason. We feel agonizing compassion for those who are caught up in the endless bloody nets of tribal conflicts, condemned to mute horror and blank-eyed starvation. The plight of the enslaved weighs down our hearts with the rusty chains of useless sympathy. We would do almost anything to free the world from such monstrous evils - yet we feel so helpless! We all want a free and wonderful world, and yet feel utterly paralyzed before these monsters who commit such universal crimes...","torrent":{"xt":"urn:btih:b35e2ebb9765997dafa44b283e66edb9ad470de9","amp;dn":"Practical+Anarchy+-+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b35e2ebb9765997dafa44b283e66edb9ad470de9","infoHashBuffer":{"type":"Buffer","data":[179,94,46,187,151,101,153,125,175,164,75,40,62,102,237,185,173,71,13,233]},"announce":[],"urlList":[]}}