{"title":"Tarentine Horseman of Magna Graecia: 430-190 BC","uid":11735254,"size":26902132,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b36ba95df113902234dd7c85e4b3701022f4b8a4&amp;dn=Tarentine+Horseman+of+Magna+Graecia%3A+430-190+BC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425544649,"description":"Osprey's study of the Tarentine horsemen from 430 to 190 BC. The Taras were the leading power of the scattered Greek states of southern Italy and built their reputation on the unmatched horse warriors who helped the Taras claim and maintain their power. These horsemen, who excelled in valor and wealth not only served on their home soil, but were in great demand abroad and were often exported as mercenaries. In this book, expert author Nic Fields examines the Taras horsemen in detail, using rare artifacts and contemporary sources to create an account which reveals the day to day lives of these warriors together with their experiences in battle.\n\nFields discusses the Taras tactics, weapons and equipment, detailing how they bred the horses that were so essential to their success. He goes on to reveal how their prowess extended to beyond the battlefield in the arena of tribal games. With a wealth of contemporary sources and rare artifacts illustrated with specially commissioned color artwork and rare photographs, this is an intriguing insight into the everyday lives of these horsemen and reveals how they acquired the skills that made them so crucial to the Taras' fate","torrent":{"xt":"urn:btih:b36ba95df113902234dd7c85e4b3701022f4b8a4","amp;dn":"Tarentine+Horseman+of+Magna+Graecia%3A+430-190+BC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b36ba95df113902234dd7c85e4b3701022f4b8a4","infoHashBuffer":{"type":"Buffer","data":[179,107,169,93,241,19,144,34,52,221,124,133,228,179,112,16,34,244,184,164]},"announce":[],"urlList":[]}}