{"title":"Gradius Rebirth WiiWare NTSCJ","uid":4417492,"size":25906904,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:b3f1d571d2c2c0750f3c66680d63d2e8cdf20953&amp;dn=Gradius+Rebirth+WiiWare+NTSCJ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"braschlosan","files":1,"time":1222602314,"description":"Japanese version of Gradius Rebirth Wiiware for Nintendo Wii. Plays fine on US consoles. Requires 3.2 system and some type of WAD installer obviously.\n\nGradius ReBirth is a side-scrolling 2D shooter much like previous Gradius games, and has been described as a &quot;remix&quot; of levels from past games rather than an entirely new game.\n\nThe game features two modes: a standard game with unlimited credits and a Score Attack mode where players are only given a single credit to beat the game. Score Attack also supports online leaderboards.\n\nThere are 5 different types of ships to choose from. There are five stages total, each (excluding stage one) having its own original boss at the end. The double weapon does not seem to improve coverage when upgraded to the 2nd level as in Gradius Gaiden where upgrading Vic Viper&amp;#039;s Double weapon adds a tailgun in addition to the diagonal gun. Instead, the rate of fire, speed, and power is improved.\n\nGraphically, Gradius ReBirth follows the style of Gradius Gaiden while improving on multiple graphics and is visually impressive considering the use of sprites only. Vic Viper&amp;#039;s model has been slightly changed along with the Big Core boss model. The power meter and text display has also been updated.\n\nThe music is composed of Gradius II/III ARC-styled remixes of tunes from previous Gradius games such as Gradius II NES, Gradius 2 MSX, Gradius I ARC, Gradius I MSX, and Ambition of Gofer.","torrent":{"xt":"urn:btih:b3f1d571d2c2c0750f3c66680d63d2e8cdf20953","amp;dn":"Gradius+Rebirth+WiiWare+NTSCJ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3f1d571d2c2c0750f3c66680d63d2e8cdf20953","infoHashBuffer":{"type":"Buffer","data":[179,241,213,113,210,194,192,117,15,60,102,104,13,99,210,232,205,242,9,83]},"announce":[],"urlList":[]}}