{"title":"MIND BOMB - Mind Bomb (1993) (192kbs) [Industrial Rock]","uid":3612375,"size":65467969,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b42c2a44817c5c33963f49c1543df6a375571767&amp;dn=MIND+BOMB+-+Mind+Bomb+%281993%29+%28192kbs%29+%5BIndustrial+Rock%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"made-of-technetium","files":11,"time":1170782715,"description":"Product Details from Amazon.com\n    * Original Release Date: 1993\n    * Average Customer Review: *****\n\nSpotlight Reviews\nIncredible guitar-oriented techno metal, July 27, 2004\nReviewer:\tMusic Fanatic (Bettendorf, IA United States)\nThis cd uses some machines and samples, giving it somewhat of a techno flavor, but it is 100% rock played with real instruments. Every song has great heavy riffs and excellent lead guitar work. The rhythms are not repetitive at all like most industrial/techno music and add a lot to every song. And the vocals are done by a real singer as well, rarely resorting to the standard fuzzed out screaming that is so common in the genre. The songs vary a lot, and they are all very good: full-out fast rockers (&quot;Prepare Yourself!&quot;), grinding metal (&quot;Segue&quot;), funky guitar epics (&quot;Do You Need Some?&quot;), atmospheric ballads (&quot;Almost There&quot;), and everything in between. This is a metal album that has a sound like no other--superbly executed by a very talented band. I would rank this as one of the two best albums of the genre, along with Shotgun Messiah&amp;#039;s &quot;Violent New Breed.&quot; If you enjoy metal guitar with a few curves in the songs, you should pay any price to get this cd.\n\nAbsolutely the best album in my collection, September 9, 2004\nReviewer:\tJeffrey S. Walsh (Milwaukee, WI United States)\nI own a few thousand cds spanning mostly rock, pop, and metal from the 70s to the present. This is the best one... no lie. I love this album. I loved it from when I first got it after seeing the equally awesome &quot;Do You Need Some&quot; video. There is quite a diversity within the album (song to song) and even within the songs on the album, and yet, the entire time, its a hard rocking metal release! You get infusions of techno, punk, pop, funk, folk... its almost like a summation of all melodic music wrapped up in a metal base. The musicianship is great and the production equals absolutely the best I have heard. The music and song structures are not bound by traditional verse chorus verse chorus solo chorus structuring (though not afraid to use it when it works)... there are interesting breakdowns within songs musically... there are synth horns in spots. BUT... dont let any of this scare you... this is blistering when put at max volume. The vocals are great... the guitars are hard and fast when called for and light and emotional when appropriate as well. But, again, all the while the focus is on great quality songs and being very melodic. This album is definitely sonic ear candy! Goodbye Everything is a haunting, emotional, light album closing number that I used to use as a college DJ to end every show... Prepare Yourself is hard drivingly brutal and yet catchy as all heck... and my favorite, Violet Dream, is among the most crankable songs I know... its great background noise for cruising FAST down the highway! But, all songs are top notch... there is not a filler song on the disc! I think Matt Mercado is the greatest songwriter out there, its just a shame he is not well enough known for many others to come to the same conclusion. I also recommend looking up what he has been doing since. Mind Bomb was ahead of its time and didnt get the credit it was due... and Matt is blazing that same trail now with his new band Supermercado -- which is like Mind Bomb on steriods! If not for grunge and alternative... Mind Bomb likely would have been the next big thing in metal and its a real shame we only got the one release. If you try this and love it, definitely see what came after this at Matt Mercado daught comma.\n\nMind Bomb does just that!!! , May 12, 2005\nReviewer:\tAlex Pereida &quot;CrimsonThorns&quot; (San Antonio, TX.)\nI have such a huge cd collection and I recently went back to listen to some cds I had not given some play in sometime. I cranked up Mind Bomb in the new system and this freakin&amp;#039; cd is so full of great guitar riffs, keyboards, and awesome vox&amp;#039;s. It is so unfortunate that it did not get the respected air play in its time. I saw in them &quot;live&quot; here in San Antonio when they opened up for Robhalford&amp;#039;s &quot;Fight&quot; project, and they kicked some ass. I recommend this cd. GET IT!!!!!! if you can find.\n\n80&amp;#039;s and 90&amp;#039;s Metal Head&amp;#039;s will love this cd ! ! !, May 4, 2005\nReviewer:\toffplanetbeing (Planet Earth)\nI was just jammin to this cd in my car and it STILL kicks butt, especially when turned up really loud! The vocals, guitar, and song writing have some awsome talent that still packs a punch to this very day. The other reviews were correct. There&amp;#039;s a classic ballad type song, a techno type song, and a bunch of kick A** guitar driven songs ! If your into late 80&amp;#039;s / 90&amp;#039;s metal, by all means grab this cd ! As I write this review now there is quite a few used CD&amp;#039;s available for friggin&amp;#039; 1 CENT !!!! Can&amp;#039;t beat that for an AWSOME out-of-print kick A** CD ! ! !\n\nDo you need some? Yes!, September 22, 2003\nReviewer:\t&quot;videot_27&quot; (Skokie, IL USA)\nChicago rock/industrial band fronted by local producer/musician Matt Mercado. For quite awhile after this record was released, you couldn&amp;#039;t walk into a Chicago-area record store without hearing it blasting from every speaker. I have it in rotation on my CD changer to this day. The band is somewhat back together now - 10 years after the initial release of the album, which is, IMHO, a prime example of Mercado&amp;#039;s production skills. Solid stuff. I don&amp;#039;t know Ministry but I&amp;#039;ve heard Mind Bomb favorably compared to them. (Melodic heavy rock with a lot of samples and sounds integral to the music.) I believe Mercado is much like Trent Reznor in that he crafts most of his music himself then assembles a band around it. Thus I think he finds it hard to get a band that can reliably reproduce on-stage what Mercado himself created in his own head and on record. Still, if you can get a copy of this album, do so... and keep an eye out for the &quot;Do You Need Some&quot; video which is one of the best videos eMpTyVee never showed.","torrent":{"xt":"urn:btih:b42c2a44817c5c33963f49c1543df6a375571767","amp;dn":"MIND+BOMB+-+Mind+Bomb+%281993%29+%28192kbs%29+%5BIndustrial+Rock%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b42c2a44817c5c33963f49c1543df6a375571767","infoHashBuffer":{"type":"Buffer","data":[180,44,42,68,129,124,92,51,150,63,73,193,84,61,246,163,117,87,23,103]},"announce":[],"urlList":[]}}