{"title":"The Iguanas - Plastic Silver 9 Volt Heart [2003][EAC,log,cue. FL","uid":8508883,"size":367895634,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b4cee19abe4e491a51c3d3f05d2a25273e3a55c6&amp;dn=The+Iguanas+-+Plastic+Silver+9+Volt+Heart+%5B2003%5D%5BEAC%2Clog%2Ccue.+FL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":17,"time":1369508526,"description":"Artist: The Iguanas\nRelease: Plastic Silver 9 Volt Heart\nReleased: 2003\nLabel: Yep Roc\nCatalog#: YEP-2038 \nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: americana.rock\n\n01 Yesterday\n02 Machete y Maiz\n03 Mexican Candy\n04 Flame On\n05 9 Volt Heart\n06 Sugar Cane\n07 Zacatecas\n08 The First Kiss is Free\n09 I Dig You\n10 The Liquor Dance\n11 Abandonado\n12 Un Avio\n13 Goodbye Again\n14 Untitled\n\nOn their fifth album since 1993, New Orleans' Iguanas swing even closer to the Latin/Mexican Los Lobos sound they have referenced previously. The more prominent yet still bubbling-under percussion and a low-boil, near ominous feel on tracks like &quot;Mexican Candy&quot; can easily be mistaken for East L.A.'s Lobos. This album could be the Iguanas' Kiko, with the band's two saxes wrapping around these tracks and enveloping them with a smoldering yet smooth R&amp;B flavor. Although there are a few upbeat rockers like &quot;Zacatecas&quot; and &quot;I Dig You,&quot; the disc exudes a more meditative and layered vibe. The title track, &quot;9 Volt Heart,&quot; co-written with fan/friend Dave Alvin, is a lovely ballad, similar to Alvin's &quot;Border Radio,&quot; about the titular transistor radio and its part in the formative years of the singer. Arguably the album's best tune, it's their &quot;Night Moves,&quot; a defining coming-of-age tale that encompasses most of the band's strengths in less than four minutes. The same holds for &quot;The First Kiss Is Free,&quot; a seven-minute tour de force whose warm rootsy approach and near cinematic lyrics will have listeners returning to the tune to bask in its floating, pulsating glow and lovely Santana-styled guitar solo. Rod Hodges' vocals are warm, soulful, conversational, and believable, while the group's performance is the most affecting and mature of its career. The subtle production provides a burnished glow perfect for the band's simmering, often swampy groove. There are simply no weak tracks, and even though they aren't rocking out as forcefully as before, this is a striking album that catches a polished band gracefully and stylishly shifting into middle age.","torrent":{"xt":"urn:btih:b4cee19abe4e491a51c3d3f05d2a25273e3a55c6","amp;dn":"The+Iguanas+-+Plastic+Silver+9+Volt+Heart+%5B2003%5D%5BEAC%2Clog%2Ccue.+FL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4cee19abe4e491a51c3d3f05d2a25273e3a55c6","infoHashBuffer":{"type":"Buffer","data":[180,206,225,154,190,78,73,26,81,195,211,240,93,42,37,39,62,58,85,198]},"announce":[],"urlList":[]}}