{"title":"Madden NFL 2006 [3CDs][English]","uid":3373529,"size":2227884135,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b4d13426acc153070b84f8046181ee2d9c86d232&amp;dn=Madden+NFL+2006+%5B3CDs%5D%5BEnglish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pctorrent","files":10,"time":1124757313,"description":"Por primera ves en una decada, la franquicia Madden NFL Football ha cambiado su manera de pasar el balon - dando a Madden NFL 2006 la ofensiva mas innovadora jamas vista! La nueva vision de Quarterback te permite ver todo el estadio, ver a los defensas, y tirar pases perfectos a tu receptor preferido. Podras cambiar las jugadas y las rutas para poder tener mas yardas. Ahora podras jugar el nuevo NFL Superstar, donde seras un jugadore colegial subiendo hasta el tope de la NFL con agentes, calendarios y mucho mas! Deja atras a la defensa y conviertete en una leyenda de la NFL con Madden NFL 2006, el unico juego autorizado al 100% por la NFL! \n\n----------------------------------------------------------------------------------\n\nFor the first time in 10 years, the Madden NFL Football franchise\nhas revolutionized its passing game - giving Madden NFL 06 the \nmost groundbreaking and innovative offensive arsenal ever created. \nThe new QB Vision Control lets you scan the field, look off \ndefenders, and extend perfect throws within your unique field of \nvision. Formation-specific audibles and smart routes that allow \nreceivers to extend their patterns to pick up crucial yardage have \nalso been added to beef up the passing attack. Now you can play \nthe game in a whole new way in NFL Superstar mode by guiding an \nup-and-coming collegiate All-Star to an NFL All-Pro - complete with \nendorsements, agents, and more. Pick apart defenses and become an \nNFL experience.","torrent":{"xt":"urn:btih:b4d13426acc153070b84f8046181ee2d9c86d232","amp;dn":"Madden+NFL+2006+%5B3CDs%5D%5BEnglish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4d13426acc153070b84f8046181ee2d9c86d232","infoHashBuffer":{"type":"Buffer","data":[180,209,52,38,172,193,83,7,11,132,248,4,97,129,238,45,156,134,210,50]},"announce":[],"urlList":[]}}