{"title":"Ben Kane Complete Collection (Epub/Mobi)","uid":9371608,"size":15689821,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b505d9aabbda7d818529a6a740f3f38eca8be3d8&amp;dn=Ben+Kane+Complete+Collection+%28Epub%2FMobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"7","files":15,"time":1387538275,"description":"Pack Contains 3 series:\n1. Forgotten Legion chronicles\n\na. The Forgotten Legion - Romulus and Fabiola are twins, born into slavery, and then later sold: Romulus to gladiator school, and Fabiola into prostitution, where she will catch the eye of one of the most powerful men in Rome.\nTarquinius is an Etruscan, a warrior, born enemy of Rome and trained by the last haruspex in the forgotten arts of divination. A runaway slave, then an AWOL Legionaire, he has a long foretold destiny that will take him to the ends of the known world.\nBrennus is a Gaul who lost his entire clain in a battle against the Roman Army.  After being sold as a slave he rises to bcome one of the most famous and feared gladiators of his day.\nThe lives of these four are interwoven in story that ranges from a Rome riven by corruption, violence and political enmities to ends of the empire, where Romulus, Brennus and Tarquinius find themselves fighting against the Parthians and overwhelming odds - members of The Forgotten Legion.\n\nb. The Silver Eagle - They fought against almighty odds at the very edge of the known world ? and lost. Ten thousand legionaries are all that are left of a once powerful Roman army.\n\nIn the first century B.C., trapped in Parthia by Crassus's failed invasion, the legionaries that survived are captured and marched to the edge of the known world. Abandoned by Rome, these men are the Forgotten Legion. Among them are three friends, Brennus the Gaul, Tarquinun the Etruscan soothsayer and Romulus, a runaway slave and the bastard son of a Roman nobleman.  All men with troubled pasts and united in their hatred of Rome, they never stop dreaming of Freedom. Together they must face the savage tribes that surround them as well as the more treacherous enemies within the ranks of the legion itself. Their character will be tested to the utter limit as they struggle to find a way back to Rome. Meanwhile, Fabiola, Romulus' twin sister, tries to maintain hope of her brother's survival while fighting for her own. Freed by her powerful lover but beset by enemies on all sides, she must travel to Gaul to find her lover, the right-hand man of Julius Caesar.  But in Gaul, her lover is fighting for his very life against Vercingetorix, whose rampaging army threatens to destroy all who rally around Caesar.\nTogether these characters, whose lives are intertwined and their stories interwoven, bring to life an truly epic story of the late Roman Republic and the ancient world in which it thrived.\n\nc.The Road to Rome - In 48 B.C., having survived a disastrous campaign in Pythia as part of the Forgotten Legion and spent years fighting their way back to Rome, Romulus and Tarquinius have finally made it as far as Alexandria. On arrival, though, they find themselves in the midst of the Roman Civil War, are press-ganged into Caesar?s thinning legions and greatly outnumbered and fighting for their lives against the Egyptian army. Meanwhile in Rome, Romulus? twin sister Fabiola, having caught only a glimpse of her long-missing twin before being forced to flee Egypt for Rome, lives in fear for her life, loved by Brutus, but wooed by Marcus Antonius, his deadly enemy.\nFrom the battlefields of Asia Minor and North Africa, to the lawless streets of Rome and the gladiator arena, they all face death and danger daily, until 44 B.C. when their individual roads all lead them to Rome where the future of the republic lies unexpectedly in their hands.\n\n2. Hannibal Series  -\n\na.The Patrol-\nWINTER 218 BC, In Cisalpine Gaul, a Carthaginian patrol is moving stealthily through thick woodland. It's led by Hanno, one of Hannibal's young officers, and his second-in-command Mutt. Famished and cold, they are making for a town full of the grain that they desperately need.But the local Gauls cannot be trusted; and although defeated, the Romans still have patrols in the area.With peril on every side and a deadly ambush ahead, there is no certainty that either Hanno or Mutt will survive .\n\nb.Fields of Blood -Hannibal's campaign to defeat Rome continues as he marches south to confront his enemy.With him is a young soldier, Hanno. Like his general, Hanno burns to vanquish Rome. Never has the possibility seemed so likely.But a stealthy game of cat and mouse is being played as Rome's generals seek to avoid confrontation.\nEventually the two armies meet under a fierce summer sun. The place is Cannae - the fields of blood.\nThe battle will go down in history as one of the bloodiest ever fought, a battle in which Hanno knows he must fight as never before - just to stay alive.\n\nc.Enemy of Rome- The great Carthaginian general, Hannibal, has never forgotten the defeat and humiliation of his father by Rome. Now he plans his revenge and the destruction of the old enemy.While Hannibal prepares for war, the young son of one of his most trusted military commanders goes on an innocent adventure with his best friend - and disappears.Captured by pirates, put up for sale in the slave market, one of the boys is sold as a gladiator, the other as a field slave. They believe they will never see home or family again.But their destiny - interwoven and linked with that of their Roman masters - is to be an extraordinary one. The devastating war unleashed upon Rome by Hannibal will last for nearly twenty years. It will change their lives - and history - forever.\n\n3.Spartacus Series-\n\na.The Gladiator- Long the stuff of legends, Spartacus is known to most modern readers through the classic Kubrick film version of Howard Fast?s novel. Now bestselling historical novelist Ben Kane returns to the source material and presents a lively and compelling new vision of the man who was Spartacus?Roman army auxillary, slave, gladiator and ultimately the leader of an army of slaves who nearly brought Rome to its knees. Ben Kane?s brilliant novel begins in the Thracian village to which Spartacus has returned after escaping from life as an auxiliary in the Roman army. Jealous of his attachment to Ariadne, a Dionysian priestess, the Thracian king betrays Spartacus to the Romans who take him, along with Ariadne, into captivity and to the school of gladiators at Capua. Against the background of the unbelievable brutality of gladiatorial life, Spartacus and Crixus the Gaul plan the audacious overthrow of their Roman masters. They escape and flee to Vesuvius, where they recruit and train an army of escaped slaves that will have to face the conquerors of the known world, the most successful deadly army in all of history in a battle that will set in motion the legend that is Spartacus.\n\nb. Rebellion - On the plain of the River Po, in modern Northern Italy, Spartacus has defeated Gaius Cassius Longinus, proconsul and general of an army of two legions. Now the road home lies before them?to Thrace for Spartacus, and to Gaul for his seconds-in-command, Castus and Gannicus. But storm clouds are gathering on the horizon. One of Spartacus's most powerful generals has defected, taking his men with him. Back in Rome, the immensely rich Marcus Licinius Crassus is gathering an unheard-of Army. The Senate has given Crassus an army made up of ten legions and the authority to do whatever it takes to end the slave rebellion once and for all. Meanwhile, Spartacus wants to lead his men over the Alps and home, but his two seconds have a different plan. They want to march on Rome itself and bring the Republic to its knees. Rebellion has become war. War to the death.","torrent":{"xt":"urn:btih:b505d9aabbda7d818529a6a740f3f38eca8be3d8","amp;dn":"Ben+Kane+Complete+Collection+%28Epub%2FMobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b505d9aabbda7d818529a6a740f3f38eca8be3d8","infoHashBuffer":{"type":"Buffer","data":[181,5,217,170,187,218,125,129,133,41,166,167,64,243,243,142,202,139,227,216]},"announce":[],"urlList":[]}}