{"title":"[Android] Kids Memory game","uid":9675479,"size":4858187,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:b561f6b54d1633f8377c9b967d0b0255539d749e&amp;dn=%5BAndroid%5D+Kids+Memory+game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pavle993","files":1,"time":1393553250,"description":"Link to game: https://play.google.com/store/apps/details?id=com.radoman.memorygame\n\nDescription:\n\nDo you want to enhance your kids' memory? Then Memory Games for Kids is the perfect app. The app has loads of memory games which kids will love playing. at the same time, the games will improve their memory and also enable them to learn new words.\nThe app is perfect for kids in the age group 4-10.\nHow the game is played?\nIt's free to download and try out. A person has to memorize the positions of cards shown briefly and then tap on each correct pair in the least number of moves.\nWhy will kids love this app?\n* The challenge to solve memory games in the least number of moves possible.\n* Kids would love to compete against their parents, siblings or friends to see who completes faster.\n* Colorful, cute and captivating images make playing the game all the more interesting.\n* The animated background underwater theme with fishes swimming around is pleasing to the eyes. \n* Loads of words to make the games fun every time.\n* 3 levels of difficulty - Easy, Normal, Hard with option to save top rankers in each level.\nWhy parents will love this app?\n* Kids will sharpen their brain playing memory games.\n* Kids will learn new words and also how to pronounce them.\n* They will learn to identify different objects from their images.\n* All words are spoken aloud so that the child can learn speaking them too.\n* Fun with education at the same time.\n* The parents could spend quality parent-child time together with this app.\nCategories:\nFood, Fruit, Sport and Halloween. (More to come)\n","torrent":{"xt":"urn:btih:b561f6b54d1633f8377c9b967d0b0255539d749e","amp;dn":"%5BAndroid%5D+Kids+Memory+game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b561f6b54d1633f8377c9b967d0b0255539d749e","infoHashBuffer":{"type":"Buffer","data":[181,97,246,181,77,22,51,248,55,124,155,150,125,11,2,85,83,157,116,158]},"announce":[],"urlList":[]}}