{"title":"Jackyl - The Lumberjack  (2nafish)","uid":5412313,"size":135903236,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b57bc8e561b39478c60c5c02f7edd8607b39fee1&amp;dn=Jackyl+-+The+Lumberjack++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1267749240,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nJackyl is an American rock band formed in 1990. Their sound has been described as hard rock, heavy metal, Southern metal and glam metal.\n\nThe band is probably best-known for its songs &quot;Down On Me&quot;, and &quot;The Lumberjack,&quot; which features a chainsaw solo by lead singer Jesse James Dupree. Dupree would rev the chainsaw's engine or use the chain brake to slow the engine down to keep the beat. He would also perform this stunt live and the number would climax with Dupree slicing up a wooden stool onstage, smashing it, and throwing the sliced pieces out to the crowd. He once had been asked, &quot;How the hell can you play a chainsaw?&quot; to which he responded, &quot;How the hell can you not play a chainsaw?&quot;\n\nJackyl is the 1992 debut album by the band of the same name.\n\nIn 1992, Jackyl's self-titled debut album was released under Geffen Records and eventually went platinum. It features a song entitled &quot;She Loves My C***,&quot; which was omitted from edited versions as were suggestive elements on the album's cover art. When a K-Mart in Georgia refused to sell Jackyl, the band played an impromptu concert in front of the store. Footage of the event was used for the music video of their single &quot;I Stand Alone.&quot;\n\nA sophomore album would develop in 1994's Push Comes to Shove. That year, the band appeared at Woodstock '94 in Saugerties, New York.\n\nJackyl released Cut the Crap in 1997. Its hit song &quot;Locked and Loaded&quot; featured guest vocals from AC/DC's Brian Johnson. Johnson would also team up with the band for their 2002 album Relentless.\n\nThe band's first greatest hits album arrived in 1998's Choice Cuts. Later that year, Stayin' Alive hit store shelves. However, while recognized as Jackyl's fourth studio album, of the eleven tracks, the album features three cover songs and three live versions of previously released songs.\n\nIn 2000, lead singer Jesse James Dupree recorded a solo album entitled Foot Fetish.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:b57bc8e561b39478c60c5c02f7edd8607b39fee1","amp;dn":"Jackyl+-+The+Lumberjack++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b57bc8e561b39478c60c5c02f7edd8607b39fee1","infoHashBuffer":{"type":"Buffer","data":[181,123,200,229,97,179,148,120,198,12,92,2,247,237,216,96,123,57,254,225]},"announce":[],"urlList":[]}}