{"title":"JT 03.THE MAGDALEN MARTYRS.Ken Bruen.mb4","uid":8780250,"size":149641076,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b61efe49782644e649755989010118118e8ed963&amp;dn=JT+03.THE+MAGDALEN+MARTYRS.Ken+Bruen.mb4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":1,"time":1375694315,"description":"Jack Taylor, traumatised, bitter and hurting from his last case, has resolved to give up the finding business. However, he owes the local hard man a debt of honour and it appears easy enough: find &quot;the Angel of the Magdalen&quot; - a woman who helped the unfortunates incarcerated in the infamous laundry.\n\nHe is also hired by a whizz kid to prove that his father's death was no accident. Jack treats both cases as relatively simple affairs. He becomes involved with a woman who might literally be the death of him, runs dangerously foul of the cops and unearths a story that will drag his sanity to its limits. A policewoman who tests his tolerance may hold the key to both cases, and if he can suppress his contempt for her he may survive. He is finally clean and sober but the unfolding events will not only shake his sobriety but bring him as close to death as he could ever have imagined. As in The Guards and The Killing of the Tinkers, the City of Galway berates, cajoles, torments and enchants him at every confused step he takes. He is about to discover the true meaning of martyrdom, and the awful legacy of suicide will finally be bequeathed to him. ","torrent":{"xt":"urn:btih:b61efe49782644e649755989010118118e8ed963","amp;dn":"JT+03.THE+MAGDALEN+MARTYRS.Ken+Bruen.mb4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b61efe49782644e649755989010118118e8ed963","infoHashBuffer":{"type":"Buffer","data":[182,30,254,73,120,38,68,230,73,117,89,137,1,1,24,17,142,142,217,99]},"announce":[],"urlList":[]}}