{"title":"Ancient Armies of Greece","uid":8854491,"size":181122109,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b65f669c44e138fe1cd4916dd025166a292b047b&amp;dn=Ancient+Armies+of+Greece&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"remyremix","files":10,"time":1377617190,"description":"At least in the Archaic Period, the fragmentary nature of Ancient Greece, with many competing city-states, increased the frequency of conflict, but conversely limited the scale of warfare. Unable to maintain professional armies, the city-states relied on their own citizens to fight. This inevitably reduced the potential duration of campaigns, as citizens would need to return to the own professions (especially in the case of farmers). Campaigns would therefore often be restricted to summer. Armies marched directly to their target, possibly agreed on by the protagonists.\nIf battle was refused by one side, they would retreat to the city, in which case the attackers generally had to content themselves with ravaging the countryside around, since siegecraft was undeveloped.[citation needed] When battles occurred, they were usually set piece and intended to be decisive. The battlefield would be flat and open, reducing the possibilities for complex tactical maneuvers. These battles were short, bloody, and brutal, and thus required a high degree of discipline. At least in the early classical period, other troops were less important; (cavalry) generally protected the flanks, when present at all; and both light infantry and missile troops were negligible","torrent":{"xt":"urn:btih:b65f669c44e138fe1cd4916dd025166a292b047b","amp;dn":"Ancient+Armies+of+Greece","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b65f669c44e138fe1cd4916dd025166a292b047b","infoHashBuffer":{"type":"Buffer","data":[182,95,102,156,68,225,56,254,28,212,145,109,208,37,22,106,41,43,4,123]},"announce":[],"urlList":[]}}