{"title":"Predator.2_-_Predador.2.A.CaÃƒÂ§ada.Continua(1990)","uid":4541658,"size":1563350417,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b70c30e9a7e644fe20cee56cf9d734b64806a03e&amp;dn=Predator.2_-_Predador.2.A.Ca%C3%83%C2%A7ada.Continua%281990%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"maike_spjp","files":1,"time":1227968460,"description":"Please share and comment. \nThe continuity of peer-to-peer depends on you. \nVisit http://www.finalshare.net\n\nEnglish\n-------\nThis special effects-heavy science fiction sequel moves the action from the first film&amp;#039;s Amazon forest to the urban jungle of L.A. Danny Glover stars as Lt. Mike Harrigan, an LAPD detective baffled by his latest case, the ritualistic slaughter of several drug dealers by a devastating killer who leaves no traces. As Harrigan and his partners, Danny Archuletta (Ruben Blades), Leona Cantrell (Maria Conchita Alonso), and Jerry Lambert (Bill Paxton), try to figure out who or what killed the criminals, FBI investigator Stephen Keyes (Gary Busey) attempts to warn the team away from investigating further. When two of his team are killed in a particularly grisly way, Harrigan uncovers the truth -- their quarry is an alien creature that hunts humans for sport. Attracted to violence, its latest choice of prey is gun-toting Jamaican drug dealers. Keyes and his team know all about the nasty extraterrestrial and its bloody pastime because they&amp;#039;ve been studying it for ten years, and they&amp;#039;ve come up with a possible means of dispatching the beast. When that plan backfires, however, it comes down to Harrigan and an extremely irritated otherworldly foe, slugging it out in a rooftop confrontation.\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nPortuguÃƒÂªs\n---------\nLos Angeles, 1997. Em meio a um imenso tiroteio nas ruas entre traficantes colombianos e a polÃƒÂ­cia, Mike Harrigan (Danny Glover), um destemido policial que quer impor a ordem nas ruas, planeja formar um grupo com tiras de diferentes etnias, para combater o crime. Apesar da burocracia dos seus superiores, seus problemas pioram ainda mais quando os integrantes das quadrilhas passam a ser brutalmente assassinados por um ser de outro planeta, que tem o poder de ficar invisÃƒÂ­vel. Mas as coisas realmente pioram quando a criatura escolhe Harrigan como seu principal alvo.\n","torrent":{"xt":"urn:btih:b70c30e9a7e644fe20cee56cf9d734b64806a03e","amp;dn":"Predator.2_-_Predador.2.A.Ca%C3%83%C2%A7ada.Continua%281990%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b70c30e9a7e644fe20cee56cf9d734b64806a03e","infoHashBuffer":{"type":"Buffer","data":[183,12,48,233,167,230,68,254,32,206,229,108,249,215,52,182,72,6,160,62]},"announce":[],"urlList":[]}}