{"title":"To Catch a Bad Guy - Marie Astor {2bUnique}","uid":9901021,"size":311025,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b7b4170c648fa980e1e680de758574f55e21caaa&amp;dn=To+Catch+a+Bad+Guy+-+Marie+Astor+%7B2bUnique%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2bUnique","files":1,"time":1396768751,"description":"Book Description\nPublication Date: November 27, 2013\nFrom New York Times and USA Today Bestselling Author!\n\nJanet Maple's stellar career ended with a layoff and her boyfriend of almost five years told her that he wants to be just friends. When she lands a job at one of New York's premier boutique investment firms, Janet begins to hope that her luck is finally turning for the better. Not only is she happy with her new paycheck, but things also seem to be looking up on the personal front, as the company's handsome attorney expresses keen interest in Janet. However, her euphoria is short-lived, as Janet soon discovers alarming facts about her new employer's business tactics. When her boss dismisses her suspicions as groundless, Janet finds herself confiding to a cute IT engineer, Dean Snider. The closer she gets to Dean, the more Janet is tempted to break her rule of not dating co-workers, but what she doesn't realize is that everything she knows about Dean, including his occupation and even his name, is a lie.\n\nDennis Walker is a top-notch white collar crime investigator who will stop at nothing to put culprits away. When an opportunity for an undercover assignment at one of New York's premier boutique broker dealers comes up, Dennis jumps at the chance, adopting a persona of geeky IT engineer, Dean Snider. While he may be an ace at his job, years of experience fail him when Dennis meets Janet Maple and finds himself torn between his professional obligations and his personal desires. Will he have to choose between his feelings and duty, or will he find a way to satisfy both?\n\nFile Size: 304 KB\nPrint Length: 252 pages\nPage Numbers Source ISBN: 1493645935\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B008W1L5IA\nText-to-Speech: Enabled ","torrent":{"xt":"urn:btih:b7b4170c648fa980e1e680de758574f55e21caaa","amp;dn":"To+Catch+a+Bad+Guy+-+Marie+Astor+%7B2bUnique%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7b4170c648fa980e1e680de758574f55e21caaa","infoHashBuffer":{"type":"Buffer","data":[183,180,23,12,100,143,169,128,225,230,128,222,117,133,116,245,94,33,202,170]},"announce":[],"urlList":[]}}