{"title":"Whistler Season 1","uid":4744147,"size":4716742656,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b80513c848bec7069f0dd7e6fd4a0d7c7e45543f&amp;dn=Whistler+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"qwerty96","files":13,"time":1235728881,"description":"This is the complete first season(13 episodes) of the TV show Whistler.  \n\nEnjoy and please seed.  \n\n**************\n\nNOW whole series here. Season 1 &amp; 2\n\ndemonoid . com/files/details/1848214\n\n**************\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0491522/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0491522/&lt;/a&gt;\n\nWhistler Season 1\n\nSeason 1, Episode 1: Fallen\nOriginal Air Date25 June 2006\n\nAfter Beck McKaye, a local Olympic snowboard champion, is found dead on the slopes of Whistler, his younger brother Quinn discovers that his brother may have been murdered. Meanwhile, Beck's family and friends gather for his funeral.\n\nSeason 1, Episode 2: Out of the Shadows\nOriginal Air Date2 July 2006\n\nQuinn continues to dig deeper into Beck's hidden life by forming his own friendship with Beck's rich best buddy, A.J. Varland. Meanwhile, Ethan prepares to go back to work; Jen considers accepting a proposition from Adrien; and by rejecting the advances of a VIP guest, Nicole inadvertently puts her career at the Varland Resort on the line.\n\nSeason 1, Episode 3: Coming Together, Coming Apart\nOriginal Air Date9 July 2006\n\nQuinn and Ryan learn something shocking about the alleged blackmail scheme against Beck. Meanwhile, Adrien's generosity becomes a point of contention between Ethan and Jen; Nicole is offered a new position at the Varland Resort.\n\nSeason 1, Episode 4: Lies and Whispers\nOriginal Air Date30 June 2006\n\nQuinn begins to suspect that his uncle Ryan knows more than he's saying about Beck's involvement in a blackmail scheme. Meanwhile, Jen &amp; Ethan are shocked when they learn Adrien Varland is using Beck's image to endorse Varland Gear.\n\nSeason 1, Episode 5: The Burden of Truth\nOriginal Air Date30 June 2006\n\nQuinn finds himself in jail after his investigation into Beck's blackmail scheme, but after Ryan bails him out, Quinn presses him to reveal what he knows about the blackmail and the secrets behind it. Meanwhile, after A.J. embarrasses his father in front of potential investors, Adrien throws him out and cuts him off financially; Ethan enlists a reporter to write an article about Beck in the hopes of exposing Varland's exploitation of Beck.\n\nSeason 1, Episode 6: Will the Real Beck...?\nOriginal Air Date24 July 2006\n\nAfter Nicole arranges an escort for a married VIP and the man dies during the act, she is shocked to witness Ryan's skillful lies to the man's wife. Meanwhile, Quinn is devastated when he mistakenly thinks Carrie and A.J. have become a couple; Ethan and Jen don't connect when he is too distracted by the discovery that Adrien Varland is buying out all the local businesses, causing her to seek comfort with Adam Lawson; Shelby worries Adrien may have discovered her affair with Beck.\n\nSeason 1, Episode 7: In the Air\nOriginal Air Date30 July 2006\n\nQuinn meets a waitress who may take his mind off of Carrie. Meanwhile, Adrien invites Nicole on a trip to West Virginia to buy a horse; Carrie loans A.J. money that was entrusted to her by Nicole; Adam Lawson reveals to Ethan &amp; Jen that his magazine won't print the article exposing Adrien's unethical treatment of the McKayes; Shelby makes plans to leave town when she thinks Adrien is out to get her.\n\nSeason 1, Episode 8: After the Fall\nOriginal Air Date6 August 2006\n\nAfter his one night stand with Lisa, Ethan is wrought with guilt and fires her. Meanwhile, Carrie attempts to track down A.J. to get her money back; unaware that A.J. has been dealing drugs, Jen invites A.J. to stay with the McKayes; Quinn &amp; Isabelle get closer; Nicole joins Adrien at a business party.\n\nSeason 1, Episode 9: The Looks of Love\nOriginal Air Date13 August 2006\n\nQuinn, Isabelle, Feeney and Carrie team up for Whistler's annual underground scavenger hunt. Meanwhile, Carrie finally realizes she has feelings for Quinn; Nicole tries to make it clear to Ryan, that despite their one night stand, she doesn't want a relationship with him; Ethan is dismayed to learn that Jen has re-hired Lisa to fill in at the tavern.\n\nSeason 1, Episode 10: Gathering Clouds\nOriginal Air Date14 August 2006\n\nAfter Quinn decides to make his relationship with Isabelle work, she realizes he has feelings for Carrie and breaks up with him. Meanwhile, Carrie learns that Beck has left a surprise for her; when Ethan &amp; Jen discover their block has been re-zoned for resort use only; Adrien finally makes an open advance on Nicole; A.J. gets badly beaten when he's jumped during a drug deal; Ryan finds the missing Shelby.\n\nSeason 1, Episode 11: Scratching the Surface\nOriginal Air Date20 August 2006\n\n\nWhile Ryan investigates what Adrien Varland is up to, he's shocked to learn that it all leads to the mystery surrounding Beck's death. Meanwhile, Quinn helps Carrie through a difficult medical situation and it brings their relationship to a head; Adrien is undermined by someone close to him; A.J. falls further into the depths of the drug world, when he stops being a drug dealer and shifts to steady drug user.\n\nSeason 1, Episode 12: Meltdown\nOriginal Air Date25 August 2006\n\nRyan finds himself under the suspicion of murder and turns to Quinn for help. Meanwhile, Adrien's business is in jeopardy and the McKayes hold the only solution; Nicole makes a shocking discovery about her family; Quinn &amp; Carrie revel in their newfound relationship.\n\nSeason 1, Episode 13: Unearthed\nOriginal Air Date25 August 2006\n\nQuinn reveals all of Beck's secrets to his shocked parents. Meanwhile, Nicole reveals to Adrien that he is Carrie's father; Adrien has A.J. brought home to get clean, but he escapes and takes Quinn &amp; Carrie hostage; an arrest is made in the case of Beck's murder, as the mystery surrounding his death is finally revealed.","torrent":{"xt":"urn:btih:b80513c848bec7069f0dd7e6fd4a0d7c7e45543f","amp;dn":"Whistler+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b80513c848bec7069f0dd7e6fd4a0d7c7e45543f","infoHashBuffer":{"type":"Buffer","data":[184,5,19,200,72,190,199,6,159,13,215,230,253,74,13,124,126,69,84,63]},"announce":[],"urlList":[]}}