{"title":"RiffTrax - Maniac (mpg)","uid":8712405,"size":1644023812,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b8a68f53cf1202ae43411b957997b7bd00c90d21&amp;dn=RiffTrax+-+Maniac+%28mpg%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"saybis","files":1,"time":1374267139,"description":"Unless you regularly do mushrooms and go to Lady Gaga concerts with your good friend Crispin Glover, then watching Maniac is guaranteed to be the weirdest experience you have ever had. (Not since The Room has a film had such a deep impact on the staff of RiffTrax, so much so that the images in Maniac temporarily dislodged from our minds the mercurial Tommy Wiseau, the stark horror of Chris-R., even the enchanting beauty of Lisa!)\n\nManiac starts conventionally enough, when a Vaudeville-impersonator-turned-lab-assistant-to-a-mad-scientist refuses his bosses reasonable request that he shoot himself in the heart and offer his corpse as an experimental subject. After that, it starts to get strange. A disturbed patient who thinks he is the orangutan from Poe's The Murders in the Rue Morgue is mistakenly given super-adrenaline (which evidently exists) causing him to give one of the most eccentric performances in the history of film. Meanwhile, the mad scientist's next door neighbor is disturbed because one his cats is missing from his cat ranch, where he harvests their fur after feeding their flesh to the rats (which he feeds to the next generation of cats, and so on.) After that, the offbeat aspects of Maniac really kick in.\n\nWe caution you that Maniac is not for the faint of heart. There is brief, partial, creepy, music-free, 1930's nudity (mercifully, the emphasis is on &quot;brief&quot;), plenty of cat-on-cat violence, and a scene in which our hero pops out the eyeball of his own lab cat and snacks on it. That said, it's probably tamer than any given episode of Top Chef and you would really be depriving yourself of something special if you let that keep you from this very, very unique and hilarious journey, with Mike, Bill and Kevin as your guides, into the heart of RiffTrax madness known as Maniac.","torrent":{"xt":"urn:btih:b8a68f53cf1202ae43411b957997b7bd00c90d21","amp;dn":"RiffTrax+-+Maniac+%28mpg%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8a68f53cf1202ae43411b957997b7bd00c90d21","infoHashBuffer":{"type":"Buffer","data":[184,166,143,83,207,18,2,174,67,65,27,149,121,151,183,189,0,201,13,33]},"announce":[],"urlList":[]}}