{"title":"Ajab Prem Ebong DVD Rip-x264 AC3 Esubs-1CD-[DDR]","uid":14531287,"size":732801579,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b8bddde5df663620db0b33926103efdde83f1f7d&amp;dn=Ajab+Prem+Ebong+DVD+Rip-x264+AC3+Esubs-1CD-%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"SaM","files":3,"time":1462445896,"description":"Presenting a DDR Exclusive\r\n\r\n\r\nAjob Prem Ebong... Ekti Bus-er Golpo (2011)\r\n(A film by Arindam De)\r\n\r\n]Bangla - DVD Rip - 720x304 (2.35:1)- 699 MB - x.265.AAC.Esubs - 1 Hrs:59 Min\r\n\r\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n\r\n \nhttp://extraimago.com/image/aId7 \nhttp://extraimago.com/image/aIds \nhttp://extraimago.com/image/aIdn \nhttp://extraimago.com/image/aIdj \nhttp://extraimago.com/image/aIdT \nhttp://extraimago.com/image/aIdN \nhttp://extraimago.com/image/aId2 \nhttp://extraimago.com/image/aIdw \nhttp://extraimago.com/image/aIda \nhttp://extraimago.com/image/aIIf\r\n\r\n Tech Specifications:\r\n \nhttp://extraimago.com/image/aIIW\r\n\r\nSynopsis:\r\nIn the imaginary village of Bollobhpur, there lived a young woman called Moyna (Paoli Dam). When her husband is recklessly run over by the bus belonging to a local politician, Moyna demands justice and decides to stand up against the pressure from the politician (Sabyasachi Chakraborty). She is helped by a group of unlikely people - The mathematics teacher Brajanath (Chiranjeet), his sidekick gadai (Padmanava Dasgupta) and the bus conductor Nakul (Rahul).\r\n\r\nRahul loves the bus, which he calls Munni and also is in love with Moyna. Together this motley bunch of villagers take on the might of the political xlass until the whole village joins them in their fight for justice.\r\n\r\nComments:\r\nAjob Prep Ebong.. is touted as a black comedy - a film that uses humour to bring out the invasion of politics in our daily lives. It does bring out, with the use of some comical scenes the absurdity to which politics has started playing a role with our daily lives. It is an interesting theme that is hammered home..\r\n\r\nUnfortunately, it lacks one basic ingredient of a comedy - a taut screenplay. Much of the effort, including a welcome return of Chiranjeet, goes waste as the screenplay and timing simply does not let the actors the kind of freedom that would allow them to be really funny. As a result, even a seasoned pair like Sabyasachi and Paran Bandyopadhyay look like a set of ham actors. The ones that really do well are the likes of Rahul who sparkles in the midst of some mediocre performances. Paoli Dam has a lot to do but does very little! Biswajit stands out as the bereaved father who is tossed around in the politics of the day.\r\n\r\nThe good part of the film is some good cinematography by Indraneel and some good music by Shamik, in particular the opening song.\r\n\r\n\r\nUploader's Notes:\r\nAs has become almost standard, Eagle gives us a poorly authored DVD. The rip is reasonably good - not among our best. You will notice some Some color correction and some good good de-interlacing. We have also included the original AC3 sound.\r\n\r\nEnjoy!\r\n\r\nIMDB Link: \nhttp://www.imdb.com/title/tt2023370/","torrent":{"xt":"urn:btih:b8bddde5df663620db0b33926103efdde83f1f7d","amp;dn":"Ajab+Prem+Ebong+DVD+Rip-x264+AC3+Esubs-1CD-%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8bddde5df663620db0b33926103efdde83f1f7d","infoHashBuffer":{"type":"Buffer","data":[184,189,221,229,223,102,54,32,219,11,51,146,97,3,239,221,232,63,31,125]},"announce":[],"urlList":[]}}