{"title":"Control Denied - The Fragile Art Of Existence (1999) [EAC-FLAC]","uid":4201947,"size":392901219,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b9deda79fd69f7673fc842a96bf36a7db86491a2&amp;dn=Control+Denied+-+The+Fragile+Art+Of+Existence+%281999%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sworduigi","files":8,"time":1211553704,"description":"Extractor: EAC 0.99 prebeta 4 \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD (silver CD)\nArtwork: Front, Back, Inlay and CD (Web Found).\n\n\nGeneral Info:\n\nTracklist:\n   1. &quot;Consumed&quot; ? 7:24\n   2. &quot;Breaking the Broken&quot; ? 5:41\n   3. &quot;Expect the Unexpected&quot; ? 7:17\n   4. &quot;What If....?&quot; ? 4:29\n   5. &quot;When the Link Becomes Missing&quot; ? 5:17\n   6. &quot;Believe&quot; ? 6:10\n   7. &quot;Cut Down&quot; ? 4:50\n   8. &quot;The Fragile Art of Existence&quot; ? 9:38\n\n\n\n              LINE UP:\n    * Chuck Schuldiner - Guitar, music, lyrics\n    * Steve DiGiorgio - Bass\n    * Shannon Hamm - Guitar\n    * Tim Aymar - Vocals\n    * Richard Christy - Drums\n\n\nReview taken from metal-observer.com:\nOn &quot;The Fragile Art Of Existence&quot; is Chuck saying, &quot;I love Metal!!!&quot;, this was his tribute to the music he loved, lived and died for. CONTROL DENIED was the side-project of Chuck Schuldiner, songwriter, musician and mastermind behind DEATH and this is the only album he released under this moniker.\nWhen I say Chuck Schuldiner, most of you fellow Metal friends will think of Melodic, Technical and Progressive Death Metal of the highest shelf. True, but CONTROL DENIED is like a lighter version of DEATH, or the little brother who was never allowed to grow up, because Chuck doesn&amp;#039;t sing here, so we&amp;#039;re talking Melodic, Technical and Progressive Metal without the Death Metal influences. It should come as no surprise when you hear traces of DEATH&amp;#039;s last offering &quot;The Sound Of Perseverance&quot;, because these two album have one parallel in common: Chuck Schuldiner, plus behind him is the same line-up from that album, only bassist Steve DiGiorgio and vocalist Tim Aymar are the new members. Tim Aymar reminds me of Warrel Dane, but there are moments when he uses forced vocals, which have an aggressive edge. Chuck has more freedom now that he doesn&amp;#039;t have to sing and Tim&amp;#039;s vocals fit well with this music, so it&amp;#039;s really a win-win situation for the band. Structurally it sounds very much like DEATH with more Prog Metal bits thrown into the chopper.\nChuck has written some great songs that are long but not boring. Songs like &quot;Consumed&quot; and &quot;Expect The Unexpected&quot; are over seven minutes and the ending title track is almost ten minutes. The title track is a testament to Chuck&amp;#039;s virtuoso abilities and the very definition of Modern U.S. Progressive Metal, it&amp;#039;s a masterpiece and only Chuck could write such inspiring music with feel. The bass playing in &quot;Breaking The Broken&quot; is very tasteful and colourful with jazzy influences; Steve DiGiorgio doesn&amp;#039;t hide himself like many bass players, he&amp;#039;s everywhere and full of creativity in every song. &quot;When The Link Becomes Missing&quot; has a cool shredding solo embodied with a water effect and some unbelievable percussion work from Richard Christy.\n&quot;Believe&quot; is a heavy slammer with some Death Metal guitars; this song brings back some of the raw aggression from DEATH&amp;#039;s primal days, it also contains the legendary lyrical line that says, &quot;If I was paid for disappointments I would be a wealthy man&quot;, think about it. The only song I don&amp;#039;t like that much is &quot;Cut Down&quot;, it doesn&amp;#039;t have the same quality as the rest.\nEvil Chuck completed the circle with this album. The remaining members of the band are determined to finish the second album &quot;When Machine And Man Collide&quot;, so maybe we&amp;#039;ll hear more in the future. &quot;The Fragile Art Of Existence&quot; stands for venturesome Melodic Progressive Metal made by one of Metal&amp;#039;s finest musicians there ever was, if you haven&amp;#039;t obtained this one yet, I urge you to do so.","torrent":{"xt":"urn:btih:b9deda79fd69f7673fc842a96bf36a7db86491a2","amp;dn":"Control+Denied+-+The+Fragile+Art+Of+Existence+%281999%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9deda79fd69f7673fc842a96bf36a7db86491a2","infoHashBuffer":{"type":"Buffer","data":[185,222,218,121,253,105,247,103,63,200,66,169,107,243,106,125,184,100,145,162]},"announce":[],"urlList":[]}}