{"title":"Requiem - Franz von Suppe","uid":4900569,"size":316995359,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ba3d0e928c974a429f4f0771674c4bd026633cdb&amp;dn=Requiem+-+Franz+von+Suppe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eddie1969","files":10,"time":1242592300,"description":"Music : Classical : Lossless\n\n\nFranz von SuppÃƒÂ© (1819 - 1895) \nRequiem in D minor\n\nMalin Hartelius (Soprano), Verena Gohl-MÃƒÂ¼ller (Alto), \nWolfgang BÃƒÂ¼nten (Tenor), Oliver Widmer (Bass),\nZurich Chamber Orchestra, Zurich Chamber Chorus,\nEdmond de Stoutz \n\nrecording : 1994 / Label : Novalis\n\n\n\nComposition Description:\n\nFrancesco Ezechiale Ermengildo Cavaliere Suppe Demelli was a high-born youth whose father disfavored his son's wish to &quot;lower himself&quot; by becoming a professional musician. But he pursued his dream by private studies and in 1840 was given his big break by the director of the Theater in der Josefstadt, Franz Pokorny. As the young man made his way (his name now altered to &quot;Franz von SuppÃƒÂ©&quot;), he was frequently aided by Pokorny, who saw his talent as a conductor and then, in 1844, permitted him to start writing incidental music for the theater. After Pokorny's death in 1850, SuppÃƒÂ© planned this full-scale Requiem in his honor, premiering it at a memorial service at the Piaristenkirche in 1855.\n\nThe Requiem is a reverant and yet very colorful score. Using a standard orchestra with double winds, four horns, two trumpets, three trombones, timpani, and strings, he depicted the text of the Mass for the Dead dramatically. The melodies in particular are exceptionally lyrical, while the thunder of the Dies Irae, the resounding trombones of the Tuba mirum, and the bursts of orchestral light on the words &quot;Hosanna in excelsis&quot; are all effective and firmly within the tradition of the excellent Requiems of the Romantic era. It was very well received, and was repeated in 1856, 1858, and 1861, always to enthusiastic praise from the audience. However, by then SuppÃƒÂ© had composed a hit operetta in the style of Offenbach and thenceforward made his fortune in the field of lighter music. SuppÃƒÂ© was typecast. Soon, if anyone learned that the operetta writer had composed a Requiem at the age of thirty-two they were unlikely to consider it a lead worth pursuing. Today, while his memory is kept bright by his numerous operetta overtures, his serious work, especially the fine Requiem, is mainly unknown, although it is making a deserved come-back on compact disc.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:ba3d0e928c974a429f4f0771674c4bd026633cdb","amp;dn":"Requiem+-+Franz+von+Suppe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba3d0e928c974a429f4f0771674c4bd026633cdb","infoHashBuffer":{"type":"Buffer","data":[186,61,14,146,140,151,74,66,159,79,7,113,103,76,75,208,38,99,60,219]},"announce":[],"urlList":[]}}