{"title":"Lightning Protection (Iet Power and Energy) - (Malestrom)","uid":5630940,"size":9813674,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bae350e0582cd700af42f75b9bc84ee5e2e5004a&amp;dn=Lightning+Protection+%28Iet+Power+and+Energy%29+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":2,"time":1276675202,"description":" &lt;a href=&quot;http://www.image-upload.net/images/7bl87pc3ufnnkzsh1xtl_thumb.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/7bl87pc3ufnnkzsh1xtl_thumb.jpeg&lt;/a&gt;\n\nVernon Cooray, &quot;Lightning Protection (Iet Power and Energy)&quot;\nThe Institution of Engineering and Technology | 2009 | ISBN: 0863417442 | 1070 pages | PDF \n\nSummarizes the state of the art of lightning protection as it stands today\n\nProvides the necessary scientific background to enable the engineer to make appropriate judgments in situations where conventional engineering solutions may be inadequate\n\nLightning is a natural phenomenon that has always fascinated humans. It is also a destructive force, and the science of protecting humans and their belongings on earth is called lightning protection. This book provides the reader with a thorough background in almost every aspect of lightning protection. The contents of the book, distributed over 23 chapters, covers all aspects of lightning protection including lightning parameters of engineering interest, the evaluation of the risk imposed by lightning strikes, the art of installing lightning protection systems on various structures, basic principles and procedures necessary to protect electronic equipment in buildings from lightning flashes, grounding in lightning protection, the function of surge protection devices, protection of power transmission lines and telecommunication towers from lightning, the interaction of lightning flashes with wind turbines, various aspects of lightning strikes to trees, medical and engineering aspects of lightning strikes to humans, and lightning warning systems. In addition to providing essential information on lightning protection for engineers and scientists, the book is intended for use as a textbook on lightning protection at a graduate and postgraduate level.\n","torrent":{"xt":"urn:btih:bae350e0582cd700af42f75b9bc84ee5e2e5004a","amp;dn":"Lightning+Protection+%28Iet+Power+and+Energy%29+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bae350e0582cd700af42f75b9bc84ee5e2e5004a","infoHashBuffer":{"type":"Buffer","data":[186,227,80,224,88,44,215,0,175,66,247,91,155,200,78,229,226,229,0,74]},"announce":[],"urlList":[]}}