{"title":"The Impossibility of Religious Freedom by Winnifred Sullivan","uid":10507219,"size":2262747,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bb2bb832427e9509a5b0b3468fe0f8e3c0f983b6&amp;dn=The+Impossibility+of+Religious+Freedom+by+Winnifred+Sullivan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1404790833,"description":"The Impossibility of Religious Freedom (2005) by Winnifred Fallers Sullivan.pdf\n\nThe Constitution may guarantee it. But religious freedom in America is, in fact, impossible. So argues this timely and iconoclastic work by law and religion scholar Winnifred Sullivan. Sullivan uses as the backdrop for the book the trial of Warner vs. Boca Raton, a recent case concerning the laws that protect the free exercise of religion in America. The trial, for which the author served as an expert witness, concerned regulations banning certain memorials from a multiconfessional nondenominational cemetery in Boca Raton, Florida. The book portrays the unsuccessful struggle of Catholic, Protestant, and Jewish families in Boca Raton to preserve the practice of placing such religious artifacts as crosses and stars of David on the graves of the city-owned burial ground.\n\nSullivan demonstrates how, during the course of the proceeding, citizens from all walks of life and religious backgrounds were harassed to define just what their religion is. She argues that their plight points up a shocking truth: religion cannot be coherently defined for the purposes of American law, because everyone has different definitions of what religion is. Indeed, while religious freedom as a political idea was arguably once a force for tolerance, it has now become a force for intolerance, she maintains.\n\nA clear-eyed look at the laws created to protect religious freedom, this vigorously argued book offers a new take on a right deemed by many to be necessary for a free democratic society. It will have broad appeal not only for religion scholars, but also for anyone interested in law and the Constitution.\n\n320 pages\nPublisher: Princeton University Press (May 9, 2005)\nLanguage: English\nISBN-10: 0691118019\nISBN-13: 978-0691118017","torrent":{"xt":"urn:btih:bb2bb832427e9509a5b0b3468fe0f8e3c0f983b6","amp;dn":"The+Impossibility+of+Religious+Freedom+by+Winnifred+Sullivan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb2bb832427e9509a5b0b3468fe0f8e3c0f983b6","infoHashBuffer":{"type":"Buffer","data":[187,43,184,50,66,126,149,9,165,176,179,70,143,224,248,227,192,249,131,182]},"announce":[],"urlList":[]}}