{"title":"Mysterious Ways S01E1-5 Xvid-Xenn99","uid":3594708,"size":1835227136,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bd2e9152dff0e1365696578231c2dfe4e12df5f0&amp;dn=Mysterious+Ways+S01E1-5+Xvid-Xenn99&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Xenn99","files":5,"time":1168619112,"description":"Mysterious Ways, a Nice Tv serie aired in 2000.\n\nThese are the first 5 Episodes of the first season.\n\nfull 1st Season will be upped one after another.\n\nHave fun with this one.\n\nIf you like the torrents put some nice comments in it that way i know if i should upload more..\n\nCheers,\nXenn99\n\n\nEpisodes:\n101 - &quot;Episode 1&quot; :  Pilot aka Amazing Grace \nOriginal Airdate: NBC 7/24/2K \nDeclan Dunn, an anthropology professor who also investigates uncanny phenomena that happen to people everyday, meets Peggy Fowler, a psychiatrist at a local hospital and a skeptic. Together they try to explain how an 11-year-old boy was miraculously saved from drowning in a frozen lake. \nGuest Starring: Lynda Boyd, Devin Douglas Drewitz, Lorena Gale, Myron Natwick, Ken Pogue \n\n102 - ?The Gray Lady? \nOriginal Airdate: NBC 7/31/2K \nA man promises his wife on his deathbed that he will contact her exactly one year after his death to prove that there is life after death. As the anniversary draws near, Declan and Peggy are drawn to see for themselves if a miracle happens, as opposed to investigating one after the fact. Peggy, a widow herself, can relate to this woman?s pain and loss, but in the end discovers some faith of her own. \nGuest Starring: Gillian Barber \n\n103 - &quot;Twins&quot; \nOriginal Airdate: NBC 8/28/2K \nDeclan believes two boys in his class are cheating when their exams have identical answers. But this is only the first of many uncanny similarities between the two boys, despite different upbringings. Declan, intrigued decides to investigate the possibility of the two being twins, separated at birth. \nGuest Starring: Tigh Runyan, Tyron Leitso, Carolyn Tweedle, Dave McGowan, Tristin Leffler, Marisa Rudiak, Christine Upright-Letain, Mark Schooley \n\n104 - &quot;The Midas Touch&quot; \nOriginal Airdate: NBC 8/7/2K \nPeggy and Declan discover a town whose citizens have overwhelming good fortune. Upon further investigation, they uncover the town?s secret, a woman who supposedly has the gift to give people good luck just by touching them. \nGuest Starring: Anne Ramsay, Betty Linde, Alfred E. Humphreys, Diane Stapley \n\n105 - &quot;Camp Sanopi&quot; \nOriginal Airdate: NBC 8/14/2K \nOn a white-water rafting trip, Declan is thrown from the raft and ends up miles downstream, badly hurt with a broken leg. Luck is on his side, however, as a kindly old man named Dr. Nader discovers him and takes him to Camp Sanopi, a secluded retreat deep in the woods. But Declan soon discovers that this blissful camp is not what it seems to be, and that although all are welcome, none can leave. \nGuest Starring: August Schellenberg, Michael Suchanek, Douglas O?Keeffe, Kirsten Robek, Matthew Harrison","torrent":{"xt":"urn:btih:bd2e9152dff0e1365696578231c2dfe4e12df5f0","amp;dn":"Mysterious+Ways+S01E1-5+Xvid-Xenn99","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd2e9152dff0e1365696578231c2dfe4e12df5f0","infoHashBuffer":{"type":"Buffer","data":[189,46,145,82,223,240,225,54,86,150,87,130,49,194,223,228,225,45,245,240]},"announce":[],"urlList":[]}}