{"title":"Blizzard - Diablo Books Collection - Diablo Archive - The Si","uid":5367510,"size":54672366,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be3cfe5565ca1fab1bc053c91a756f9ab60865c9&amp;dn=Blizzard+-+Diablo+Books+Collection+-+Diablo+Archive+-+The+Si&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Leo_BS","files":12,"time":1266316541,"description":"Diablo eBooks Complete Collection\n\nREAD NFO!!!!!\n\neBooks included:\n\nDiablo Archive.\n\nThe Sin War Trilogy - Birthright\n\nThe Sin War Trilogy - Scales of the Serpent\n\nThe Sin War Trilogy - The Veiled Prophet\n\nMoon of the Spider - COMPLETE PDF.\n\nEnjoy!\n\nLeonardo from Black Sun.\n\n\nNotes:\nI'm very proud to bring this material to you.\nThe release date of this content wasn't a casualty... Today, 02/16/10, exactly\none year ago, Fredrik Neij, Gottfrid Svartholm and Peter Sunde were prosecuted\nwith the only clear charge of promote the knowledge between the\nWorld-Wide-Web Community. It was an unfair trial with the dumbest charges,\nthe most ridiculous prosecutors and a corrupt judge heading it.\n\nSo, the first release of the Black Sun Group it's dedicated in recognition to the\neffort of Fredrik, Gottfrid and Peter on bring free knowledge to the people, and to\nsay to the world of the Registered Media that the WWW Community will never\nsurrender, we will fight till the end, we will break every protection you could\ncreate, WE are HERE to STAY, WE ARE THE FUTURE!\nThe knowledge it isn't a privilege, it's a gift, and as such, it should be\nFREE FOR ALL!\nYou will never beat us, because our intentions are pure, our determination is solid\nand our passion for knowledge is limitless!\n\nThe Spectrial was relevant, not for being one of the most important trials on the\ninternet history, but because it opened the eyes of thousands of\npersons about the importance of the free knowledge, persons like me,\npersons like you. UNITED WE WILL NEVER BE DEFEATED!!\n\n&quot;The piracy it isn't morally illegal because it\npromotes the cultural interchange and art,\nthat is the way I see it.&quot;\n                             Leonardo @ #Spectrial, Black Sun Group Founder.\n\nEnjoy the books, it was an honor to work for you, greetings from Argentina!","torrent":{"xt":"urn:btih:be3cfe5565ca1fab1bc053c91a756f9ab60865c9","amp;dn":"Blizzard+-+Diablo+Books+Collection+-+Diablo+Archive+-+The+Si","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be3cfe5565ca1fab1bc053c91a756f9ab60865c9","infoHashBuffer":{"type":"Buffer","data":[190,60,254,85,101,202,31,171,27,192,83,201,26,117,111,154,182,8,101,201]},"announce":[],"urlList":[]}}