{"title":"BBC Horizon Atlantis.Uncovered.DivX521.MP3","uid":4241622,"size":734140416,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:be57c6452971dc27f533eed3a65e76e4dafba4cb&amp;dn=BBC+Horizon+Atlantis.Uncovered.DivX521.MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"circlensess","files":1,"time":1213571180,"description":"Horizon 1999 Atlantis Uncovered\n\n\n\nInformation\n\nBBC Two 9.30pm 28 October 1999\n\nPart 1 of a two part Horizon special explores the mystery of whether Atlantis really did exist. Was there really, 12,000 years ago, a fabulous city whose people had already evolved all the trappings of civilisation - sophisticated culture and society, writing, astronomy, religion, monument-building - while everyone else was still living in the Stone Age?\n\n\n\nEver since Plato first alluded to the mysterious city of Atlantis, destroyed in a terrible flood, the notion of an ancient, lost civilisation has been a compelling myth. The idea was revived in the 19th century to explain the tantalising similarities amongst different far-flung ancient cultures that had no connection with each other - why did so many ancient peoples build pyramids? Why did they write in hieroglyphs? Why was their understanding of astronomy and religion apparently so similar? The popular explanation was that Atlantis was the common source for all civilisation, that after their homeland was destroyed in a catastrophic flood, 12,000 years ago, the survivors of this super-race then travelled the world, spreading their knowledge to all. But if this theory is right, the whole of human history will have to be rewritten.\n\n\n\nJacqueline Smith&amp;#039;s film explores whether this popular, yet controversial idea could be true. It examines the mysterious similarities between ancient cultures, and traces the fascinating scientific evidence that shows why the theory of Atlantis has been rejected by mainstream science. &amp;#039;You could summarise it by saying it&amp;#039;s a load of codswallop&amp;#039;, says Prof. Colin Renfrew. Cutting edge archaeology, geophysics, chemistry, and carbon dating show that there was no single source for all civilisation - that civilisations evolved independently, in many different places, at different times throughout history. Horizon reveals compelling research that traces the true origins of these far-flung cultures, and explains the apparent coincidences that so intrigue us all.\n\nTechnical Specs\n\nVideo Codec: Divx 5.21\nVideo Bitrate: 1814 kb/s\nVideo Resolution: 640x480\nVideo Aspect Ratio: 4:3\nAudio Codec: LAME MP3\nAudio BitRate: 192 kb/s\nAudio Channels: 2\nRunTime Per Part: 48m 33s\nNumber Of Parts: 1\nPart Size: 700mb\nRipped by jvt40\n\n","torrent":{"xt":"urn:btih:be57c6452971dc27f533eed3a65e76e4dafba4cb","amp;dn":"BBC+Horizon+Atlantis.Uncovered.DivX521.MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be57c6452971dc27f533eed3a65e76e4dafba4cb","infoHashBuffer":{"type":"Buffer","data":[190,87,198,69,41,113,220,39,245,51,238,211,166,94,118,228,218,251,164,203]},"announce":[],"urlList":[]}}