{"title":"Up In The Air DVDRip Spanish 2009","uid":5538774,"size":1753346048,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bef3418288600bfbae8615f23fdf1856c4e6c105&amp;dn=Up+In+The+Air+DVDRip+Spanish+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mois20","files":1,"time":1273156088,"description":"Ryan Bingham (George Clooney) es un experto en despedir a gente, contratado de forma externa por otras empresas para reducir personal. Ryan lleva mucho tiempo contento con su despreocupado estilo de vida, viviendo por toda NorteamÃƒÂ©rica en aeropuertos, hoteles y coches de alquiler. Puede llevar todo lo que necesita en una maleta con ruedas. Es un miembro mimado y de ÃƒÂ©lite de todos los programas de fidelizaciÃƒÂ³n de viajeros que existen. Y le falta poco para alcanzar el objetivo de su vida: conseguir una secreta y desorbitada cifra de millas de viajero habitual, que le darÃƒÂ­a acceso a un restringido y selecto club. Sin embargo Ryan no tiene nada autÃƒÂ©ntico a lo que aferrarse. Cuando se siente atraÃƒÂ­do por una atractiva compaÃƒÂ±era de viaje (Vera Farmiga), otra viajera frecuente, el jefe de Ryan (Jason Bateman), animado por una joven y advenediza experta en eficiencia (Anna Kendrick), amenaza con atarle a un despacho. Enfrentado a la perspectiva, a la vez terrorÃƒÂ­fica de ser destinado a un puesto fijo, Ryan empieza a meditar sobre lo que puede llegar a significar el tener un hogar de verdad.","torrent":{"xt":"urn:btih:bef3418288600bfbae8615f23fdf1856c4e6c105","amp;dn":"Up+In+The+Air+DVDRip+Spanish+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bef3418288600bfbae8615f23fdf1856c4e6c105","infoHashBuffer":{"type":"Buffer","data":[190,243,65,130,136,96,11,251,174,134,21,242,63,223,24,86,196,230,193,5]},"announce":[],"urlList":[]}}