{"title":"Gran Torino(2008)DVDRip.AC3(ENG)-DROCK","uid":6372821,"size":734063512,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bf4dc364a0977089687045cfeebdcc8bfd882b74&amp;dn=Gran+Torino%282008%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1304742050,"description":"A racist Korean War veteran living in a crime-ridden Detroit neighborhood is forced to confront his own lingering prejudice when a troubled Hmong teen from his neighborhood attempts to steal his prized Gran Torino. Decades after the Korean War has ended, ageing veteran Walt Kowalski (Clint Eastwood) is still haunted by the horrors he witnessed on the battlefield. The two objects that matter most to Kowalski in life are the classic Gran Torino that represents his happier days working in a Ford assembly plant, and the M-1 rifle that saved his life countless times during combat. When Kowalski's teenage neighbor (Bee Vang) attempts to steal his Gran Torino as part of a gang initiation rite, the old man manages to catch the aspiring thief at the business end of his well-maintained semi-automatic rifle. Later, due to the pride of the Asian group, the boy is forced to return to Kowalski's house and perform an act of penance. Despite the fact that Kowalski wants nothing to do with the young troublemaker, he realizes that the quickest way out of the situation is to simply cooperate. In an effort to set the teen on the right path in life and toughen him up, the reluctant vet sets him up with an old crony who now works in construction. In the process, Kowalski discovers that the only way to lay his many painful memories to rest is to finally face his own blinding prejudice head-on. \n\nRipped with Handbrake.\n\nLength: 1 Hour 56 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:bf4dc364a0977089687045cfeebdcc8bfd882b74","amp;dn":"Gran+Torino%282008%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf4dc364a0977089687045cfeebdcc8bfd882b74","infoHashBuffer":{"type":"Buffer","data":[191,77,195,100,160,151,112,137,104,112,69,207,238,189,204,139,253,136,43,116]},"announce":[],"urlList":[]}}