{"title":"Chicago Manual of Style (16th Ed) 2010 ENG 712x692C 2426 pages","uid":6646747,"size":27041764,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0618ca3fcf01eea3b18aeec890e410705e9667c&amp;dn=Chicago+Manual+of+Style+%2816th+Ed%29+2010+ENG+712x692C+2426+pages&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"butanejesus","files":-1,"time":1314979011,"description":"The 203 pages of the 1st edition contained many timeless conventions. A chapter on &quot;Technical Terms&quot; covered typographic principles that are still widely held, including the use of leading, and spacing between letters and words. But some variation from modern use is evident. For example, the 1906 edition featured semicolons within closing quotation marks, and prescribed em spaces between sentences and after colons.\n\nDuring the next 100 years, the Manual of Style followed the changing practices of the English language. Allowances were made for the mechanical limitations of the typewriter--especially in manuscripts. The computer and the advent of digital media later caused another reevaluation of typographic principles. Finally, the chapter on &quot;Technical Terms&quot; eventually morphed into a chapter called &quot;Design and Typography,&quot; seen, for example, in the 1982 Thirteenth Edition. But this consolidation of typographic principles within the manual was not to last into the 21st century.\n\nThe 16th edition of the CMOS, published in late 2010, is a much more comprehensive work. Music, foreign languages, and computer topics (such as Unicode characters and URLs) have found their way into the style guide. Familiar chapters have been expanded to clarify questions raised by users. The manual now provides advice on the italicization of punctuation, the use of typographic quotation marks, and modern spacing conventions after terminal punctuation, colons and semicolons. The careful reader will also notice that semicolons now appear outside of closing quotation marks, alongside its close relative--the colon.\n\nAnother change is evident. The chapter on &quot;Design and Typography&quot; is gone. The staff of the University of Chicago Press chose to cover typographic conventions throughout the manual instead of lumping them together in one chapter. Given the diversity of the material in the 1026-page 16th edition, that's an understandable choice. But even though it no longer has a dedicated chapter, typographic guidance is everywhere. A century of change has not diminished its importance in the Chicago Manual of Style.\n\nAnd who knows? Perhaps in another hundred years the semicolon will find its way back inside the closing quotation marks.","torrent":{"xt":"urn:btih:c0618ca3fcf01eea3b18aeec890e410705e9667c","amp;dn":"Chicago+Manual+of+Style+%2816th+Ed%29+2010+ENG+712x692C+2426+pages","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0618ca3fcf01eea3b18aeec890e410705e9667c","infoHashBuffer":{"type":"Buffer","data":[192,97,140,163,252,240,30,234,59,24,174,236,137,14,65,7,5,233,102,124]},"announce":[],"urlList":[]}}