{"title":"Fighting Caravans (1931) DVD5 - Western [DDR]","uid":9099996,"size":3804254208,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c0aa68ca39820fa1f99c833777260351c0084552&amp;dn=Fighting+Caravans+%281931%29+DVD5+-+Western+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1382752744,"description":"Fighting Caravans (1931) DVD5 - Western [DDR]\n\n    CAST:-\n    Gary Cooper as Clint Belmet\n    Lili Damita as Felice\n    Ernest Torrence as Bill Jackson\n    Tully Marshall as Jim Bridger\n    Fred Kohler as Lee Murdock\n    Eugene Pallette as Seth Higgins\n    Roy Stewart as Couch\n    May Boley as Jane\n    Jim Farley as Amos\n    James A. Marcus as The Blacksmith\n    Donald MacKenzie as Gus\n    Eve Southern as Faith\n    Frank Campeau as Jeff Moffitt\n    Charles Winninger as Marshall\n    Frank Hagney as Renegade\n\nMOVIE REVIEW:- Fighting Caravans (1931) \nFighting Caravans is a 1931 American Western film directed by Otto Brower and David Burton and starring Gary Cooper, Lili Damita, and Ernest Torrence. Based on the 1929 novel Fighting Caravans by Zane Grey, the film is about a young frontier scout who helps guide a freight wagon train across the country, fighting off Indians and evil traders, while his two crusty companions try and save him from falling in love. Although billed as being based on the Zane Grey novel, the stories have little in common. The film was actually written by Agnes Brand Leahy, Edward E. Paramore, Jr., and Keene Thompson.\n\nFighting Caravans was remade just three years later as Wagon Wheels, a low-budget production employing extensive stock footage from Fighting Caravans and featuring Randolph Scott and Gail Patrick in the lead roles. Every character's name was changed in the remake except that of Clint Belmet, played by Cooper and Scott.\nContents\n\nClint Belmet (Gary Cooper) is a bit of a firebrand and is sentenced to at least 30 days in jail, but his partners, Bill Jackson (Ernest Torrence) and Jim Bridger (Tully Marshall) talk a sympathetic Frenchwoman named Felice (Lili Damita) into telling the bumbling, drunken marshal that Clint had married her the previous night. Clint is released so he can accompany Felice on the wagon train heading west to California.\n\nA short time later, Felice finds out that Bill and Jim had lied to her; she did not need a man in order to join the wagon train. In a short stopover in a town, they learn that the Indians are causing trouble, so Clint offers to guide the wagon train through the dangerous trails ahead. On the journey, Felice's wagon runs out of control downhill and Clint rescues her. Felice starts talking about marriage. Clint has always been free and wants to stay that way, so he leaves.\n\nHe later finds out that Indians (Kiowas and Cheyenne who have been talked into the warpath by crooked traders) are planning to attack the wagon train. He, Bill and Jim rush back to save the day. The Indians attack at a river crossing. Clint helps save the day with some barrels of gunpowder but his friends are killed. The survivors continue on to California.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 5862 kbps\nVideo Resolution:720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 1:20:53\nSubtitles:None\nRipped by:Trinidad [DDR]\nDuration: 1:20:53","torrent":{"xt":"urn:btih:c0aa68ca39820fa1f99c833777260351c0084552","amp;dn":"Fighting+Caravans+%281931%29+DVD5+-+Western+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0aa68ca39820fa1f99c833777260351c0084552","infoHashBuffer":{"type":"Buffer","data":[192,170,104,202,57,130,15,161,249,156,131,55,119,38,3,81,192,8,69,82]},"announce":[],"urlList":[]}}