{"title":"OST - Twilight Zone (The 40th Anniversary Collection) [EAC-CUE-F","uid":4646867,"size":1392604568,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c0b9de616a1ad52f8dab5503b828a68f67faf8ed&amp;dn=OST+-+Twilight+Zone+%28The+40th+Anniversary+Collection%29+%5BEAC-CUE-F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"repopo","files":-1,"time":1231915297,"description":"*******************************************************************************\n                  Twilight Zone: 40th Anniversary Collection\n*******************************************************************************\n\nTracklist\n\nDisc: 1\n1. Main Title - Herrmann, Bernard\n2. Where Is Enerybody? - Herrmann, Bernard\n3. End Title - Herrmann, Bernard\n4. The Outer Space Suite: Prelude - Herrmann, Bernard\n5. Signals - Herrmann, Bernard\n6. Space Drift - Herrmann, Bernard\n7. Space Stations - Herrmann, Bernard\n8. Time Suspense - Herrmann, Bernard\n9. Starlight - Herrmann, Bernard\n10. Danger - Herrmann, Bernard\n11. Moonscape - Herrmann, Bernard\n12. Airlock - Herrmann, Bernard\n13. Tycho - Herrmann, Bernard\n14. The Earth - Herrmann, Bernard\n15. Alternate Main Title #2 - Herrmann, Bernard\n16. Walking Distance - Herrmann, Bernard\n17. Alternate Main Title #2 - Herrmann, Bernard\n18. The Hitchhiker - Herrmann, Bernard\n19. Alternate Main Title #3 - Herrmann, Bernard\n20. The Lonley - Herrmann, Bernard\n21. Alternate Main Title #3 - Herrmann, Bernard\nDisc: 2\n1. Back There - Goldsmith, Jerry\n2. The Big Tall Wish - Goldsmith, Jerry\n3. The Invaders - Goldsmith, Jerry\n4. Dust - Goldsmith, Jerry\n5. Jazz Theme #1 - Goldsmith, Jerry\n6. Jazz Theme #2 - Goldsmith, Jerry\n7. Nervous Man in a Four Dollar Room - Goldsmith, Jerry\n8. End Title - Constant, Marius\nDisc: 3\n1. Perchance to Dream - Van Cleave, Nathan\n2. Elegy - Van Cleave, Nathan\n3. Two - Van Cleave, Nathan\n4. I Sing the Body Electric - Van Cleave, Nathan\n5. A World of Difference - Van Cleave, Nathan\n6. A Stop at Willoughby - Scott, Nathan\n7. Street Moods in Jazz - Garriguenc, Rene\n8. End Title - Constant, Marius\nDisc: 4\n1. Fourth/Fifth Seasons Introduction - Constant, Marius\n2. Alternate Main Title #3 - Constant, Marius\n3. A Hundred Yards over the Rim - Steiner, Fred\n4. King Nine Will Not Return - Steiner, Fred\n5. The Passerby - Steiner, Fred\n6. And When the Sky Opened - Rosenman, Leonard\n7. The Trouble With Templeton - Alexander, Jeff\n8. The Sixteen-Millmeter Shrine - Waxman, Franz\n9. Alternate End Title #3 - Constant, Marius \n\n(Tracklist taken from Amazon.com)\n\n\n-------------------------------------------------------------------------------\n\n\nReview from allmusicguide\n\nThe definitive account of the music from the original television series, \nTwilight Zone: The 40th Anniversary Collection offers four CDs of total \nimmersion into most of the best and most memorable scores written for the five \nseason run of the anthology series. Bernard Herrmann's music dominates the first \ndisc, beginning with both the broadcast (i.e., with Serling's narration) and \nunedited versions of his dark, brooding main title music, and the 11 minute \nscore for the first episode, &quot;Where Is Everybody&quot;. As this was an intriguing but \nnot fully realized program, the music is more inventive and memorable than the \nprogram itself -- as with other Herrmann scores, this one shows signs of his \nhaving &quot;stolen&quot; from himself, with several passages, between four minutes and 30 \nseconds and six minutes and 30 seconds, that could have come from his 1941 score \nfor The Devil And Daniel Webster. The balance of the 75-minute first disc is \nfilled up with Herrmann's &quot;Outer Space Suite&quot;, an extended body of work written \nand recorded as &quot;stock&quot; music for CBS by the composer in 1957, which was quoted \nextensively in the run of this series. The opening prelude offers horn parts and \na rhythmic underscore reminiscent of the composer's music for The Day The Earth \nStood Still. Also included on this disc is Herrmann's proposed new title theme \nfor the series -- which sound even more in debt to his music for The Day The \nEarth Stood Still -- which were rejected in favor of a piece by Marius Constant \nthat became the most familiar musical cue associated with the program. Also \nfeatured is his music for the episodes &quot;Walking Distance&quot;, &quot;The Hitchhiker&quot; and \n&quot;The Lonely&quot;, of which the first is one of the masterpieces of television \nscoring, a gently nostalgic string-laden piece that was (and is) worthy of a \nseparate life in the concert hall. Disc Two opens with Constant's theme and then \ngives itself over to Jerry Goldsmith's superb contributions to the show, in a \nseries of suites, written for the episodes &quot;Back There,&quot; &quot;The Big Tall Wish,&quot; \n&quot;The Invaders,&quot; and &quot;Dust,&quot; that are far more energetic than Herrmann's work, if \nnot as subtle -- still, Goldsmith could do more with a musical &quot;sting&quot; than \nalmost any other composer working, which is why so many key parts of these \nscores were still being used on soundtracks in the 1980's; the most memorable is \neasily &quot;The Invaders&quot; which, with its rippling piano figure and violently bowed \nviolins, plays like a not-to-distant cousin to Herrmann's music for Psycho. Disc \nThree showcases the music of Nathan Van Cleave, in suites for &quot;Perchance To \nDream,&quot; &quot;Elegy,&quot; &quot;Two,&quot; &quot;I Sing The Body Electric,&quot; and &quot;A World Of Difference&quot; \n-- these are less formalistic than either Herrmann's or Goldsmith's work, and \nsound much more like conventional film music, eerie and at times moody to the \npoint of being almost frightening. Disc Four's highlights, in addition to \nanother alternate theme (by Constant), include Fred Steiner's sweetly sad \nscoring for &quot;100 Yards Over The Rim,&quot; which could be one of the best realized \nwestern-flavored television scores of the period, until it switches gears into a \ndarkly ominous mode that one truly would not want to listen to -- fully exposed \nas music -- with the lights out; and Steiner's equally impressive (yet more \nsomber) music for &quot;The Passersby&quot;; and Leonard Rosenman's score for &quot;And When \nThe Sky Was Opened,&quot; which, with its dissonant horn calls, anticipated elements \nof his music for Beneath The Planet Of The Apes seven years later. Franz Waxman \ncompletists will also want to check out the legendary Hollywood composer's score \nfor &quot;Sixteen Millimeter Shrine,&quot; which doesn't sound like anything else ever \nwritten for the show -- capturing Waxman at his most sentimental and romantic \nwith its thick orchestral textures and mix of rich melodies and 1920's period \nscoring, it's closer to a classic film score than anything ever written for the \nseries, or much else from television. The annotation is reasonably thorough as \nwell, and the mastering is excellent, with no signs of serious distortion \nanywhere and a good, healthy volume level throughout, but it's the music that \nmakes this release a must-own set, and a bargain at $44 list.\n\n\n-------------------------------------------------------------------------------\n\n\nThe rip has been done using EAC to extract .wav files, and dBPowerAmp to convert \nthem into Level-8 FLAC files. Log files are enclosed.\n\nThe CDs are presented as ONE SINGLE LONG AUDIO FILE for each CD. There's also a \n.cue file which marks the track points. If you need to extract a single song \nfrom this, you must download the whole album, and use a tool like Medieval Cue \nSplitter for Windows, or X Lossless Decoder (XLD) for Mac Users. Under Linux the \nripping software &quot;abcde&quot; (A better CD encoder) can split CUE/FLAC files.\n\nAlso, you can use Burrrn (on Windows) to burn it directly to a CD, where the\ntracks will be seperated.\n\nAttention: Single .cue/FLAC files. That's simply my personal choice for \nreleasing it, don't argue about it, thanks. IF you don't like it, you've been \nclearly told, so look somewehere else and don't come crying. It's free, ok? Take \nit as it comes.\n\n\n-------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:c0b9de616a1ad52f8dab5503b828a68f67faf8ed","amp;dn":"OST+-+Twilight+Zone+%28The+40th+Anniversary+Collection%29+%5BEAC-CUE-F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0b9de616a1ad52f8dab5503b828a68f67faf8ed","infoHashBuffer":{"type":"Buffer","data":[192,185,222,97,106,26,213,47,141,171,85,3,184,40,166,143,103,250,248,237]},"announce":[],"urlList":[]}}