{"title":"Adsorption from Solutions of Non-Electrolytes","uid":14428888,"size":10724970,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c1337a0cf286c515502d9296cbe33a7f56974ece&amp;dn=Adsorption+from+Solutions+of+Non-Electrolytes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1461592482,"description":"Adsorption from Solutions of Non-Electrolytes - J. J. Kipling (AP, 1965).pdf\r\n\r\nAdsorption from Solutions of Non-Electrolytes provides a general discussion of the subject, which has so far been given little or no attention in current textbooks of physical chemistry. A general view of the subject is particularly needed at a time when we wish to see how far it will be possible to use theories of solutions to explain the phenomena of adsorption.\r\nThe book opens with an introductory chapter on the types of interface, aspects of adsorption from solution, types of adsorption, and classification of systems. This is followed by separate chapters on experimental methods, adsorption at the liquid-solid interface, adsorption from completely miscible and partially liquids, adsorption of gases and solids from solution, adsorption of polymers, and adsorption in multicomponent systems. Subsequent chapters deal with factors influencing competitive adsorption at the liquid-solid interface. adsorption at the liquid-vapor and liquid-liquid interface, kinetics and thermodynamics of adsorption from the liquid phase, the use of columns in adsorption, and use of adsorption from solution to measure surface area","torrent":{"xt":"urn:btih:c1337a0cf286c515502d9296cbe33a7f56974ece","amp;dn":"Adsorption+from+Solutions+of+Non-Electrolytes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1337a0cf286c515502d9296cbe33a7f56974ece","infoHashBuffer":{"type":"Buffer","data":[193,51,122,12,242,134,197,21,80,45,146,150,203,227,58,127,86,151,78,206]},"announce":[],"urlList":[]}}