{"title":"Prison Architect - Alpha 13b (Mac)","uid":8886492,"size":119950849,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:c16da7d38836d4b1d8e2013572caae4183837f1a&amp;dn=Prison+Architect+-+Alpha+13b+%28Mac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dwarth","files":1,"time":1378475243,"description":"This is the alpha 13b, it's an hotfix of alpha 13.\n\n\n\nPrison Architect alpha13 HOTFIX released\nPostby Chris Â» Mon Sep 02, 2013 1:09 pm\n\nTurns out alpha13 was unlucky for some after all. \n\nAs many of you are aware, we broke the pathfinding quite severely in alpha13. We introduced a bug which would cause the Deployment screen to show a greyed out world, meaning no sectors had been found. This had the knock-on effect that all pathfinding would fail, grinding your prison to a halt. Everyone would just stand around, looking lost. \n\nWe have now released a hotfix that resolves this issue, and a few others. Steam users will be automatically updated (you may need to restart steam). Non-steam users can download the fix from our builds page - just download alpha13 again:  &lt;a href=&quot;\nhttp://www.introversion.co.uk/prisonarc&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.introversion.co.uk/prisonarc&lt;/a&gt; ... uilds.html \n\nThe new version number in the main menu should be &quot;alpha13b&quot;. \n\n\nHere is a full list of changes in alpha13b: \nCODE: SELECT ALL\n- Fixed: Critical bug with deployment system, resulting in a failure to subdivide the map into sectors.\nThis caused most pathfinding within the game to fail, grinding the prison to a halt.\n\n- Fixed: Punishments maxed out at five hours, regardless of what you set in the Policy screen\n\n- Fixed: Patrol positions were not being saved properly\n\n- Fixed: Bug in the laundry system that prevented prisoners from changing into clean uniforms\n\n- There is now a tooltip in the Patrols screen, to make it clearer how to assign guards to patrols\n\n\n\nDig Dig Dig! This one's all about tunnelling. Given a spoon or any other tool-esque item and they'll start from their toilets and keep on digging until they're outside the perimeter. You can find them by searching the prisoner or cell, but it may be worth moving those maxsec blocks a little further from the edge of your prisons.....\n\nWe've also produced a punishment policy table where you can decide the appropriate reaction to an infraction. 2 weeks in the slammer for moaning about the chow? Tough, but don't let us stop youÎ“Ã‡Âª\n\n\n= Escape tunnels\nPrisoners can now dig escape tunnels when they are supposed to be sleeping\nThey will dig from the toilet in their cell outwards, avoiding buildings and walls as best they can\nThey will tend to dig along water pipes, especially large pipes, because these make the job much quicker\nThey require a digging tool stolen from somewhere in the prison, and will stash this in their cell\nSearching a prisoner or his cell whilst he is tunnelling will reveal the tunnel \nPrisoners are motivated to dig escape tunnels if they fear for their lives (dangerous prison AND non-violent inmate),\nor if they have a very high Freedom need, meaning they've been locked up in their cell for days\n\n- New material: Perimeter wall\nThis is an EXPENSIVE new wall type designed to prevent escape tunnels - a very high and very deep wall.\nTunnellers will do their best to dig around it. It can be tunnelled through, but it will take much longer than a normal wall.\nNote: You cannot build utilies through a perimeter wall, and building one will sever any existing utilities in those squares. \n\n- You can remove tunnels you have uncovered by using the new material &quot;Remove Tunnels&quot;\n\n= Policy report\nYou can now control the punishments handed out to prisoners when they fight, escape, destroy things etc.\nThis is unlocked from Bureaucracy by the Chief, and gives you a new &quot;Policy&quot; report.\nYou can also request automatic searching of the prisoner and/or his cell when misconduct occurs. \nEg a prisoner caught with a tool may be digging escape tunnels, so you can auto-search his cell\n\n- Needs system continued \n- Prisoners now have an Environment need, representing the cleanliness of their surroundings. Hire Janitors!\n- Prisoners now have a Privacy need. This can only be discharged by them spending time alone in their own cell.\n- The previous &quot;Defense&quot; need is now called Safety. It charges up when they feel in danger.\nAs a result of these changes, all Prisoner Biographies will be re-generated when you load an alpha-12 or earlier save game.\n\n- Cells, holding cells and solitary cells must now be &quot;Enclosed&quot;, which means surrounded by walls and doors.\nThere will be no more building tons of open cells in a giant indoor area without any walls seperating them.\n\n- You can now perform several different types of search on any object or prisoner:\n- Search Prisoner/Object : Simply searches the prisoner/object and nothing else\n- Search Cell : Searches the prisoner and his cell\n- Search Cell Block : Searches all prisoners and hiding places within the current cell block\n\n- Patrol system update\nWe are changing the patrol system to work differently and better. \nPreviously Guards would auto-follow any patrol within their own sector, but wouldn't go outside the sector\nIn this new system, you must assign guards to a patrol manually by clicking on an existing patrol square\nThe immediate advantage is that you can specify exactly which patrols are walked, and by how many guards\nPatrols can now go through multiple sectors as they are no longer connected. \n\n- Popup Markers have been disabled for Alpha 13, because we broke them really bad\n\n- It now takes 50% longer to serve one year of a prison sentence\n\n- Nav system changes: There should be a lot less failed routing, and entities should now perform better when cut off from the rest of the world.\n\n- The deployment screen now highlights innaccessable areas of your prison in a flashing yellow colour. Build doors!\n\n- The Steam Workshop window now produces the list of subscribed prisons much faster than before. Great for those of us with 50 odd subscriptions!\n\n- Fixed: The starting Deliveries and Garbage zones were being defined wrongly (each square added several times to the room)\t\t","torrent":{"xt":"urn:btih:c16da7d38836d4b1d8e2013572caae4183837f1a","amp;dn":"Prison+Architect+-+Alpha+13b+%28Mac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c16da7d38836d4b1d8e2013572caae4183837f1a","infoHashBuffer":{"type":"Buffer","data":[193,109,167,211,136,54,212,177,216,226,1,53,114,202,174,65,131,131,127,26]},"announce":[],"urlList":[]}}