{"title":"People's History of the United States","uid":4163546,"size":287262561,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c203097df475f8faf1f4e192629468c262b9ea21&amp;dn=People%5C%27s+History+of+the+United+States&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fervor","files":8,"time":1209496544,"description":"This is Zinn&amp;#039;s interpretation of U.S. history from the perspective of the common, the poor, and the oppressed.  The story of the entire world has almost always been told by and about the powerful elite.  This is surely not an American phenomenon but a worldwide one.  When we think of the grandeur of Rome and the Pax Romana, we rarely think of the squalor and border wars that supported it.  Zinn has laid open this often ignored aspect of history, at least for the United States.\n\nWhile I&amp;#039;m not sure that everything that elite people do is necessarily evil, this book is definitely worthy to balance the bulk of history taught in any school dominated by a government.  Next time you visit some historical site, the Egyptian or Mayan pyramids, the palace at Versailles, the Taj Mahal, or the Great Wall, consider the elite who insisted on these structures, and their realistic relationship with those who provided the labor and taxes.  Only the wildest fairy tales could make them sound friendly.\n\nShifting the focus back to European-America, we have our history of enslavement of Indians and Africans, economic oppression leading to profitable mines and railroads for the robber barons, imperialistic wars that were unpopular among common Americans, etc.  While many &amp;#039;facts&amp;#039; in this book are legitimately disputed, this book is important not for its &amp;#039;facts&amp;#039; but for its fresh way of approaching history.  History shouldn&amp;#039;t be just about kings, leaders of movements, and thinkers.  This is a history for the laborers, the oppressed, the murdered, and the otherwise disenfranchised.  When so many of our schools are run by so few institutions, we need more things like this for balance.","torrent":{"xt":"urn:btih:c203097df475f8faf1f4e192629468c262b9ea21","amp;dn":"People%5C%27s+History+of+the+United+States","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c203097df475f8faf1f4e192629468c262b9ea21","infoHashBuffer":{"type":"Buffer","data":[194,3,9,125,244,117,248,250,241,244,225,146,98,148,104,194,98,185,234,33]},"announce":[],"urlList":[]}}