{"title":"Teaching At Home: A New Approach To Tutoring Children With Autis","uid":8467672,"size":2076273,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c22f5b0d3e650807fa61b7106f956d921b7a1255&amp;dn=Teaching+At+Home%3A+A+New+Approach+To+Tutoring+Children+With+Autis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ariane_c","files":1,"time":1368401321,"description":"Teaching At Home: A New Approach To Tutoring Children With Autism And Asperger Syndrome\n\nPublisher:  Jessica Kingsley Pub (April 30, 2005) PDF 128 pages\n\nFaced with the apparent inability of her autistic son Billy to learn and socialize with other children at school, Olga Holland decided to teach him at home. Where traditional educational approaches had produced limited results, the author's own method of teaching succeeded, over a period of two years, in enabling Billy to pass the test that allowed him to enter a class for gifted children. Teaching at Home explains the author's approach, focused on adapting to the demands of Billy's atypical mind and respecting his vivid imaginative world while attracting and retaining his attention. The author describes her use of sensory and memory techniques, social stories and humour, and gives useful advice on issues such as understanding body language, adapting the teaching environment, devising homework schedules and coping with distractions. This book offers inspiration and encouragement for parents of children with autism or Asperger Syndrome who are considering homeschooling their children, and also provides useful pointers for teachers and carers.\nAbout the Author\n\nOlga Holland was born in the former Soviet Union, where she was trained as an economist. Due to her insistence on exercising her constitutional rights as a Soviet citizen, she was labelled a political dissident, and in 1986 the authorities suggested that she emigrate. She moved to the US, where she married and had two children. Her son, Billy, born in 1993, was diagnosed as autistic when he was four years old. He now attends mainstream school with an aide, and is in a public school class for gifted and talented children. Olga is the author of The Dragons of Autism, also published by Jessica Kingsley Publishers.","torrent":{"xt":"urn:btih:c22f5b0d3e650807fa61b7106f956d921b7a1255","amp;dn":"Teaching+At+Home%3A+A+New+Approach+To+Tutoring+Children+With+Autis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c22f5b0d3e650807fa61b7106f956d921b7a1255","infoHashBuffer":{"type":"Buffer","data":[194,47,91,13,62,101,8,7,250,97,183,16,111,149,109,146,27,122,18,85]},"announce":[],"urlList":[]}}