{"title":"Victoria Spivey - Complete (Document) Recordings 1926-1937","uid":4773851,"size":274996864,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c38a665eb9c0d1154cc0a486cb5eec3c3bccca3a&amp;dn=Victoria+Spivey+-+Complete+%28Document%29+Recordings+1926-1937&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"beoram","files":-1,"time":1237140994,"description":"VICTORIA SPIVEY - *Complete Recorded Works, 1926-1937*\n\n[Vol. 1] The first of four Document CDs that contain all of singer Victoria Spivey's pre-war recordings has her first 23 sides. Spivey made her initial reputation with her series of dark blues that were full of symbolism, such as her trademark &quot;Black Snake Blues&quot; -- snakes and tuberculosis were common topics in her lyrics. Her first four selections were recorded in St. Louis from May 11-13, 1926 (she was 19 at the time) and then she relocated to New York. Spivey is heard backed by several ensembles led by pianist John Erby in August 1926 (including her first meetings with guitarist Lonnie Johnson) and on five pieces in October 1927 with Johnson and pianist Porter Grainger. By the time the latter sides were recorded, her style was becoming a little more lighthearted and softer but no less powerful. Among the highlights of this superior set are &quot;Black Snake Blues,&quot; &quot;Hoodoo Man Blues,&quot; &quot;Spider Web Blues,&quot; &quot;Got the Blues So Bad,&quot; &quot;The Alligator Pond Went Dry,&quot; &quot;T-B Blues&quot; and &quot;Garter Snake Blues.&quot; This is highly recommended, as are the other three CDs in this important series. ~ Scott Yanow, All Music Guide\n\n[Vol. 2] Victoria Spivey, who made her initial reputation with dark and somewhat scary blues lyrics, altered her style during the period covered by this second of four &quot;complete&quot; Document CDs. She is heard in a series of double-entendre songs (usually issued in two parts) with singer/guitarist Lonnie Johnson, including &quot;New Black Snake Blues,&quot; &quot;Toothache Blues,&quot; &quot;Furniture Man Blues&quot; and &quot;You Done Lost Your Good Thing Now.&quot; Also, Spivey is heard with an all-star group led by pianist Clarence Williams (including cornetist King Oliver and guitarist Eddie Lang) that unfortunately does not get much space to stretch out; on two classic performances (&quot;Funny Feathers&quot; and &quot;How Do You Do It that Way&quot;) on which she is joined by Louis Armstrong's Savoy Ballroom Five (with pianist Gene Anderson in Earl Hines' place); and guesting on two versions apiece of those two same songs with Henry &quot;Red&quot; Allen's Octet (which was really Luis Russell's Orchestra). Spivey, who was a strong singer from the start, is featured throughout in peak form, showing that she could not only sing blues but good-time jazz of the era. ~ Scott Yanow, All Music Guide\n\n[VOl. 3] Victoria Spivey's ability to evolve with the times and often reinvent her style can be heard throughout the third of four CDs in Document's reissuance of her prewar recordings. She is heard singing classic blues on four numbers with an all-star group drawn from Luis Russell's Orchestra (including trumpeter Red Allen and trombonist J.C. Higginbotham) and on four other songs in which she is just backed by pianist Russell and guitarist Will Johnson. She investigates double-entendre blues with the assistance of pianist/vocalist Porter Grainger and (for the two-part &quot;Mama's Quittin' and Leavin'&quot;) with guitarist/singer &quot;Funny Paper&quot; Smith. For a 1931 date, Spivey does her take on hokum (particularly on &quot;He Wants Too Much&quot;) with the help of pianist Georgia Tom Dorsey and guitarist Tampa Red. And on &quot;Dreaming 'Bout My Man&quot; she is backed by the pre-swing big band Hunter's Serenaders. This volume concludes by jumping ahead five years and featuring Spivey singing quite confidently with a first-rate Chicago-based swing band (including &quot;Black Snake Swing&quot;). Although not quite as essential as the first two volumes in this series, this set (and Vol. 4) is also easily recommended. ~ Scott Yanow, All Music Guide\n\n[Vol. 4] Victoria Spivey is best remembered today for her recordings in the 1920s and for her work with her Spivey label in the 1960s, but she also made a fairly extensive series of records from 1936-37. The final of her four Document CDs has all of the latter except for a few titles included on Vol. 3. The 22 cuts include ten previously unreleased performances. Spivey is joined by a variety of Chicago-based musicians on four of the five sessions: either Lee Collins (who gets carried away in spots) or Sheiks on trumpet; sometimes the erratic clarinetist Arnett Nelson; and a rhythm section with either Dorothy Scott, Black Bob, J.H. Shayne, Aletha Robinson or Addie &quot;Sweet Pease&quot; Spivey on piano. (Big Bill Broonzy plays guitar on one session.) In addition, Spivey is heard on a New York date with five musicians who were with the Luis Russell Orchestra (which had become Louis Armstrong's backup group): pianist Russell, trumpeter Henry &quot;Red&quot; Allen, clarinetist Albert Nicholas, altoist Charlie Holmes and bassist Pops Foster. Throughout, Spivey's voice is in fine form with the music ranging from good-time music to Chicago-style blues. Highlights include &quot;Mr. Freddie Blues,&quot; &quot;Trouble in Mind,&quot; &quot;Detroit Moan,&quot; &quot;I Ain't Gonna Let You See My Santa Claus,&quot; &quot;One Hour Mama&quot; and &quot;Good Cabbage.&quot; Although not as essential as her earlier work, this CD is worth picking up. It seems strange that Spivey (who up to the late 1930s managed to stay fairly up-to-date) did not hook up with a swinging big band; instead, she would not record again until 1961. ~ Scott Yanow, All Music Guide","torrent":{"xt":"urn:btih:c38a665eb9c0d1154cc0a486cb5eec3c3bccca3a","amp;dn":"Victoria+Spivey+-+Complete+%28Document%29+Recordings+1926-1937","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c38a665eb9c0d1154cc0a486cb5eec3c3bccca3a","infoHashBuffer":{"type":"Buffer","data":[195,138,102,94,185,192,209,21,76,192,164,134,203,94,236,60,59,204,202,58]},"announce":[],"urlList":[]}}