{"title":"Danny Barnes - Dirt on the Angel [2003][EAC,log,cue. FLAC]","uid":8971734,"size":361906670,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c4663ae3df0e57f556528689bc3840d494ea733d&amp;dn=Danny+Barnes+-+Dirt+on+the+Angel+%5B2003%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"dickspic","files":17,"time":1380344051,"description":"Artist:Danny Barnes\nRelease:Fire &amp; Fortune \nReleased: 2003\nLabel: Terminus Records\nCatalog#: 0303-2\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: americana\n\n\n1. Life in the Country\t 3:47\t\n2. Get it While You Can\t3:53\t\n3. Dirt on the Angel\t5:22\t\n4. Water Wagon\t4:00\t\n5. Keep My Skillet Good and Greasy\t2:33\t\n6. I Likes My Chicken Hot\t3:09\t\n7. Kichen Floor Waltz\t3:21\t\n8. Face to Face\t5:13\t\n9. Bluegrass Suicide\t3:04\t\n10. Barnes Away\t3:14\t\n11. Ooh La La\t2:44\t\n12. Popcorn and Wine\t3:52\t\n13. Trinidad Hubbard\t3:56\t\n14. Peanut Butter is a Man's Best Friend\t4:34\n15. Loser\t5:34\n\nOn Dirt on the Angel, his fourth outing, multi-instrumentalist Danny Barnes, formerly of the Austin, TX-based Bad Livers, soldiers on mining the tradition for new songs while displaying an eclecticism that's nothing less than endearing and simultaneously visionary. With the help of a band that includes Bill Frisell, Chuck Leavell, and Darol Anger (Barnes was/is a part of Frisell's group the Willies), Barnes' own songs, such as &quot;Life in the Country&quot; and &quot;Get It While You Can,&quot; the two opening tracks in sequence, display Barnes' high lonesome gutbucket funky bluegrass. With a voice that resembles Leon Russell and a banjo delivery that is closer to Roscoe Holcomb and Dock Boggs than Earl Scruggs, Barnes keeps it close to the heart of the heart of the country. On a cut such as the title track, Frisell's lyrical gift and Leavell's gorgeous wide-open chord voicings color a lament that is both haunting and bittersweet and sounds as if it could have been produced by Daniel Lanois. The wide-open country-rock of &quot;Water Wagon,&quot; a paean to sobriety, gives a nod to the Band's pastoral Arcadian blues and features a stunning fiddle solo by Anger. The cover of the traditional &quot;Keep My Skillet Good and Greasy,&quot; made infamous by Uncle Dave Macon in the 1930s, is rendered here as nasty and lonesome as is possible in a new millennium. But the most telling moment is a cover of &quot;Ooh La La&quot; by the late Ronnie Lane and Ronnie Wood of the Faces. Lane taught the song to Barnes, and here it is tenderly yet not overly reverently rendered, full of humor and warmth, offering a portrait of Lane as the musician he truly was -- somebody as close to the country as he was to the roots of rock (and perhaps why he and Ian McLagan relocated to Austin). Gritty swing makes an appearance in &quot;I Likes My Chicken Hot,&quot; and a woolly cover of Beck Hansen's &quot;Loser&quot; closes the 14-song set with a sampladelic pasting of Macon's reading of &quot;Keep My Skillet Good and Greasy&quot; to anchor the weight of the tune and make it a hillbilly blues song with sound effects. Dirt on the Angel is easily the most focused -- and fun --outing of Barnes' solo career thus far.","torrent":{"xt":"urn:btih:c4663ae3df0e57f556528689bc3840d494ea733d","amp;dn":"Danny+Barnes+-+Dirt+on+the+Angel+%5B2003%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4663ae3df0e57f556528689bc3840d494ea733d","infoHashBuffer":{"type":"Buffer","data":[196,102,58,227,223,14,87,245,86,82,134,137,188,56,64,212,148,234,115,61]},"announce":[],"urlList":[]}}