{"title":"Oxford History of the British Empire (5 vols.)","uid":11117526,"size":55282676,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c530bb525563e35dd0f0402d036f9719446a67ad&amp;dn=Oxford+History+of+the+British+Empire+%285+vols.%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1411866595,"description":"\nTHE OXFORD HISTORY OF THE BRITISH EMPIRE (Oxford University Press, 1998-99).  5 volumes.  Wm. Roger Lewis, Editor-in-Chief. -- PDF\n\n   * Volume I: The Origins of Empire: British Overseas Enterprise to the Close of the Seventeenth Century (1998).  Edited by Nicholas Canny.  554 pp.\n\n   * Volume II: The Eighteenth Century (1998).  Edited by P. J. Marshall.  662 pp.\n\n   * Volume III: The Nineteenth Century (1999).  Edited by Andrew Porter.  796 pp.\n\n   * Volume IV: The Twentieth Century (1999).  Edited by Judith Brown and Wm. Roger Louis.  800 pp.\n\n   * Volume V: Historiography (1999).  Edited by Robin Winks.  756 pp.\n\n\nTHE OXFORD HISTORY OF THE BRITISH EMPIRE is a major assessment of the Empire in the light of recent scholarship and the progressive opening of historical records.  It deals with the interaction of British and non-western societies from the Elizabethan era to the late twentieth century, provides a balanced treatment of the ruled as well as the rulers, and takes into account the significance of the Empire for the peoples of the British Isles.  All five of the volumes in this series fully explore economic and social as well as political trends.\n\nVolume I explores the origins of empire.  It shows how and why England, and later Britain, became involved with transoceanic navigation, trade, and settlement during the sixteenth and seventeenth centuries.  The chapters, by leading historians, both illustrate the interconnections between developments in Europe and overseas and offer specialist studies on every part of the world that was substantially affected by British colonial activity.  As late as 1630 involvement with regions beyond the traditional confines of Europe was still tentative; by 1690 it had become a firm commitment. \n\nVolume II examines the history of British worldwide expansion from the Glorious Revolution of 1689 to the end of the Napoleonic Wars, a crucial phase in the creation of the modern British Empire.  This was the age of General Wolfe, Clive of India, and Captain Cook.  The international team of experts deploys the latest scholarly research to trace and analyze development and expansion over more than a century.  They show how trade, warfare, and migration created an Empire, at first overwhelmingly in the Americas but later increasingly in Asia.  Although the Empire was ruptured by the American Revolution, it survived and grew into the British Empire that was to dominate the world during the nineteenth and early twentieth centuries.\n\nVolume III covers the long nineteenth century, from the achievement of American independence in the 1780s to the eve of world war in 1914.  This was the period of Britain's greatest expansion as both empire-builder and dominant world power.  The volume is divided into two parts.  The first contains thematic chapters, some focusing on Britain, others on areas at the imperial periphery, exploring those fundamental dynamics of British expansion which made imperial influence and rule possible.  They also examine the economic, cultural, and institutional frameworks which gave shape to Britain's overseas empire.  Part 2 is devoted to the principal areas of imperial activity overseas, including both white settler and tropical colonies.  Chapters examine how British interests and imperial rule shaped individual regions' nineteenth-century political and socio-economic history.  Themes dealt with include the economics of empire, imperial institutions, defence, technology, imperial and colonial cultures, science and exploration.  Attention is given not only to the formal empire, from Australasia and the West Indies to India and the African colonies, but also to China and Latin America, often regarded as central components of a British &quot;informal empire&quot;.\n\nVolume IV considers many aspects of the 'imperial experience' in the final years of the British Empire, culminating in the mid-century's rapid processes of decolonization.  It seeks to understand the men who managed the empire, their priorities and vision, and the mechanisms of control and connection which held the empire together.  There are chapters on imperial centres, on the geographical 'periphery' of empire, and on all its connecting mechanisms, including institutions and the flow of people, money, goods, and services.  The volume also explores the experience of 'imperial subjects' in terms of culture, politics, and economics; an experience which culminated in the growth of vibrant, often new, national identities and movements and, ultimately, new nation-states.  It concludes with the processes of decolonization which reshaped the political map of the late twentieth-century world.\n\nVolume V shows how opinions have changed dramatically over the generations about the nature, role, and value of imperialism generally, and the British Empire more specifically.  The distinguished team of contributors discuss the many and diverse elements which have influenced writings on the Empire: the pressure of current events, access to primary sources, the creation of relevant university chairs, the rise of nationalism in former colonies, decolonization, and the Cold War.  They demonstrate how the study of empire has evolved from a narrow focus on constitutional issues to a wide-ranging enquiry about international relations, the uses of power, and impacts and counter-impacts between settler groups and native peoples.  The result is a thought-provoking cultural and intellectual inquiry into how we understand the past, and whether this understanding might affect the way we behave in the future.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                        &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:c530bb525563e35dd0f0402d036f9719446a67ad","amp;dn":"Oxford+History+of+the+British+Empire+%285+vols.%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c530bb525563e35dd0f0402d036f9719446a67ad","infoHashBuffer":{"type":"Buffer","data":[197,48,187,82,85,99,227,93,208,240,64,45,3,111,151,25,68,106,103,173]},"announce":[],"urlList":[]}}