{"title":"The.Nature.of.Things.One.Ocean.1of4.The.Birth.of.an.Ocean.720p.H","uid":11042005,"size":1043609149,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:c63cd87398e7eb43ec17d5e5cdebd628673b3ec8&amp;dn=The.Nature.of.Things.One.Ocean.1of4.The.Birth.of.an.Ocean.720p.H&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MVGroup","files":-1,"time":1410876762,"description":"One Ocean\n\nNature Documentary hosted by David Suzuki, published by CBC broadcasted as part of CBC The Nature of Things series in 2010 - English narration\n\n\n\nInformation\n------------------------------\n\nOne Ocean\n\nThe Series Description \n\nOne Ocean is an ambitious, provocative and stunning four-part documentary series that portrays the ocean more completely than ever before, revealing its awesome beauty and extraordinary power. The series, special effects and striking pictures shot in HD explores how it is that the ocean holds the very key to all life within its silent and shadowy depths. In each breathtaking episode we bring to life a vast, interconnected ecosystem: from the diversity and significance of microscopic plankton, to the sleek power of the Ocean's top predators. \nOne Ocean joins expeditions of discovery that take us to tropical coasts, to the deep, churning sea, and to meet strange and mysterious marine life that most of us will never get to see. We reveal a secret world beneath the water's surface: energized with purpose, order, and the drama of survival. Complex environments inhabited by an astounding array of life forms, alternately splendid and graceful, are revealed like never before. Disarming, bizarre and plainly profound - One Ocean bears witness a world that is at once intricately beautiful and achingly vulnerable.\n\n\n1)  The Birth of an Ocean \nIn The Birth of an Ocean we travel back to ancient time, telling the story of the ocean's turbulent beginnings, and its successive incarnations. It's a journey that introduces the enormity of the ocean over space and time - at four billion years old the ocean is nearly as old as the planet itself. In a remote part of Western Australia, we venture to the stunning, crystal blue waters that harbour the descendants of the first life on earth. These formations once covered the ancient seabed, and today they give scientists a remarkable window back in time. Traveling forward, we discover that almost 99.9% of species that ever lived on this planet are now extinct. On the lush and diverse Osprey Reef, we swim alongside scientists to learn why one remarkable creature - the nautilus - has survived, for millions of years, what countless other species could not. In The Birth of an Ocean we trace our own profound connections to the ocean with Tiktaalik , the &quot;fish-a-pod&quot; that scientists believe is the missing link between the ocean and all limbed creatures, including us.\n\n2)  Footprints in the Sand \nIn our second episode, Footprints in the Sand, we take measure of humanity's impact on the sea since we first settled along its coasts over 150,000 years ago. We travel to the Mediterranean Sea with local Spanish fishermen in search of the magnificent bluefin tuna, the most prized fish in the ocean. It's also one of the most overfished. As fishermen try to maintain their centuries-old method of fishing, conservation scientists are desperate to find hard evidence to support their side in the heated debate over quotas. Human activity through history - first overfishing, then over-development of the world's coastlines, and the continuing pollution that we pour into the sea - have had unexpected consequences. But as Footprints in the Sand reveals, marine protected areas can have a huge impact on an ecosystem's ability to recover. Zanzibar is a place where the people have always depended on fish for their survival. There, locals are finding ways to live in balance with the ocean by using more sustainable approaches to their harvests, and also by creating a sense of communal ownership and stewardship. In New Zealand, we discover that ocean areas which are now protected have experienced an extraordinary turn-around - where once sea urchins had taken over and destroyed the reefs and kelp forests, top predators have returned and the stunning reef has been restored to its full glory.\n\n3)  Mysteries of the Deep \nEpisode Three of our series reveals the Mysteries of the Deep and takes us to the most beguiling parts of the sea, the very depths that we know so little about. As we improve our technological prowess, we are venturing deeper and deeper into the planet's last frontier. What scientists are discovering is beyond our wildest imaginings. We join a team of scientists, ranging from biologists to vulcanologists, on an international expedition as they return to the Mariana Arc, on the Pacific Rim of Fire. As their submersible ROV plumbs the depths of the ocean, the thrill and excitement of peering into these extreme environments is palpable. Each day they make new discoveries about the outlandish deep-sea dwellers they find here. But at the same time that we begin to unravel their mysteries we're also mining the sea of many species. Finally Mysteries of the Deep asks the question: can cutting-edge technologies allow us to truly experience, for the first time, the three-dimensional world of the deep ocean?\n\n4)  The Changing Sea \nIn our final episode, The Changing Sea , we discover that the ocean is sending us clear signals. Off the rugged and beautiful coast of British Columbia we meet scientists and fishermen who are shocked at the recent arrival of a voracious new creature - the Humboldt squid. This monster-sized squid native to the equatorial waters of Mexico has moved north and ushered in a cascade of changes to the ecosystem. Their arrival is part of a disturbing pattern that is emerging with species movement being tracked around the world. In The Changing Sea we illustrate how the ocean's chemistry and systems are being compromised by increased acidity, less oxygen and warming temperatures. The changes to the timeless rhythms of birth and renewal are being felt everywhere - even on coral reefs. In the idyllic waters of the Bay of Naples, we get a glimpse of our future ocean, thanks to the mythic Mount Vesuvius. As scientists swim through lush green seagrass beds, they collect creatures whose shells are dissolving, and we discover that this amazing place has a terrible secret. It has been naturally acidified for millennia - could this be our ocean's future?\n\n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;723a1b151a323e465c43&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 3173 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280 x 720\n * Audio Codec: AAC LC\n * Audio English\n * Audio Bitrate: 160 Kbps VBR 48KHz\n * Audio Channels: Stereo 2\n * Run-Time: 45mins\n * Framerate: 29FPS\n * Number of Parts: 4\n * Container Mp4\n * Part Size: average 995 MB\n * Source: HDTV\n * Encoded by: Harry65\n","torrent":{"xt":"urn:btih:c63cd87398e7eb43ec17d5e5cdebd628673b3ec8","amp;dn":"The.Nature.of.Things.One.Ocean.1of4.The.Birth.of.an.Ocean.720p.H","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c63cd87398e7eb43ec17d5e5cdebd628673b3ec8","infoHashBuffer":{"type":"Buffer","data":[198,60,216,115,152,231,235,67,236,23,213,229,205,235,214,40,103,59,62,200]},"announce":[],"urlList":[]}}