{"title":"Corbin Fisher - - - Kip Fucks Shaun ((MictrmbL))","uid":5165276,"size":243333757,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:c64c333dd2e721132617920cff066d51d6e52a19&amp;dn=Corbin+Fisher+-+-+-+Kip+Fucks+Shaun+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mictrmbl","files":39,"time":1258330320,"description":"From the vaults of Corbin Fisher:\n\n\nThere's absolutely no doubt, throughout this video, that Kip and Shaun were turned on by one another, into one another, and horny as all hell!\n\nWhy is a video with hardcore fucking coming up on a Tuesday!? Well, fucking is only part of the story, here! Sure, Kip's hot cock plunges in and out of Shaun deep and hard and drives him over the edge to a powerful orgasm; of course, Shaun's ass looks insanely hot while getting plowed by Kip; absolutely, Kip loved every second of pounding Shaun and Shaun loved every second of being pounded, but it's everything that leads up to the fucking that makes this video that much hotter!\n\nThese studs are kissing each other, cocks are being swallowed, tongues are getting sucked on, hands are all over the place, and the body contact is intense from the get go!\n\nThis is the kind of sex these two studs would have in their dorm rooms - getting so worked up and lost in the foreplay and kissing that by the time they get around to fucking they're both hovering on the edge of orgasm. It's like they knew they were going to fuck and wanted to fuck, but were having so much fun leading up to that point that they didn't want to stop with the foreplay too soon! Yum :)\n\nIt's been too long since we've seen either Shaun or Kip, and this video is a great way for all of us to be reminded of what hotties they are! ","torrent":{"xt":"urn:btih:c64c333dd2e721132617920cff066d51d6e52a19","amp;dn":"Corbin+Fisher+-+-+-+Kip+Fucks+Shaun+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c64c333dd2e721132617920cff066d51d6e52a19","infoHashBuffer":{"type":"Buffer","data":[198,76,51,61,210,231,33,19,38,23,146,12,255,6,109,81,214,229,42,25]},"announce":[],"urlList":[]}}