{"title":"House AND Philosophy AND Psychology Audios (ONLY 1 PDF)","uid":8236503,"size":534248389,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c71ff28a203d275dbaf8c957b555d8f24c0b6b41&amp;dn=House+AND+Philosophy+AND+Psychology+Audios+%28ONLY+1+PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hombrep","files":-1,"time":1362851363,"description":"House AND Psychology (ONLY AUDIO - MP3)\n\n(IF YOU GUYS FIND THE E-BOOK, PLEASE BE KIND TO ADD THE LINK AT THE COMMENTS)\n\nHouse and Psychology: Humanity Is Overrated\n\nEditorial Reviews\nReview\n&quot;...mixes solid research with entertaining fiction.  I was already a House fan before reading this book, but I'd venture to say that readers unfamiliar with the series would also enjoy these essays, the same way they would enjoy a collection of juicy case studies.&quot;\n  --Elissa Malcohn, PsychCentral.com\n\n\n&quot;It entertains as it enlightens.&quot;  --Barnes &amp; Noble review\n\n&quot;This book should be read by all 'House' fans... People who just enjoy a good read will find this an enjoyable book -- sometimes annoying, sometimes funny -- but never dull. Kinda like House himself.&quot;  --New Journal of Books\n\n&quot;The bottom line is that if you like the TV show, you will probably love this book. If you don't like the show -- or have never watched it -- be forewarned, you probably will after reading 'House and Psychology.'&quot;   -- studentaffairsenews.com\n\n&quot;The latest psychological research (including the most up-to-date studies on addiction) is combined with psychological theory. Liberally peppered with scenes and quotes from episodes, it is great fun to read.&quot;  --\nFrom the Back Cover\nDoes House use humor to mask his true self?\n\nAt what point does an indulgence become an addiction?\n\nCan anything make Taub happy?\n\nHow does Cameron's past affect all of her future relationships?\n\nWhy does everyone lie?\n\nGregory House is a medical genius and a Sherlock Holmesian figure, but he's also a self-destructive, deeply troubled misanthrope. What is it about this angry, arrogant curmudgeon that is so appealing to us? House and Psychology offers a fascinating psychological profile of Gregory House and his team at Princeton-Plainsboro Hospital. Is House a hero or an antihero? Does Wilson need House's emotional support? Are all of the relationships on this show doomed to fail? The answers to these questions allow us to appreciate our favorite characters more deeply but also serve as a crystal-clear window into our own behavior. Why do we deceive people? How do we define addiction? Can we help others without expecting anything in return? Combining psychological theory with the latest in psychological research, House and Psychology lets us understand what makes this show tick.\n\nSee all Editorial Reviews\nProduct Details\nPaperback: 336 pages\nPublisher: Wiley; 1 edition (October 4, 2011)\nLanguage: English\nISBN-10: 0470945559\nISBN-13: 978-0470945551\n\n\nHouse AND Philosophy (Both Audio and Pdf)\n\n\nHouse and Philosophy: Everybody Lies\n\nEditorial Reviews\nFrom the Back Cover\nPhilosophy/Pop Culture\n\nIs being nice overrated?\n\nAre we really just selfish, base animals crawling across Earth in a meaningless existence?\n\nWould reading less and watching more television be good for you?\n\nIs House a master of Eastern philosophy or just plain rude?\n\nDr. Gregory House is arguably the most complex and challenging antihero in the history of television, but is there more to this self-important genius than gray matter and ego? This book takes a deeper look at House to reveal the philosophical underpinnings of this popular medical drama and its cane-waving curmudgeon's most outrageous behavior. What emerges is a remarkable character who is part Sherlock Holmes, part Socratic philosopher, part Nietzschean superman, part Taoist rhetorician, and not at all as screwed up as you might think. With everything from Aristotle to Zen, House and Philosophy takes an engaging look at everyone's favorite misanthropic genius and his team at Princeton-Plainsboro Hospital.\n\nAbout the Author\nHENRY JACOBY teaches philosophy at East Carolina University. He has published articles on the philosophy of mind and contributed to South Park and Philosophy. He lives in Goldsboro, North Carolina, with his wife, Kathryn, and their two cats, Bunkai and Willow.\nWILLIAM IRWIN is a professor of philosophy at King's College, Pennsylvania. He has coedited The Simpsons and Philosophy and edited Seinfeld and Philosophy, The Matrix and Philosophy, and Metallica and Philosophy.\n\nProduct Details\nPaperback: 272 pages\nPublisher: Wiley; 1 edition (December 3, 2008)\nLanguage: English\nISBN-10: 0470316608\nISBN-13: 978-0470316603\n\n","torrent":{"xt":"urn:btih:c71ff28a203d275dbaf8c957b555d8f24c0b6b41","amp;dn":"House+AND+Philosophy+AND+Psychology+Audios+%28ONLY+1+PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c71ff28a203d275dbaf8c957b555d8f24c0b6b41","infoHashBuffer":{"type":"Buffer","data":[199,31,242,138,32,61,39,93,186,248,201,87,181,85,216,242,76,11,107,65]},"announce":[],"urlList":[]}}