{"title":"Grigg-Global Gun Grab-UN Campaign to Disarm Americans(2001)","uid":4546262,"size":608794,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c916e3be4b90f6f5773ae51162d27144135a056b&amp;dn=Grigg-Global+Gun+Grab-UN+Campaign+to+Disarm+Americans%282001%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"red_gonzo","files":1,"time":1228140216,"description":"This is William Norman Grigg&amp;#039;s shocking book Global Gun Grab - The United Nations Campaign to Disarm Americans (2001) which is a powerful expose of the globalist gun control agenda represented by the United Nations. In a swift-moving account, Grigg takes the reader to bloody Rwanda and to the Balkans for an up-close look at UN-backed civilian disarmament in action. Many have wondered why exactly were there so many civilian victims murdered in most horrible ways you can imagine. A simple fact is enough: they were all disarmed previously and left helpless to die. With thought-provoking prose, the author convincingly demonstrates that the UN and its supporters have the same agenda in store for America. That is, unless concerned citizens take action to get the U.S. out of the UN. Find out how every modern tyranny on this planet was made by first introducing legislative measures to disarm the ordinary man on street and then leaving him completely defenseless to the police state that was soon to follow. So important was this lesson from history that the founding fathers of the American Republic decided to constitutionally protect the right to bear arms for everyone. Completely documented, Global Gun Grab explains why exactly are they after your guns and how millions of naive people all over the world believe that this agenda will actually make the world a safer place to live in. 145 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:c916e3be4b90f6f5773ae51162d27144135a056b","amp;dn":"Grigg-Global+Gun+Grab-UN+Campaign+to+Disarm+Americans%282001%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c916e3be4b90f6f5773ae51162d27144135a056b","infoHashBuffer":{"type":"Buffer","data":[201,22,227,190,75,144,246,245,119,58,229,17,98,210,113,68,19,90,5,107]},"announce":[],"urlList":[]}}