{"title":"Michael J. Totten - The Road to Fatima Gate. The Beirut Spring, ","uid":10161626,"size":2123228,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca36e6746ad0f19872eeb674830de5eaec5764d0&amp;dn=Michael+J.+Totten+-+The+Road+to+Fatima+Gate.+The+Beirut+Spring%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1400303224,"description":"Description\nProduct Details\nBook Title: The Road to Fatima Gate: The Beirut Spring, the Rise of Hezbollah, and the Iranian War Against Israel\t\nBook Author: Michael J. Totten (Author)\nHardcover: 360 pages\nPublisher: Encounter Books (April 5, 2011)\nLanguage: English\nISBN-10: 1594035210\nISBN-13: 978-1594035210\n\n===================================================================================\nBook Description\nThe Road to Fatima Gate is a first-person narrative account of revolution, terrorism, and war during history's violent return to Lebanon after fifteen years of quiet. Michael J. Totten's version of events in one of the most volatile countries in the world's most volatile region is one part war correspondence, one part memoir, and one part road movie.\nHe sets up camp in a tent city built in downtown Beirut by anti-Syrian dissidents, is bullied and menaced by Hezbollah's supposedly friendly &quot;media relations&quot; department, crouches under fire on the Lebanese-Israeli border during the six-week war in 2006, witnesses an Israeli ground invasion from behind a line of Merkava tanks, sneaks into Hezbollah's post-war rubblescape without authorization, and is attacked in Beirut by militiamen who enforce obedience to the &quot;resistance&quot; at the point of a gun.\nFrom the &quot;Cedar Revolution&quot; that ousted the occupying Syrian military regime in 2005, to the devastating war between Israel and Hezbollah in 2006, and to Hezbollah's slow-motion but violent assault on Lebanon's elected government and capital, Totten's account is both personal and comprehensive. He simplifies the bewildering complexity of the Middle East, has access to major regional players as well as to the man on the street, and personally witnesses most of the events he describes. The Road to Fatima Gate should be indispensable reading for anyone interested in the Middle East, Iran's expansionist foreign policy, the Arab-Israeli conflict, asymmetric warfare, and terrorism in the aftermath of September 11.\n\n===================================================================================\nAbout the Author\nMichael J. Totten is an award-winning journalist and prize-winning author whose very first book, The Road to Fatima Gate, won the Washington Institute Book Prize.\nHe has taken road trips to war zones, sneaked into police states under false pretenses, dodged incoming rocket and mortar fire, stayed in some of the worst hotels ever built anywhere, slipped past the hostile side of a front line, been accused of being a spy, received death threats from terrorists, and been mugged by the cops. When he's not doing or writing about these things, he writes novels.\nHis work has appeared in the New York Times, the Wall Street Journal, and The New Republic among numerous other publications, and he's a contributing editor at World Affairs and City Journal. He has reported widely from the Middle East, the former Soviet Union, Latin America, and the Balkans. A former resident of Beirut, he lives in Oregon with his wife and two cats.\n\n===================================================================================\nMost Helpful Customer Review\nOral History of the Modern Middle East: judicious, nuanced, a page-turner\nBy CMC on April 6, 2011\nFormat: Hardcover Verified Purchase\nIt is hard to put down The Road to Fatima Gate. Totten turns arcane subject matter into flowing prose, and lets his subjects speak for themselves.\nMichael Totten is not an academic, and he's not a political activist. He's a concerned American citizen who happens to be an excellent writer. This makes him a journalist, but that title doesn't fully suite him either, because it often implies reporting on deadline. His interest is not in parachuting into a foreign capital, interviewing the most important political actors and academics, writing about it, and leaving.\nTotten truly wants to understand the Middle East. As is apparent in The Road to Fatima Gate, Totten arrived in the region for the first time already well versed in the academic and political theories on Lebanon, Israel, and the Middle East at large. However, those works did not describe the place Totten saw. Lebanon and Israel and the people living there were nothing like what he read in books and saw in the news. The first thing he needed to do was to reorient himself.\nTotten writes that he was apprehensive on arrival in Beirut, but suddenly recognized that the images didn't match the place. A young man in a bar says to him, &quot;You must be crazy to be here.&quot; Totten responds, &quot;&quot;You really think so?&quot; I said. I didn't feel crazy to be there. That feeling passed after twenty-four hours&quot;. But, of course, how could he know for sure? He didn't do what many journalists would have done: run to the politicians and the political risk consultants and the academics. He talked to the people. He went to their houses, dined with them, and drank tea. It seems his stringers were nice people he met along the way who offered to help him understand this complex place.\nTotten recognizes that he could not fully understand the biases of his sources, so he talks to as many people as possible. Despite his initial bias against certain factions, like Hezbollah, Totten talks to them. What makes him different than journalists is that he is not looking to portray an overarching concept in a headline and 2,000 words, ie &quot;Hezbollah Attacks Beirut, Settles Scores,&quot; &quot;Does the US Need Dialogue with Hezbollah?,&quot; &quot;Regional Instability Increases Sectarian Tension in Lebanon.&quot; He will describe those same situations and convey his positions on those matters, but only after letting the people speak for themselves.\nOften times, Totten's sources hang themselves with their words and actions, like when Hezbollah's press relations manager threatens Totten and his photographer, and when Syrian Social Nationalist thugs beat Christopher Hitchens in the middle of a main thoroughfare as Totten tries to rescue him. At other moments, Totten provides a voice to political parties, like the Christian Aounists, little understood in the West (and even within Lebanon). His interviewees appear endearing, and it is left to the reader to recognize their naivete, which Totten often does not need to point out, as he does not selectively quote them and lets them speak for themselves over the course of many pages.\nIn this regard, he is more of an oral historian of the Middle East in the tradition of Studs Terkel than he is a journalist. Totten isn't just telling a story. He is trying to depict lives. An entire chapter is based on a long conversation at a cafe with the previously mentioned Aounists prior to a rally they held alongside Hezbollah to overthrow the government. It is a compelling read, and provides a fair assessment of these Christian men and their motivations for supporting what most Americans believe is a radical Muslim terrorist organization.\nLike Terkel, Totten has his biases, which are apparent in the text, even if he is sometimes not even aware of them. Like any concerned citizen (and even oral historian) writing about a contemporary issue, Totten makes moral judgements, which will upset people who differ with his opinion. However, Totten reveals his thinking and the process through which he made his opinion. Often, the reader is left in agreement: &quot;The spokesman hung himself with his own words,&quot; &quot;That action was unjust,&quot; &quot;They seem to be good people, but misguided.&quot;\nMy only major qualm with the work is due to something out of Totten's control: that he cannot be in two places at one time. Totten covers the 2006 war between Israel and Hezbollah from the Israeli side of the border. At that moment, the road he takes to Fatima Gate is from the south, and he does an excellent job conveying the physical destruction in northern Israeli and giving voice to bombarded Israelis. Not only do those chapters manifest the implications of Lebanon's unstable and violent politics on other countries, but they provide the reader insight into the minds and motivations of Israelis and how much their domestic interests are determined by foreign actors. Totten is so good at conveying the emotions and details of lives that it would have been nice to see effect of that violence on the northern side of the border.\nTotten makes up for it with what I think is his best chapter - the one that reads like an action novel - on the 2008 Hezbollah invasion of Beirut.\nNot only will The Road to Fatima Gate provide readers with fingerspitzengefuhl knowledge of Lebanon, but it will be a fun read, as well.\n===================================================================================","torrent":{"xt":"urn:btih:ca36e6746ad0f19872eeb674830de5eaec5764d0","amp;dn":"Michael+J.+Totten+-+The+Road+to+Fatima+Gate.+The+Beirut+Spring%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca36e6746ad0f19872eeb674830de5eaec5764d0","infoHashBuffer":{"type":"Buffer","data":[202,54,230,116,106,208,241,152,114,238,182,116,131,13,229,234,236,87,100,208]},"announce":[],"urlList":[]}}