{"title":"A Comprehensible Universe {BBS}","uid":7392211,"size":1075391,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cac1adc12647f236df5cddc0509366bdf978383c&amp;dn=A+Comprehensible+Universe+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1340814199,"description":"Why is our world comprehensible? This question seems so trivial that few people have dared to ask it. In this book we explore the deep roots of the mystery of rationality. The inquiry into the rationality of the world began over two-and-a-half-thousand years ago, when a few courageous people tried to understand the world with the help of reason alone, rejecting the comforting fabric of myth and legend. After many philosophical and theological adventures the Greek concept of rationality laid the foundations of a revolutionary way of thinking: the scientific method, which transformed the world. But looking at the newest fruits of the world's rationality - relativity theory, quantum mechanics, the unification of physics, quantum gravity - the question arises: what are the limits of the scientific method? The principal tenet of rationality is that you should never stop asking questions until everything has been answered ...   &quot;A Comprehensible Universe is a thoughtful book by two authors who have professional expertise in physics and astronomy and also in theology. They are exceptionally well informed about the history of the relation between science and theology, and they maintain throughout their discussion a respect for empirical evidence and a dedication to rationality. Even though I do not agree with all of their conclusions on matters of great complexity I am impressed by the fairness of their argumentation.&quot; Abner Shimony, Professor Emeritus of Philosophy and Physics, Boston University\n\n\n# Paperback: 174 pages\n# Publisher: Springer; Softcover reprint of hardcover 1st ed. 2008 edition (December 1, 2010)\n# Language: English\n# ISBN-10: 3642096379\n# ISBN-13: 978-3642096372","torrent":{"xt":"urn:btih:cac1adc12647f236df5cddc0509366bdf978383c","amp;dn":"A+Comprehensible+Universe+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cac1adc12647f236df5cddc0509366bdf978383c","infoHashBuffer":{"type":"Buffer","data":[202,193,173,193,38,71,242,54,223,92,221,192,80,147,102,189,249,120,56,60]},"announce":[],"urlList":[]}}