{"title":"Billy Joel - Greatest Hits Volume III (1997/2015) 24/96","uid":11779800,"size":1740808711,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cd2031a40fd5de8b15e16c4c01ba5ded05b5ead7&amp;dn=Billy+Joel+-+Greatest+Hits+Volume+III+%281997%2F2015%29+24%2F96&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"sidmal","files":20,"time":1427529082,"description":"Billy Joel - Greatest Hits Volume III (1997/2015)\n FLAC (tracks) 24-bit/96 kHz | Time - 76:12 minutes | 1,7 GB\nStudio Master, Official Digital Download | Artwork: Front cover\n\n In his own inimitable fashion, Billy Joel has crafted some of the catchiest pop hits of the '80s and '90s, and most of them--17, to be exact--are on this disc. The jaunty, nostalgic &quot;Keeping the Faith&quot; opens things up, and we cruise right down memory lane with Billy: through the pop-soul of &quot;A Matter of Trust,&quot; the brash, rocking &quot;I Go to Extremes&quot; and &quot;All About Soul&quot; (remixed here to good effect). Joel has grown over the course of his long career, and you can trace his maturity as an artist through these later songs. The tone is a bit darker, a bit edgier than on his earlier tunes. This is an artist who has always been about making pop music, but he's also lived and learned: &quot;You gotta get tough/but that ain't enough/it's all about soul.&quot; Fans will probably agree, and will enjoy this collection immensely.\n\n\n Perhaps it was inevitable that Billy Joel's Greatest Hits, Vol. 3 would pale next to its double-disc predecessor. Greatest Hits, Vols. 1 &amp; 2 covered nine albums (it ignored Cold Spring Harbor), a period during which Joel had 26 Top 100 hits. If it had picked up where the first collection left off, Vol. 3 would have covered three studio albums, which produced 11 hits. That alone would have made a respectable hits collection, and it would have made sense, since The Bridge marked the beginning of a new phase of Joel's career. Instead, the 17-song Vol. 3 begins with a pair of songs from An Innocent Man (&quot;Keeping the Faith,&quot; &quot;An Innocent Man&quot;) that sound entirely different from the material that follows, which finds Joel delving into mechanized, slickly produced adult contemporary pop. The remaining songs don't strictly adhere to his charting hits, substituting such album tracks as &quot;Leningrad,&quot; &quot;Shameless&quot; and &quot;Lullabye (Goodnight, My Angel)&quot; for hits like &quot;Modern Woman,&quot; &quot;That's Not Her Style&quot; and his non-LP cover of Elvis' &quot;All Shook Up.&quot; Even with those missing hits, Greatest Hits, Vol. 3 does summarize Joel's latter career quite well, culling most of his best songs from the time. However, the album ends on a down note, as it adds three new songs, all covers, that are limply produced and colorlessly played. Bob Dylan's &quot;To Make You Feel My Love&quot; -- which Joel decided to perform as if it was a slow, sanitized Blonde on Blonde outtake -- is the best of the trio, but none of them qualify as Joel classics, and they are an inauspicious way to end this chapter of his career.  \n\n\nTracklist:\n\n 01 - Keeping The Faith\n 02 - An Innocent Man\n 03 - A Matter of Trust\n 04 - Baby Grand (Duet with Ray Charles)\n 05 - This Is The Time\n 06 - Leningrad\n 07 - We Didn't Start The Fire\n 08 - I Go To Extremes\n 09 - And So It Goes\n 10 - The Downeaster Alexa\n 11 - Shameless\n 12 - All About Soul (Remix)\n 13 - Lullabye (Goodnight, My Angel)\n 14 - The River Of Dreams\n 15 - To Make You Feel My Love **\n 16 - Hey Girl **\n 17 - Light As The Breeze **\n\n ** - These tracks presented in 24bit/88,2kHz resolution","torrent":{"xt":"urn:btih:cd2031a40fd5de8b15e16c4c01ba5ded05b5ead7","amp;dn":"Billy+Joel+-+Greatest+Hits+Volume+III+%281997%2F2015%29+24%2F96","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd2031a40fd5de8b15e16c4c01ba5ded05b5ead7","infoHashBuffer":{"type":"Buffer","data":[205,32,49,164,15,213,222,139,21,225,108,76,1,186,93,237,5,181,234,215]},"announce":[],"urlList":[]}}