{"title":"Plain White T's - Our Time Now   (2nafish)","uid":5225691,"size":117266436,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cd27f40909a15ede0cc2642e9b5c31c30a238b19&amp;dn=Plain+White+T%5C%27s+-+Our+Time+Now+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1261108261,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Linear PCM, 48000 Hz, Stereo, 1536 kbps\n\n\n&quot;Our Time Now&quot; is the third American single from the Plain White T's from their album Every Second Counts. It was shipped to Pop Radio on November 6, 2007. It peaked at #90 on the Billboard Hot 100 and #29 on US Modern Rock charts.\n\nThe song was featured during a montage of people getting approved to go to Hollywood during American Idol on January 29th 2008. The promo caused the song to jump 20 spots on iTunes from 75 to 55 overnight.\n\nIt was used in some commercials/trailers for the first season of the ABC Family show Greek, and is performed by the band (along with &quot;Hey There Delilah&quot;) in the episode &quot;The Rusty Nail&quot;. This song was also performed on the 11th episode (iRue the Day) of the first season on Nickelodeon's iCarly. It was also featured (along with &quot;You and Me&quot;) in the Disney Channel Original Movie Johnny Kapahala: Back on Board and a Norwegian commercial for As the Bell Rings.\n\nThe track was recorded in Simlish for The Sims 2: Teen Style stuff pack.\n\nThe song was used in The Ultimate Band Trailer.\n\nEvery Second Counts is the fourth studio album released by the Plain White T's. It is the first Plain White T's album to be released on Hollywood Records along with Fearless Records. The album peaked at #10 on Billboard 200 on July 29, 2007 and was certified Gold by the RIAA in October 2007. Every Second Counts peaked at #3 on the UK top 75 albums.\n\nThe Plain White T's is an American pop rock band started in 1997, originally from Villa Park, Illinois. Formed by high school friends Tom Higgenson and Ken Fletcher, the group had a mostly underground following in Chicago basements, clubs, and bars in its early years, and underwent numerous personnel changes. The band is best known for the songs &quot;Hey There Delilah&quot;, which charted highly in many countries, and &quot;1, 2, 3, 4&quot;. In 2008, they received a Grammy nomination for &quot;Hey There Delilah&quot;. The band broke into the mainstream following the success of &quot;Hey There Delilah&quot; and the well-received &quot;Hate (I Really Don't Like You)&quot; from the album Every Second Counts. The group's latest album is Big Bad World, released in 2008.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt; \n\n","torrent":{"xt":"urn:btih:cd27f40909a15ede0cc2642e9b5c31c30a238b19","amp;dn":"Plain+White+T%5C%27s+-+Our+Time+Now+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd27f40909a15ede0cc2642e9b5c31c30a238b19","infoHashBuffer":{"type":"Buffer","data":[205,39,244,9,9,161,94,222,12,194,100,46,155,92,49,195,10,35,139,25]},"announce":[],"urlList":[]}}