{"title":"Satan's School for Lust (2002 unrated DVDRip Xvid)","uid":4163797,"size":1466732588,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cd6d1eeb7eef905f1688296ee0cd08d11fde21f7&amp;dn=Satan%5C%27s+School+for+Lust+%282002+unrated+DVDRip+Xvid%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"circlensess","files":2,"time":1209506994,"description":"Months after its US and UK release date, the movie was rushed back into production under the direction of John Bacchus adding additional scenes for the US television version.\n\nStudio/Distro: E.I. Independent Cinema/Seduction Cinema/Shock-O-Rama\nGenre: Erotic Horror\nDirector: Terry M West\nWriters: John Bacchus, Terry West\n\nStarring:\nMisty Mundae\nDarian Caine\nBarbara Joyce\nRuby LaRocca\nCherry Moonshine (aka Zoe)\nChelsea Mundae (she&amp;#039;s creditted on the cover, but I don&amp;#039;t see her)\nKelli Summers\nTerry West\nWilliam &quot;Factory 2000&quot; Hellfire (as the boyfriend in the opening scene)\n\nIMDb: Satan&amp;#039;s School for Lust http://www.imdb.com/title/tt0350091/\n\nSynopsis (from dvd back):\n\nYoung, beautiful, and naive Primula Cooper (Misty Mundae) is sent to a secluded females only private school while her father travels overseas. Diablo School For Girls is an ominous and secluded building that hides it&amp;#039;s many dark and kinky secrets from the outside world.\n\nUpon her arrival, Primula is greeted by Miss Beezle (Barbara Joyce), the domineering headmistress of Diablo, who has a sinister taste for the bodies and souls of blossoming young women. As well as Phoenix (Ruby LaRocca), a student hellion and over-sexed goth girl who becomes Primula&amp;#039;s all too willing roommate. As Primula tries to settle into her strange new environment, she begins having dreams of a devilish figure (Darian Caine) that can satisfy her deepest and hottest desires.\n\nAll alone... surrounded only by the foreboding woods that shield Diablo from the world of light... yet dripping with an erotic intensity that her supple young body has never experienced, Primula makes a horrifying discovery. The students are planning an orgiastic satanic ceremony that will bring about Hell on earth. And their main ingredient... Primula herself! With time running out, it&amp;#039;s up to an investigative reporter (Kelli Summers), with her own sensual secrets and delectable yearnings, to solve the mystery of the missing students and save Primula from a fate worse than death.\n\n\nIn my opinion this is easily the best thing ever released by E.I./Seduction, but you know what they say about opinions. It&amp;#039;s a matter of taste I&amp;#039;m sure. Misty isn&amp;#039;t the entire focus throughout the film, so don&amp;#039;t go in thinking she&amp;#039;ll have all the screentime. She&amp;#039;s esp light in the sex scenes, this was a 2002 release, she was already starting to do less of that kinda thing (compared to say 1998-2000).\n\nThe genre label of &quot;erotic horror&quot; is misleading. As it always is. This is just girl school softcore with &quot;occult&quot; themes, no real horror here. I find it to be very well done though.\n\nSource: dvd\nAspect Ratio: 1.33:1\nCodec: Xvid 1.1.0 Final\nVideo: 640x 464, 29.97 fps, 2809 kbps (92.34%)\nAudio: AC3, 192 kbps, 2 channel stereo, 48000 Hz (6.38%)\nRuntime: 1:04:55","torrent":{"xt":"urn:btih:cd6d1eeb7eef905f1688296ee0cd08d11fde21f7","amp;dn":"Satan%5C%27s+School+for+Lust+%282002+unrated+DVDRip+Xvid%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd6d1eeb7eef905f1688296ee0cd08d11fde21f7","infoHashBuffer":{"type":"Buffer","data":[205,109,30,235,126,239,144,95,22,136,41,110,224,205,8,209,31,222,33,247]},"announce":[],"urlList":[]}}