{"title":"The Complete Fantastic Four by Mark Millar and Bryan Hitch (Mira","uid":8578778,"size":256089491,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ce26b0eeac97bb4915b5662b7aeb61520084cbbe&amp;dn=The+Complete+Fantastic+Four+by+Mark+Millar+and+Bryan+Hitch+%28Mira&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MrclScns","files":2,"time":1371361479,"description":"The Complete Fantastic Four by Mark Millar is a new digital collection of Millar's complete 16-issue run on Fantastic Four in one easy-to-read volume.\n\nThis is a completely new digital collection, and even though the resolution is not as high as some existing scans might be, the colors are more true.\n\nThis unique digital omnibus collects the entire run in 370 pages, comprised of Fantastic Four #554-569 as well as some interesting articles including 2 Mark Millar interviews and a Bryan Hitch interview which preceded the series.\n\nThis collection is essential reading before &quot;The Complete Fantastic Four by Jonathan Hickman&quot; 2-book collection as it introduces several characters and concepts core to that run.\n\nIf you like what you read here, please support the artists and publisher and ensure further works like this by going out and purchasing the back issues from your local retailer, the trade paperbacks or hardcovers, or the digital comics.\n\nThis collection follows these available MiracleScans releases:\n\n- The Complete Fantastic Four by Jonathan Hickman (2 volumes)\n- The Complete Seven Soldiers of Victory by Grant Morrison\n- The Complete Miracleman by Alan Moore\n- The Complete Marvelman in Warrior\n\nAll of these releases can be found on Pirate Bay under username &quot;MrclScns&quot;.\n\nMiracleScans specializes in digital omnibus volumes of complex comic runs organized for easy reading, &amp; we also do new scans of older material. Follow on Twitter for news on future releases as there are a number of few cool projects in the pipeline -- @miraclescans","torrent":{"xt":"urn:btih:ce26b0eeac97bb4915b5662b7aeb61520084cbbe","amp;dn":"The+Complete+Fantastic+Four+by+Mark+Millar+and+Bryan+Hitch+%28Mira","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce26b0eeac97bb4915b5662b7aeb61520084cbbe","infoHashBuffer":{"type":"Buffer","data":[206,38,176,238,172,151,187,73,21,181,102,43,122,235,97,82,0,132,203,190]},"announce":[],"urlList":[]}}