{"title":"progressive and beyond - Music for Old Animals","uid":7945949,"size":10425334276,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ce3aaf34a44d63c5f1e29fb4814832cde85c82d8&amp;dn=progressive+and+beyond+-+Music+for+Old+Animals&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"n0b0dyh0me","files":179,"time":1356127958,"description":"Reseed on a seedbox after requests:\n\n\nMusic For Old Animals (Musica per vecchi animali) was an underground 1989 italian movie which starred, amongst the others, the 1999 Nobel Prize for Literature, Dario Fo. \n   &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Dario_Fo&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Dario_Fo&lt;/a&gt;\n\nThe movie narrated the endeavours of an old man, a young man and a little girl to reach the other side of their city in a gloomy atmosphere with police patrols all around and all the media always broadcasting that the situation was normal, no matter the alarms and people arrested at every corner of the streets.\n\nLet's say that in Italy, my country, the situation is not really like this.\nIn my country there is a Prime Minister, called by someone the Dark Knight - and by others the Evil Dwarf. A man who believes to be the Chosen One, who changes the laws to cover his crimes, who defines the President of another state as an &quot;handsome suntanned man&quot;, believing to be a funny joke teller.\nIn my country there's a man dressed in white who believes to be an urologist and preaches that condoms are not only useless for health but even dangerous.\nAnd you see... in my country nobody stands up to protest.\nThis is due to the fact that Italians are for the most part fascists (and this is not a flaw in a democratic state), and are, above all, dumb - the combination of the two aspects is deadly terrible.\n\nBut you see there's not only shit in my Banana Republic: so today, I was musing on some meaningful italian music to share and I started to collect several old progressive bands. But soon the torrent was enriched by many more contributions and so you have it:\nprogressive and beyond, and not only from Italy.\nYou will find albums of the historical italian bands: PFM, Banco, Area, Stormy Six, New Trolls, Le Orme... (if you want lyrics and english translations and you dont find them on the web, post a comment providing for instance a blog address and if I'll have time and will I'll post them there).\nYou won't find for instance famous groups like Yes, King Crimson, Genesis, Rush or Dream Theater only because they are just well seeded and there's no need to add them here.\nBut you will find minor groups that maybe you have never heard of.\nYou will find Emerson Lake &amp; Palmer, Moody Blues and Vanilla Fudge (even if the last two are not progressive bands).\nYou will find more recent groups of power and symphonic metal and many more...\nThere's a lot to dig. So enjoy this music for old animals... :)\n\n(browse all my torrents:\n     &lt;a href=&quot;\nhttps://thepiratebay.se/user/n0b0dyh0me/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/n0b0dyh0me/&lt;/a&gt; \n\n\nfor private posts:\n  &lt;a href=&quot;\nhttp://forum.suprbay.org/member.php?action=profile&amp;uid=113028&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/member.php?action=profile&amp;uid=113028&lt;/a&gt;\n\n)\t","torrent":{"xt":"urn:btih:ce3aaf34a44d63c5f1e29fb4814832cde85c82d8","amp;dn":"progressive+and+beyond+-+Music+for+Old+Animals","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce3aaf34a44d63c5f1e29fb4814832cde85c82d8","infoHashBuffer":{"type":"Buffer","data":[206,58,175,52,164,77,99,197,241,226,159,180,129,72,50,205,232,92,130,216]},"announce":[],"urlList":[]}}