{"title":"Taxi To The Dark Side 2007 480p 6ch 2ch Commentary 2subs x265","uid":15101148,"size":657965319,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ce5fc6452c247c61e33ac67813dc28c6757eb884&amp;dn=Taxi+To+The+Dark+Side+2007+480p+6ch+2ch+Commentary+2subs+x265&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bsg4you","files":3,"time":1466958164,"description":"Taxi.To.The.Dark.Side.2007.480p.6ch.2ch.Commentary.2subs.x265.mkv\r\n\r\nTHIS TORRENT USES X265 HEVC (High Efficiency Video Coding) VIDEO\r\nPLEASE USE A PLAYER THAT SUPPORTS X265 HEVC VIDEO LIKE VLC, POTPLAYER, ETC\r\n\r\nTaxi To The Dark Side (2007)\r\nvideo: 720x480 HEVC crf=22.00 preset=medium ~433Kbps 8-bit\r\naudio1: 5.1 Surround Movie HE-AAC 224Kbps\r\naudio2: 2.0 Stereo Movie HE-AAC 80Kbps\r\naudio3: 2.0 Stereo English Director Commentary by Alex Gibney HE-AAC 80Kbps\r\nsubs1: English picture based subs from DVD\r\nsubs2: Spanish picture based subs from DVD\r\nsource: DVD\r\n1hour46min05sec 657,910,626bytes includes chapters\r\n  http://www.imdb.com/title/tt0854678/  \r\n\r\n**********\r\n\r\nIMDB: Using the torture and death in 2002 of an innocent Afghan taxi driver as the touchstone, this film examines changes after 9/11 in U.S. policy toward suspects in the war on terror. Soldiers, their attorneys, one released detainee, U.S. Attorney John Yoo, news footage and photos tell a story of abuse at Bagram Air Base, Abu Ghraib, and Guantanamo Bay. From Bush, Cheney, Rumsfeld, and Gonzalez came unwritten orders to use any means necessary. The CIA and soldiers with little training used sleep deprivation, sexual assault, stress positions, waterboarding, dogs and other terror tactics to seek information from detainees. Many speakers lament the loss of American ideals in pursuit of security. \r\n\r\n**********\r\n\r\nWiki: Taxi to the Dark Side is a 2007 documentary film directed by American filmmaker Alex Gibney which examines the USA's policy on torture and interrogation in general, specifically the CIA's use of torture and their research into sensory deprivation. The film includes discussions against the use of torture by political and military opponents, as well as the defense of such methods; attempts by Congress to uphold the standards of the Geneva Convention forbidding torture; and popularization of the use of torture techniques in TV series such as 24.\r\n\r\n**********\r\n\r\n* Winner 2007 Academy Award for Best Documentary\r\n* Metacritic 82% Universal acclaim based on 25 Critics\r\n* Rotten Tomatoes 100% on 91 critic reviews: &quot;Taxi to the Dark Side is an intelligent, powerful look into the dark corners of the War on Terror.&quot;\r\n* Winner 2007 Peabody Award: &quot;The hideous death of an Afghani taxi driver while in U.S. military custody in 2002 gave director Alex Gibney the central thread of this searing documentary - an exploration of how the disgraceful abuses of Abu Ghraib and Guantanamo could happen. For its sober, meticulous argument that what happened to a hapless Afghani was not an aberration but, rather, the inevitable result of a consciously approved, widespread policy, Taxi to the Dark Side receives a Peabody Award.&quot;\r\n\r\n**********\r\n\r\nPlease check out other documentaries, movies, Rifftrax, MST3K, Battlestar Galactica, Star Trek, Gotham, DC Comics, and more at:\r\n  https://thepiratebay.org/user/bsg4you/  \r\n  https://kat.cr/user/bsg4you/uploads/  \r\nand leave any corrections, criticism, comments and requests.\r\n\r\nThanks, bsg4you","torrent":{"xt":"urn:btih:ce5fc6452c247c61e33ac67813dc28c6757eb884","amp;dn":"Taxi+To+The+Dark+Side+2007+480p+6ch+2ch+Commentary+2subs+x265","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce5fc6452c247c61e33ac67813dc28c6757eb884","infoHashBuffer":{"type":"Buffer","data":[206,95,198,69,44,36,124,97,227,58,198,120,19,220,40,198,117,126,184,132]},"announce":[],"urlList":[]}}