{"title":"Barry Adamson - The King Of Nothing Hill [2002][EAC,log,cue. FLA","uid":8175315,"size":477233995,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cf3bbc6a9aa71985a2cc89f30237543d23786ccd&amp;dn=Barry+Adamson+-+The+King+Of+Nothing+Hill+%5B2002%5D%5BEAC%2Clog%2Ccue.+FLA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":24,"time":1361518287,"description":"Another one of those albums that appeared on my seedbox somehow\n\nArtist: Barry Adamson\nRelease: The King Of Nothing Hill\nDiscogs: 56800\nReleased: 2002-09-03 / 2002-09-02\nLabel: Mute, Mute / Mute\nCatalog#: 9176-2, MUTE 9176-2 / CDSTUMM176\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: Europe\nStyle: Electronic, Jazz, Modern Classical, Future Jazz, Experimental\n\nTracklisting:\n\n01. Cinematic Soul (5:27)\n02. Whispering Streets (5:00)\n03. Black Amour (5:05)\n04. When Darkness Calls (5:54)\n05. The Second Stain (4:43)\n06. Twisted Smile (5:52)\n07. Le Matin Des Noire (10:26)\n08. That Fool Was Me (5:35)\n09. The Crime Scene (6:26)\n10. Cold Comfort (8:25)\n\nCredits: Show\n\nNotes: Show\n\nLo these many years after his emergence from Manchester's punk scene as bass player with Magazine, Barry Adamson continues his forays into what he here terms &quot;Cinematic Soul&quot;. Following his tenure with Nick Cave's Bad Seeds, Adamson first scratched his filmic itch with Moss Side Story, a film noir soundtrack that merely lacked the film. Not that it was necessary, as the album told a fine story without the moving pictures.\n\nThis time around, Adamson frequently brings the funk to these dark-tinged songs, complete with solid bass lines, horn sections, and even some sweeping strings. The aforementioned &quot;Cinematic Soul&quot; is grand funk indeed, with a particularly great bass line, excellent guitar, and beautiful horns. Wonderful stuff, with telling lyrics: this King doesn't live until the film starts unfolding. &quot;Whispering Streets&quot; is another winner, a truly dramatic song with funk underpinnings, very strong vocals, and an extremely memorable hook. Its story of a quasi-accidental killer is a real kick to the head when combined with the song's eternally hummable chorus. On &quot;Black Amour,&quot; Adamson veers between getting all Barry White sultry, and letting the music spiral into a sweeping, violin-led soul extravaganza; hell, there's harpsichord, piano, and more.\n\nUnfortunately, after the initial rush of the opening tracks, the album slows down perhaps too much. While &quot;When Darkness Calls&quot; keeps things moving fairly well with its deep synth bass groove, scattershot drums, and ominous incantatory lyrics, &quot;Le Matin Des Noire&quot; proves to be a bit too thin for its ten minute length. As a soundscape, or in actuality a soundtrack without pictures, it's a noble experiment, but when it comes down to it, the sound seems to ramble without focusing to a point.\n\nWhile &quot;Twisted Smile&quot; and &quot;The Crime Scene&quot; are attention-grabbers, most of the remaining songs just can't quite pull together enough to be memorable. The production remains top-notch, but the very strength of songs like &quot;Whispering Streets&quot; dooms many of the others in comparison.\n\nAt the end, this film proves to be a movie of parts, some of them shining, some of them lacking in luster, but the whole is nonetheless worthy of recommendation. Even if the first half of this album ends up earning repeat play to the detriment of the remainder, you'll still be glad to have it.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:cf3bbc6a9aa71985a2cc89f30237543d23786ccd","amp;dn":"Barry+Adamson+-+The+King+Of+Nothing+Hill+%5B2002%5D%5BEAC%2Clog%2Ccue.+FLA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf3bbc6a9aa71985a2cc89f30237543d23786ccd","infoHashBuffer":{"type":"Buffer","data":[207,59,188,106,154,167,25,133,162,204,137,243,2,55,84,61,35,120,108,205]},"announce":[],"urlList":[]}}