{"title":"Suze Orman.DVDRips.XviD","uid":4010716,"size":2427623510,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cf7d18a601d7ac60788420278d2238d1bac6de05&amp;dn=Suze+Orman.DVDRips.XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"135791113","files":7,"time":1202069258,"description":"Orman was born on the South side of Chicago, Illinois, in 1951 to Russian-Jewish immigrants Ann and Morry Orman.[2][3] Orman came from a working class background and has said that she did not &quot;grow up with money.&quot;[2][4] She was an undergraduate at the University of Illinois at Urbana-Champaign from which she holds a B.A. in social work. In 1973, she and some friends moved to Berkeley, California, where she became a waitress at the Buttercup Bakery. In 1980, a long-time customer gave Orman a loan of $50,000 to help her fulfill her dream of opening her own restaurant. Orman invested the money at Merrill Lynch, however four months later Orman was broke again after, she claims, she was swindled by her stockbroker.[5]\n\nKnowing she couldn&amp;#039;t make the money back by waitressing, and having started learning more about finances and investing, Orman returned to Merrill Lynch and entered their training program to become an account executive. After she completed the training, she was hired by the firm and remained there until 1983 when she left to take a position as Vice President of Investments at Prudential Bache Securities. In 1987, Orman resigned and opened her own financial planning firm, the Suze Orman Financial Group, in Emeryville, California. She acted as director of the firm until 1997, when she stepped down as her writing career took off with the publication of her second book.[5]","torrent":{"xt":"urn:btih:cf7d18a601d7ac60788420278d2238d1bac6de05","amp;dn":"Suze+Orman.DVDRips.XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf7d18a601d7ac60788420278d2238d1bac6de05","infoHashBuffer":{"type":"Buffer","data":[207,125,24,166,1,215,172,96,120,132,32,39,141,34,56,209,186,198,222,5]},"announce":[],"urlList":[]}}