{"title":"Transatlantic - More Never Is Enough - 3CD+2DVD 2011","uid":6993364,"size":13089020868,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d0a4b09c93fb425c9dd44db89138b0ae09bdd3dc&amp;dn=Transatlantic+-+More+Never+Is+Enough+-+3CD%2B2DVD+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1327780410,"description":"Turns out, Transatlantic is a modern-day prog-rock supergroup in the most complete sense of the word: That means bass pedal solos.\n\nMake no mistake, there is plenty of serious music making to be found on the forthcoming 2 DVD/3CD package More Never Is Enough, which includes two live shows from the band's celebrated 2010 reunion tour. Transatlantic - featuring Neal Morse (ex-Spock's Beard), Mike Portnoy (ex-Dream Theater) Pete Trewavas (of Marillion) and Roine Stolt (The Flower Kings) - does a great job of reinterpreting the long-awaited Whirlwind, which had been their first album of new studio material in seven years, and eventually became their best-selling project ever.\n\nTransatlantic, however, is also revealed - through antics both during sound check and on stage (Portnoy stage dives!) - to be complete and utter fans of their chosen throwback format. Over the course of this gala release, they revel in all of progressive rock's dizzying musical intrigues, but also all its fundamental (and, heck, still sometimes fun) excesses.\n\nSo yeah, seriously, there's the aforementioned solo turn by Portnoy - with Morse taking over on drums. But perhaps the most telling moment of all arrives with the final encore at Tilburg, the Netherlands, when Transatlantic (having played everything they'd rehearsed after nearly a decade away) plucked out a favorite tune from Genesis to perform - Return of the Giant Hogweed, an apocalyptic third-album early-1970s chestnut from the Peter Gabriel era. To recap briefly, this enraged kudzu-like plantlife attempts to take over England, having been brought from Russia to the Royal Gardens at Kew by a Victorian explorer. Despite the best attempts by the local citizenry, including but not limited to some nasty herbicide, the hogweeds succeed in defeating the human race, but only after a keyboard-driven instrumental interlude called, yes, The Dance of the Giant Hogweed.\n(Nick DeRiso)\n\n- - -\n\nTransatlantic - More Never Is Enough - Live at Manchester &amp; Tilburg 2010\n(3CD+2DVD InsideOut Music 2011)\n\nCD  Transatlantic live in Manchester\n\n1. The Whirlwind\n2. All of the above\n3. We all need some light\n4. Duel with the devil\n5. Bridge across forever\n6, Stranger in your soul\n\nDVD Transatlantic live in Tilburg\n\n1. The Whirlwind\n2. All of the above\n3. We all need some light\n4. Duel with the devil\n5. Bridge across forever\n6. Stranger in your soul\n7. Return of the giant hogweed\n\n+ Extras \n","torrent":{"xt":"urn:btih:d0a4b09c93fb425c9dd44db89138b0ae09bdd3dc","amp;dn":"Transatlantic+-+More+Never+Is+Enough+-+3CD%2B2DVD+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0a4b09c93fb425c9dd44db89138b0ae09bdd3dc","infoHashBuffer":{"type":"Buffer","data":[208,164,176,156,147,251,66,92,157,212,77,184,145,56,176,174,9,189,211,220]},"announce":[],"urlList":[]}}