{"title":"SolveigMM Video Splitter 5.0.1510.28 Business Edition + Portable","uid":12653787,"size":68023872,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d0ef99f9ebe8304e7178067dbb1b090f0316af45&amp;dn=SolveigMM+Video+Splitter+5.0.1510.28+Business+Edition+%2B+Portable&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jovo_bih","files":1,"time":1446191297,"description":"****************************************************************\r\nSolveigMM Video Splitter 5.0.1510.28 Business Edition + Portable\r\n****************************************************************\r\n\r\nLossless Editing of Compressed Video Streams\r\n\r\nRelease date: 28/10/2015\r\n\r\nNote: For some reason, this release is not available for download from author's website.\r\n\r\nSolveigMM Video Splitter Business Edition is a video processing tool mainly intended for use in the business environment. Its feature set includes options for splitting, trimming and joining video files, providing preview functionality to help you get the job done easier.\r\n\r\nThe range of supported file types is quite broad, since all popular formats can be loaded into the application (AVCHD, AVC/H264, MPEG-2, MP4, MOV, MKV, WebM, FLV, AVI, Windows Media files, MPEG Audio files). Video and audio can be processed separately.\r\n\r\nAs regards the usage, it shouldn't pose difficulties, regardless of the user's experience level. The user-friendly GUI is mostly occupied by the preview window, also comprising tools for setting the start and the end point of the segment you want to trim, as well as information about the input and output files.\r\n\r\nThe selection can be kept or cut out from the video, according to your needs. The advanced navigation options allow you to jump back and forth throughout the video and the capture function lets you take frame screenshots.\r\n\r\nThe application comes with a dedicated tool for slicing a video into multiple parts, of equal or different dimensions. The size of the output can be easily calculated using the dedicated function, which is quite useful.\r\n\r\nUnlike the Home Edition of the application, the Business version supports batch editing and command line processing.\r\n\r\nSolveigMM Video Splitter Business Edition can prove useful for eliminating unecessary sections of the video, such as long introductions or boring credits, thus saving storage space on your computer. What's more, it also comprises functions for joining multiple videos together into a single, larger file.\r\n\r\nSupported OS: Windows 2K / XP / Vista / Vista 64 bit / 7 / 7 64 bit / 8 / 8 64 bit / 2003\r\nSupported languages: English, German, Russian, French, Italian, Japanese, Chinese\r\n\r\nSystem requirements\r\n\r\n- DirectX 8.0 Runtime or higher\r\n- Appropriate video and audio decoders for preview feature\r\n- Windows Media Format 9 Series Runtime shipped with Windows Media Player 9 or higher.\r\n- Windows Media Format 11 Series Runtime for WMV file frame accurate editing\r\n\r\nHomepage http://www.solveigmm.com/en/products/video-splitter/","torrent":{"xt":"urn:btih:d0ef99f9ebe8304e7178067dbb1b090f0316af45","amp;dn":"SolveigMM+Video+Splitter+5.0.1510.28+Business+Edition+%2B+Portable","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0ef99f9ebe8304e7178067dbb1b090f0316af45","infoHashBuffer":{"type":"Buffer","data":[208,239,153,249,235,232,48,78,113,120,6,125,187,27,9,15,3,22,175,69]},"announce":[],"urlList":[]}}