{"title":"Bible Babel - Dr. Peter S. Ruckman","uid":11773657,"size":577776,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1a644f1387864d60a8734f49dc357eda5b7f0d8&amp;dn=Bible+Babel+-+Dr.+Peter+S.+Ruckman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427179591,"description":"Given the plethora of Bible versions (233 since 1880), an examination is in order of the motives and methods of the Bible revisers who have confused the issue of what the Bible actually says. In this work, Dr. Ruckman gives an easy-to-read, practical survey of the pride, inconsistency, and psychology of the critics of the Authorized Version. He then demonstrates the superiority of the KJV to all other translations, and even the &quot;originals,&quot; by its publication date, the honesty of its translators, the preeminence it gives to Jesus Christ, and the phenomena of its chapter and verse system. It is an excellent introduction to those who have questions about the Bible issue.\n\n\nAbout the author:\nDr. Peter S. Ruckman received his Bachelor of Arts degree from the University of Alabama and finished his formal education with six years of training at Bob Jones University (four full years and two accelerated summer sessions), completing requirements for the Master of Arts and Doctor of Philosophy degree.\nReading at a rate of seven hundred words per minute, Dr. Ruckman had managed to read about 6,500 books before receiving his doctorate, and he still reads an average of a book each day.\nDr. Ruckman stands for the absolute authority of the Authorized Version and offers no apology to any recognized scholar anywhere for his stand. In addition to preaching the gospel and teaching the Bible, Dr. Ruckman has produced a comprehensive collection of apologetic and polemic literature and resources supporting the authority of the Authorized Version of the Holy scriptures","torrent":{"xt":"urn:btih:d1a644f1387864d60a8734f49dc357eda5b7f0d8","amp;dn":"Bible+Babel+-+Dr.+Peter+S.+Ruckman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1a644f1387864d60a8734f49dc357eda5b7f0d8","infoHashBuffer":{"type":"Buffer","data":[209,166,68,241,56,120,100,214,10,135,52,244,157,195,87,237,165,183,240,216]},"announce":[],"urlList":[]}}