{"title":"Milos Forman - The People vs. Larry Flynt (1996)","uid":6314197,"size":3330049680,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:d2096f6c7744cd6f9b94aa00eca3aa8b9b694695&amp;dn=Milos+Forman+-+The+People+vs.+Larry+Flynt+%281996%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mfccorrea","files":3,"time":1302643081,"description":"&quot;If the First Amendment will protect a scumbag like me, then it'll protect all of you -- 'cause I'm the worst,&quot; declares Hustler Magazine publisher Larry Flynt (as played by Woody Harrelson) in the midst of one of his many court cases. Milos Forman's film follows Flynt from his childhood in Kentucky, where he made extra money for his dirt-poor family by selling the moonshine his father brewed, into adulthood as he manages a strip club in Cincinnati. While the club does middling business, the experience changes Flynt's life in two ways: he meets Althea (Courtney Love), an exotic dancer who becomes the love of his life, and he gets the bright idea of starting a magazine to promote the club. Marketed as a crasser, less pretentious alternative to Playboy or Penthouse, Hustler becomes a huge success after Flynt runs a photo series of Jacqueline Onassis sunbathing nude. However, while plenty of people are buying Hustler, there are also plenty of people who don't care for it, including Charles Keating (James Cromwell), leader of a watchdog group called Citizens For Decent Literature. Keating spearheads the first of many legal attacks on the magazine, one of which reaches the Supreme Court as Alan Isaacman (Edward Norton), Flynt's lawyer, debates the finer legal points of bad taste with the justices of the highest court in the land. Meanwhile, Flynt makes a fortune, loses the use of his legs after an attack by a sniper, embraces and than abandons Christianity, and eventually loses Althea, who succumbs to AIDS after a long addiction to drugs. Woody Harrelson's brother Brett Harrelson is well cast as Larry Flynt's brother Jimmy; Larry Flynt appears briefly as a judge who hands down a judgment against Larry Flynt. \n\nGeneral           : The People vs Larry Flynt.avi\nFormat            : AVI at 3 429 Kbps\nLength            : 3.10 GiB for 2h 9mn 28s 719ms\n\nVideo #0          : MPEG-4 Visual at 2 971 Kbps\nAspect            : 1280 x 528 (2.424) at 23.976 fps\n\nAudio #0          : AC-3 at 448 Kbps\nInfos             : 6 channels, 48.0 KHz\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0117318/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0117318/&lt;/a&gt;\n\nEnglish audio; English and Portuguese subtitles\n\nMilos Forman - The People vs. Larry Flynt (1996)\n\n","torrent":{"xt":"urn:btih:d2096f6c7744cd6f9b94aa00eca3aa8b9b694695","amp;dn":"Milos+Forman+-+The+People+vs.+Larry+Flynt+%281996%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2096f6c7744cd6f9b94aa00eca3aa8b9b694695","infoHashBuffer":{"type":"Buffer","data":[210,9,111,108,119,68,205,111,155,148,170,0,236,163,170,139,155,105,70,149]},"announce":[],"urlList":[]}}