{"title":"Counter-Strike Global Offensive(v1.2.23.1) no-steam - 4GamesLT.r","uid":8331220,"size":3348682136,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d375c30749aa54a07c04fe5ffc6698cdf88204fe&amp;dn=Counter-Strike+Global+Offensive%28v1.2.23.1%29+no-steam+-+4GamesLT.r&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"4gameslt","files":-1,"time":1364893518,"description":"Greetings from #4Games.LT...\n\nCounter Strike Global Offensive features new maps, characters, and weapons and delivers updated versions of the classic CS content (de_dust, etc.). In addition, CS: GO will introduce new gameplay modes, matchmaking, leader boards, and more.\n\nCounter-Strike took the gaming industry by surprise when the unlikely MOD became the most played online PC action game in the world almost immediately after its release in August 1999, said Doug Lombardi at Valve. For the past 12 years, it has continued to be one of the most-played games in the world, headline competitive gaming tournaments and selling over 25 million units worldwide across the franchise. CS: GO promises to expand on CS award-winning gameplay and deliver it to gamers on the PC as well as the next gen consoles and the Mac.\n\nCS:GO is being developed by Valve in cooperation with Seattle-based Hidden Path Entertainment. The title is targeted for release in early 2012 and will be playable at this year PAX Prime and Eurogamer Expo.\n\n4Games.LT presents you a CS:GO client version: 1.2.23.1. This is full client of CS:GO no-steam, and gives opportunity to play with bots, online (on no-steam servers), etc...\n\nHow to install and play:\n\n1. Download this client.\n2. Extract EVERYTHING from archive to some folder, like: C:CSGO.\n3. Open that folder, and you will see &quot;4G Launcher.exe&quot; file.\n4. Run &quot;4G Launcher.exe&quot; with admin rights.\n5. Click on &quot;Validate button&quot;.\n6. Wait in queue if there is one. Validation will start automatically.\n7. When white screen will be gone, you have to receive message &quot;Validation was successful! Click ok, and we will download emulator.&quot;, if you dont see it, please check in taskbar (move your mouse on 4G Launcher, wait for about 2 sec. and then you will see that there is two windows, one is launcher, other is message), click OK.\n8. Launch game:\n\t8.a) Click on &quot;Play Counter-Strike Global Offensive&quot; button in launcher.\n\t8.b) Go to: launcher dirSteamsteamappscommonCounter-Strike Global Offensive. Find revLoader.exe, and run it as administrator.\n\n\nYOU NEED:\n\n1. Windows Vista or highter. Windows XP is not supported any more, because CS:GO neads DirectX 11, and there is no officiall release of DirectX 11 for Windows XP.\n\nCheck my user for more games, updates, etc...: \n \n &lt;a href=&quot;\thttp://thepiratebay.se/user/4gameslt&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://thepiratebay.se/user/4gameslt&lt;/a&gt;\n\n#4Games.LT Team\n\n\nMore info, updates and full support here: \n &lt;a href=&quot;\thttp://forum.4games.lt&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://forum.4games.lt&lt;/a&gt;","torrent":{"xt":"urn:btih:d375c30749aa54a07c04fe5ffc6698cdf88204fe","amp;dn":"Counter-Strike+Global+Offensive%28v1.2.23.1%29+no-steam+-+4GamesLT.r","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d375c30749aa54a07c04fe5ffc6698cdf88204fe","infoHashBuffer":{"type":"Buffer","data":[211,117,195,7,73,170,84,160,124,4,254,95,252,102,152,205,248,130,4,254]},"announce":[],"urlList":[]}}