{"title":"Willie Nelson - Yesterday's Wine (1971) MP3@320","uid":9660121,"size":72269141,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d3f3ed6011b9c2fd6aa09a52d87620e5459f1894&amp;dn=Willie+Nelson+-+Yesterday%27s+Wine+%281971%29+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AaronVincent","files":13,"time":1393259103,"description":"Yesterday's Wine is a 1971 concept album by country singer Willie Nelson. In the early stages of his contract with RCA, Nelson had no significant hits. By 1970, his recordings had reached mid-chart positions. Nelson lost the money from his song-writing royalties by financing unsuccessful tours that did not generate significant profits. In addition to the problems with his career, Nelson had problems in his personal life. He had divorced his wife, Shirley Collie, and his ranch in Tennessee burned down.\nAfter moving to a new ranch in Bandera, Texas, Nelson was called by producer Felton Jarvis about the upcoming scheduled recording sessions. At the time, Nelson had not written any new material. He returned to Nashville, where he wrote new songs to use with others from his old repertoire. These new concept songs were recorded in two days.\nThe concept of the album is the story of the &quot;Imperfect Man&quot;, from the moment he is born to the day of his death. RCA originally released the singles &quot;Yesterday's Wine&quot; and &quot;Me and Paul&quot;. The former peaked at number 62 in Billboard's Hot Country Singles. The full release failed to reach the charts, and Nelson, frustrated by the failure, decided to retire from music without having been released from his contract with RCA. Later with his musical style revitalized, he returned to music in 1972.","torrent":{"xt":"urn:btih:d3f3ed6011b9c2fd6aa09a52d87620e5459f1894","amp;dn":"Willie+Nelson+-+Yesterday%27s+Wine+%281971%29+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3f3ed6011b9c2fd6aa09a52d87620e5459f1894","infoHashBuffer":{"type":"Buffer","data":[211,243,237,96,17,185,194,253,106,160,154,82,216,118,32,229,69,159,24,148]},"announce":[],"urlList":[]}}