{"title":"NEXUS - Nowe Czasy numer 77 *2011* [POLISH EBOOK] [.djvu]","uid":6774741,"size":2544506,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d51011646d55e62ba54474216897f5ad3cfb0b9a&amp;dn=NEXUS+-+Nowe+Czasy+numer+77+%2A2011%2A+%5BPOLISH+EBOOK%5D+%5B.djvu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":4,"time":1319704866,"description":"NEXUS - Nowe Czasy numer 77 (3/2011) maj-czerwiec\n Stron 60\n Format A4\n ISSN 1506-0284\n Strona www: http://www.nexus.media.pl/\n Jakosc: 200dpi\n Zrodlo: skan\n\n Skan z wyszukiwaniem, kopiowaniem tresci do notatnika, zakladkami itd.\n\n Magazyn prezentujacy kontrowersyjne teorie i poglady zwalczane przez glowny nurt nauki i media. Porusza  tematy dotyczace zdrowia, teorii spiskowych, ufo, ukrywanych technologi (free energy).\n\n Czytnik plikow djvu2 &lt;a href=&quot;\nhttp://ds6.ovh.org/djvu2-reader-read-djvu-pl.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ds6.ovh.org/djvu2-reader-read-djvu-pl.php&lt;/a&gt;\n\n WIESCI Z GLOBALNEJ WIOSKI 3\n Przeglad wiadomosci, ktorych prawdopodobnie nie czytaliscie.\n IMPERIALNA ANATOMIA AL-QAIDY 10\n Aby zapewnic wieksza dyskrecje w zakresie dzialan operacyjnych CIA zainicjowala utworzenie ponadnarodowej koalicji agencji wywiadowczych w celu finansowania i organizowania miedzynarodowych grup terrorystycznych, takich jak al-Qaida, ktorych dzialalnosc pomaga realizowac dalekosiezne cele jej czlonkow.\n\n PORFIRIA - PRZYCZYNA PRZEWLEKLYCH CHOROB 16\n Badania wykazuja, ze okolo 20 procent ludzi moze miec genetyczne defekty, ktorych nastepstwa w postaci roznych przewleklych chorob degeneratywnych lub chorob przypominajacych alergie objawiaja sie pod wplywem kontaktu ich organizmow z toksynami.\n\n UZDRAWIANIE SWIATA POPRZEZ WSPOLNE MEDYTACJE 24\n Prowadzone w ramach coraz liczniejszych akcji przez miliony ludzi na calym swiecie medytacje w imie pokoju i zdrowia oddzialuja na energie punktu zerowego, wywolujac mierzalne efekty, ktore mozna wyjasnic za pomoca praw fizyki kwantowej.\n\n NAUKA: przeglad interesujacych nowinek z pogranicza nauki 31\n Dokonana w roku 1952 obserwacja UFO przez pilota Bruce'a Cathie zainspirowala go do poszukiwania matematycznego porzadku w manifestacjach tych obiektow. Efektem tych trwajacych do dzisiaj badan jest odkrycie przezen oplatajacej Ziemie energetycznej siatki, ktorej struktura i wlasnosci odzwierciedlaja geometryczne zaleznosci miedzy grawitacja, swiatlem i czasem.\n\n ZAGINIONE TECHNOLOGIE STAROZYTNEGO EGIPTU     38\n Niezwykla precyzja wykonania licznych starozytnych egipskich budowli oraz mniejszych obiektow do dzis inspiruje niezaleznych badaczy do poszukiwania racjonalnych wyjasnien dotyczacych technologii ich wykonania, ktorych nie potrafia dostarczyc zawodowi egiptolodzy.\n\n KTO ZAPARKOWAL KSIEZYC W POBLIZU ZIEMI? 44\n Liczne trudne do wytlumaczenia anomalie dotyczace geologicznej struktury i usytuowania Ksiezyca na orbicie wokol Ziemi sprawiaja, ze nawet najbardziej smiale teorie mowiace, iz obce istoty wydrazyly jego wnetrze i umiescily go nie opodal Ziemi, zasluguja na uwage.\n\n ZAULKI NEODARWINIZMU - EWOLUCJONIZM A RELIGIA 49\n Doktrynerzy i propagatorzy neodarwinizmu wspieraja sie bledna teoria ewolucji, liczac, ze uda sie im z jej pomoca wykorzenic z umyslow ludzi religijnosc, ktora uwazaja za wytwor chorej wyobrazni lub zerujacych na ludzkiej naiwnosci przebieglych kaplanow.\n\n STREFA MROKU: dziwne opowiesci z nie tego swiata 55\n W tym numerze przedstawiamy liczaca wiele tysiecy lat historie indianskiego plemienia Ugha Mongulala, ktora w roku 1972 niemieckiemu dziennikarzowi i korespondentowi radiowemu i telewizyjnemu, Karlowi Bruggerowi, opowiedzial jego wodz, Tatunca Nara.","torrent":{"xt":"urn:btih:d51011646d55e62ba54474216897f5ad3cfb0b9a","amp;dn":"NEXUS+-+Nowe+Czasy+numer+77+%2A2011%2A+%5BPOLISH+EBOOK%5D+%5B.djvu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d51011646d55e62ba54474216897f5ad3cfb0b9a","infoHashBuffer":{"type":"Buffer","data":[213,16,17,100,109,85,230,43,165,68,116,33,104,151,245,173,60,251,11,154]},"announce":[],"urlList":[]}}