{"title":"Profit of Doom pdf","uid":10743511,"size":3570544,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d5e53f1bb2f23f15821a8ee50a180d795f329ccd&amp;dn=Profit+of+Doom+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eboneezer","files":1,"time":1407787191,"description":"ISBN : 0971448124\n\nAuthor: Craig Winn\nCraig Winn's controversial and inflammatory work, Prophet of Doom, begins with this statement: &quot;Islam is a caustic blend of regurgitated paganism and twisted Bible stories. Muhammad, its lone prophet, conceived his religion solely to satiate his lust for power, sex, and money. He was a terrorist.&quot; Needless to say, the book is certain to offend Muslims for it disparages nearly every aspect of Islam. Winn attempts to deflect such criticism upfront by claiming that he is merely quoting the Qur'an and other Islamic texts and is therefore &quot;just the messenger.&quot; Further, he claims that he is unconcerned about being offensive because his goal is to educate people about the root causes of terrorism and the inherent dangers of Islam in the same way that early translators of Mein Kampf tried to warn an unsuspecting world of Hitler's intentions. &quot;If we don?t shed our ignorance of Islam, many more will perish,&quot; he writes. Admittedly, prior to the attacks of September 11, 2001, Winn knew little about Islam. According to the author, the tragic events of that day led him to investigate why Muslims were so intent on killing Infidels, Americans in particular. He also claims to have interviewed members of al-Qaeda, Islamic Jihad, al-Aqsa Martyrs' Brigade, and Hamas, and studied Islamic texts, referring to five different translations in the process. Blending these translations in order to express the nuances of the writing to further his premise, Winn selectively quotes from the Qur'an, various Islamic texts, and the biography of Muhammad, to make his case that that Islam is the &quot;world's largest and most violent organization&quot; and &quot;rotten to the core.&quot; Rather than educate readers about the Islamic faith, the book's sole purpose seems to be to shock and inflame readers---and in that regard it succeeds. --Shawn Carkonen","torrent":{"xt":"urn:btih:d5e53f1bb2f23f15821a8ee50a180d795f329ccd","amp;dn":"Profit+of+Doom+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5e53f1bb2f23f15821a8ee50a180d795f329ccd","infoHashBuffer":{"type":"Buffer","data":[213,229,63,27,178,242,63,21,130,26,142,229,10,24,13,121,95,50,156,205]},"announce":[],"urlList":[]}}