{"title":"Johnathan Gray-DeadMens Secrets","uid":4660188,"size":18354668,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d61f020de2b8bf2b267ac00ac40213110a072072&amp;dn=Johnathan+Gray-DeadMens+Secrets&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"paingang","files":19,"time":1232357900,"description":"International explorer, archaeologist and author Jonathan Gray has traveled the world to gather data on ancient mysteries. He has penetrated some largely unexplored areas, including parts of the Amazon headwaters. The author has also led expeditions to the bottom of the sea and to remote mountain and desert regions of the world. He lectures internationally.\n \nAbout This Book \nPROLOGUE\nPART ONE: HOW AN ORIGINAL SUPER WORLD VANISHED\n1. THE DAY THE EARTH TIPPED OVER (How a worldwide super culture vanished in a cosmic disaster)\n2. SEARCH (Why the first cities suddenly hatched out of nowhere, fully mature)\n3. MYSTERIOUS MESSAGES IN THE CANYON (How somebody mapped our whole planet before &quot;history&quot; began)\n4. OPERATION SPIDER WEB (An incredible electric web that gave one city world control)\n5. SUDDEN FURY (How the global tyranny collapsed - and why mankind has been slipping since)\n6. LOST SURVIVORS (After ruined cities, came &quot;Stone Age&quot; man)\n7. SOMEBODY'S MISREADING THE TIME (Why dating methods don't work for the origin of man)\n8. DID SPACE GIANTS EXPERIMENT WITH US? (Did we originate on earth or in some other galaxy?)\n9. VANISHING EVIDENCE ( The case of disappearing clues)\nPART TWO: CLUES THEY LEFT BEHIND\n10. THE DISAPPEAARANCE OF ADMIRAL OT (Geographical)\n11. SECRET PLANET - ARE WE IN FOR MORE SURPRISES? (Astronomical)\n12. TRAVEL FAST AND LIVE LONGER (Cosmology)\n13. WHO BEAT OUR COMPUTERS? (Mathematical)\n14. THE SAD GATE OF THE GOLD GARDENS (Metallurgy)\n15. MICROSCOPE ON A SEXY SPIDER (Glasswork)\n16. STRANGE RUINS ON THE SEABED (Large-size construction)\n17. JOURNEY INTO THE UNEXPECTED (Construction techniques and house features)\n18. PERFUME PLEASE, THE GAME STINKS! (Town planning and social organization)\n19. FORBIDDEN TUNNELS (Engineering)\n20. MYSTERY OF THE SCREAMING ROBOT (Mechanical devices)\n21. THE PHOTO SPIES (Everyday items)\n22. BIKINI GIRLS OF THE MEDITERRANEAN (Clothing and adornment)\n23. THE CRYSTAL SKULL (Art and sculpture)\n24. WHAT HAPPENED AFTER THE CAR CRASH (Health and medical)\n26. THE MERCURY SECRET (Flight)\n27. To the moon and beyond - WERE WE ON THE MOON IN 2309 B.C.? (To the moon and beyong)\n28. COULD SCIENCE MAKE YOU INVISIBLE? (Some intriguing secrets)\n29. TOO LATE FOR ESCAPE (Weaponry)\nEPILOGUE\nAPPENDIX: Notes on the Crespi Collection\nBIBLIOGRAPHY\nOTHER BOOKS\nNOTES\n \n Archaelogist Jonathan Gray stumbled upon something that shocked him!...a whole cache of &quot;out of place&quot; items that should not exist. And they weren't just in one place. There was a global pattern to them. This pattern showed a lost science and technology. That's when he knew someone had to speak up. This content was of tremendous value. \n\n-MACHINERY: Did you know that the Egyptians bored into granite rock with drills that turned 500 times faster than modern power drills?\n\n-ANCIENT AMERICA: Did you know that a Chinese mapping survey of North America in 2200 BC described a sunrise over the Grand Canyon, black opals and gold nuggets in Nevada, and seals frolicking in San Francisco Bay?\n\nThis is the most amazing archaeology book you'll ever see!\nDead Men's Secrets is an assemblage of astonishing discoveries.....\nA lost super science emerges from the sea floor, jungle and desert sands of our planet... over 1,000 forgotten secrets. It will SHOCK you. SEE this world as you've never seen it before. DISCOVER answers you never had. GAIN a new enjoyment. HAVE FACTS at your fingertips to amaze your friends.\nInternational explorer, archaeologist and author Jonathan Gray has traveled the world to gather data on ancient mysteries. He has penetrated some largely unexplored areas, including parts of the Amazon headwater. The author has also led expeditions to the bottom of the sea and to remote mountain and desert regions of the world. He lectures internationally. \n\nTheir are also some extra content to include:\n\n-Killing of a Paradise\n-Babel\n-Suwit\n-What really happened to the Dinasours\n-Solomons Fleet Mystery\n-Goverment Cover up\n \n","torrent":{"xt":"urn:btih:d61f020de2b8bf2b267ac00ac40213110a072072","amp;dn":"Johnathan+Gray-DeadMens+Secrets","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d61f020de2b8bf2b267ac00ac40213110a072072","infoHashBuffer":{"type":"Buffer","data":[214,31,2,13,226,184,191,43,38,122,192,10,196,2,19,17,10,7,32,114]},"announce":[],"urlList":[]}}