{"title":"Web Proposal Writing eBook","uid":4153049,"size":564220,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d78b345158361eb06ce65a8d719d398fd901380d&amp;dn=Web+Proposal+Writing+eBook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"agent_provocateur","files":1,"time":1209036325,"description":"Learn how to write a Web design proposal\n\t \nWhy does a client choose one Web consultant over another?\n\n    * Is it because one is cheaper than the other?\n      Not always. My fees are often higher than my competitors&amp;#039;.\n    * Is it because one firm is bigger than the other?\n      No. I&amp;#039;m a one-man company and I regularly win pitches against larger, more-established firms.\n    * Is it because one firm is more local?\n      Definitely not. I work with clients in Ontario, all over the United Kingdom and Paris, France.\n\nSo how do you make clients choose you instead of one of your competitors? By proving you&amp;#039;re capable of meeting clients&amp;#039; requirements.\n\nSo why are clients choosing to work with me rather than one of my many bigger and more-established competitors? Because I have a tried and tested process of determining what clients want and convincing them that I can deliver it. It&amp;#039;s a step-by-step process that you can learn and duplicate from my guide, Web Proposal Writing.\nStep One: Find out what clients want.\n\nThis is what I call the Needs Analysis stage. I go through a series of questions that helps me to determine:\n\n    * What the client&amp;#039;s business does\n    * Why customers buy from them\n    * Who their competitors are\n    * What their objectives are for their site\n    * When their deadline is\n    * How often they will update the site and how they will do it\n    * What style of design do they like\n\nThis guide contains a sample questionnaire that you can use to analyse how best to meet your clients&amp;#039; needs.\nStep Two: Write a professional proposal.\n\nOnce you&amp;#039;ve found out exactly what it is that your clients want, you&amp;#039;re ready to begin writing your proposal. And because you&amp;#039;ve used a simple question and answer process during the Needs Analysis step, the task becomes so much easier.\n\nIn only two hours, you could produce a winning project proposal to convince your client that they should choose you.\n\nSo, how can you produce professional Web proposals?\n\nBy getting the guide - Web Proposal Writing - you&amp;#039;ll learn the process I use to win projects worth thousands. Despite being a one-man company, I consistently win pitches against bigger, better-resourced and more-established competitors - even though my prices may be higher.","torrent":{"xt":"urn:btih:d78b345158361eb06ce65a8d719d398fd901380d","amp;dn":"Web+Proposal+Writing+eBook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d78b345158361eb06ce65a8d719d398fd901380d","infoHashBuffer":{"type":"Buffer","data":[215,139,52,81,88,54,30,176,108,230,90,141,113,157,57,143,217,1,56,13]},"announce":[],"urlList":[]}}