{"title":"Magic &amp; Mayhem","uid":4513493,"size":753752100,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d79f7e82f20a239a368febddee77d9295ab3e4c9&amp;dn=Magic+%26+Mayhem&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kptch","files":1,"time":1226876530,"description":"Magic and Mayhem is a fantasy/mythology-themed real-time strategy game, designed by Julian Gollop and developed by Mythos Games. It was published by Virgin Interactive Entertainment (European release) in late 1998, and by Bethesda (North American release) soon after in 1999. Although the game received generally positive criticisms, it met a quiet public reception.\n\nThe player assumes the role of Cornelius, a young magician who yearns to become his uncle Lucan's apprentice. He arrives at Lucan's home shortly after graduation from the Hermetic Academy and eager to begin his study, only to find his uncle gone and the home in ruins.\n_____________________________________\n\n\nOk so, the game isn't even sold anywhere nowadays so I thought it'd be nice to upload it here.\n\nMount up &amp; go, you can search for a no-cd by yourself - I didn't include one as you'll need the cd anyway to hear the awesome background music by Afro Celtic Sound System... And of course there are the cutscenes which won't play without the CD (or a mounted image, all the same).\n\n\nThere's a bug in the original files you should know about: picking up a scroll crashes the game, you'll have to rename the pickview1.wav and probably pickview2.vaw as well to 'pickview1'.wav and 'pickview2'.wav.\n\n\nIt's also noteworthy that most of the game files can be freely modified - not only those which you see in the folder after installation, but the game creates some configs for such things as AI and graphic detail etc. when it's running - I'll leave it at that, those of you who know about these things or feel like experimenting can have their go at doing stupid things.\n","torrent":{"xt":"urn:btih:d79f7e82f20a239a368febddee77d9295ab3e4c9","amp;dn":"Magic+%26+Mayhem","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d79f7e82f20a239a368febddee77d9295ab3e4c9","infoHashBuffer":{"type":"Buffer","data":[215,159,126,130,242,10,35,154,54,143,235,221,238,119,217,41,90,179,228,201]},"announce":[],"urlList":[]}}