{"title":"Osho_The Last Testament-Vol3-15 A-Bravo America.mp4","uid":15303132,"size":689432319,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d814d2281bea910d13a4bfcef27d43b48aa6c9ca&amp;dn=Osho_The+Last+Testament-Vol3-15+A-Bravo+America.mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drugarica","files":1,"time":1468507716,"description":"Osho_ The Last Testament Vol 3 -15A \r\nINTERVIEW WITH JOHN TUTTLE OF KGW CHANNEL 8 IN PORTLAND.part1\r\n5 October 1985 pm in Sanai Grove\r\n........\r\nBHAGWAN:* Hello, John.\r\n\r\nQUESTION:* HELLO. BHAGWAN, WHAT DO YOUR PEOPLE TELL YOU ABOUT SIDDHA AND PRABODHI? ARE THEY ALIVE AND WHERE ARE THEY?\r\n\r\nANSWER:* My people here are almost reborn. They suffered for three and a half years under a fascist type of regime.\r\nThe criminals have escaped on their own. This is a victory without fight, without a struggle. We have not said a single word to them, but they could feel the change in the atmosphere.\r\nThe moment I started speaking again, the sannyasins felt a tremendous relief that now I am available, now nobody can enforce any kind of slavery on them. And the criminals understood it clearly, that while I am available to the sannyasins they cannot manage to go on committing the same type of things that they have been doing for three and a half years.\r\nThey have committed all major crimes.\r\nI have not said them to resign or to leave the commune. I have not said a single word, but just my presence made my people feel a strength, a courage, a freedom that made them....\r\nQ:* THE TWO PEOPLE I ASKED ABOUT, SIDDHA AND PRABODHI.... ARE YOU SUGGESTING THAT THEY WERE PART OF THESE CRIMINALS?\r\nA:* No. They were victims of the criminals........\r\nQ:* WILL YOU HELP THE FBI IN THE INVESTIGATION?\r\nA:* I have invited them -- they are already working.\r\nQ:* DO YOU EXPECT THAT THEY WILL CONVICT YOU OF SOMETHING?\r\nA:* Whatever they want to do... they should just find the criminals, whoever the\r\ncriminals are.\r\nQ:* DO YOU THINK SHEELA COMMITTED CRIMES?\r\nA:* Certainly.\r\nQ:* DO YOU UNDERSTAND WHY?\r\nA:* It is a human trait. Everybody lusts for power, but everybody does not have\r\nthe opportunity: she got the opportunity. Millions of dollars she had never seen;\r\nmillions of sannyasins who were ready to do anything that she wanted in my\r\nname.... And then she started thinking of herself as the successor or the chief\r\npriestess. These are just human frailties -- nothing to be bothered about, just\r\nordinary qualities of human beings. \r\nQ:* I WAS GOING TO ASK ABOUT THE FINANCIAL STUFF, TOO. HAS SHE\r\nTAKEN LOTS OF MONEY?\r\nA:* No, not from here. From here she has not taken a single cent. But she has\r\nalready stopped money that was going to come here, which was coming from\r\nGerman communes as a contribution for this commune. She had put in a Swiss\r\nbank forty-three million dollars, and she had put it in her own name. We are not\r\ngoing to leave it there -- that belongs to the communes. Either it should go back\r\nto the German communes or it should come to this commune. But nobody can\r\nexploit sannyasins in such a way. ...\r\n\r\nfree download Osho's audios and books from oshoworld(dot)com","torrent":{"xt":"urn:btih:d814d2281bea910d13a4bfcef27d43b48aa6c9ca","amp;dn":"Osho_The+Last+Testament-Vol3-15+A-Bravo+America.mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d814d2281bea910d13a4bfcef27d43b48aa6c9ca","infoHashBuffer":{"type":"Buffer","data":[216,20,210,40,27,234,145,13,19,164,191,206,242,125,67,180,138,166,201,202]},"announce":[],"urlList":[]}}