{"title":"Rogue State v1.11","uid":12616920,"size":560189030,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d970d4f5e76efb0376b96dfa8081c1dfe58e9b40&amp;dn=Rogue+State+v1.11&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kappel.Eyal","files":1,"time":1445531306,"description":"Title: Rogue State \r\nGenre: Indie, Simulation, Strategy \r\nPublisher: Black Shell Media\t\r\nRelease Date: 16 Oct, 2015 \r\nLanguage: English \r\n\r\nSystem Requirements: \r\nMinimum: \r\nOS: Windows 10, 8, 7, Vista, XP \r\nProcessor: 1.6 GHz \r\nMemory: 512 MB RAM \r\nGraphics: 32-bit SVGA Video card \r\nHard Drive: 1200 MB available space \r\nSound Card: Supports all DirectX-compatible sound cards \r\nRecommended: \r\nOS: Windows 10, 8, 7, Vista, XP \r\nProcessor: 2 GHz \r\nMemory: 1 GB RAM \r\nGraphics: 128 MB \r\nDirectX: Version 9.0 \r\nHard Drive: 1200 MB available space \r\nSound Card: Supports all DirectX-compatible sound cards \r\n \r\nAbout This Game \r\nYou led the revolution that freed the People's Republic of Basenji from the shackles of a corrupt monarchy. But now the new regime will be tested. You are the Glorious Leader who must hold onto power by maintaining the delicate balance between the interests of fundamentalists, capitalists, patriots, and liberals. However be aware, your brother, Farouk, consolidates power and influence with the intention to overthrow you! How will you manage affairs with your neighboring countries while ensuring you don't attract too much negative attention from the Americans? Will you be a generous donor to the United Nations? Or an international pariah building nuclear weapons in secret? The choice is yours in Rogue State. \r\nFeatures \r\nA world of possibilities! Over thirty possible state purchases, six clandestine projects, eight potential neighbors and hundreds of randomly generated events. No two games will ever be the same and the approaches you take in one game may not necessarily be successful in another. \r\nManage complex relationships that are more nuanced than war and peace. Forging unlikely alliances may just keep Basenji from the kinds of wars your leadership can't survive. Other leaders have distinct personalities that may inform your tactics. \r\nChoose cabinet leaders to help manage your country. Maintain their favor by accomplishing relevant objectives. \r\nForge alliances, develop tourism, promote trade. Invade countries, assassinate your rivals, nuke the planet. \r\nBeautiful comic imagery inspired by French comic artist Jean &quot;Moebius&quot; Giraud. \r\nThousands of lines of spoken dialogue, and the ability to play as either a male or female Head of State. \r\nBe the dictator you need to be. Tackle problems with the level of freedom or oppression you desire","torrent":{"xt":"urn:btih:d970d4f5e76efb0376b96dfa8081c1dfe58e9b40","amp;dn":"Rogue+State+v1.11","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d970d4f5e76efb0376b96dfa8081c1dfe58e9b40","infoHashBuffer":{"type":"Buffer","data":[217,112,212,245,231,110,251,3,118,185,109,250,128,129,193,223,229,142,155,64]},"announce":[],"urlList":[]}}