{"title":"Pediatric.urology.2e.2009.Gearhart.PDF.[TN1]","uid":8349143,"size":111016156,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db61abd31f72df927d3438cffed3b46e4d5394d1&amp;dn=Pediatric.urology.2e.2009.Gearhart.PDF.%5BTN1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tucakNo1","files":1,"time":1365281152,"description":"Book Description\n\nPublication Date: October 21, 2009 | \nISBN-10: 1416032045 | \nISBN-13: 978-1416032045 | \nEdition: 2\n\nPediatric Urology is an up-to-date, clinical reference that provides detailed descriptions of the best approaches for the functional, biological, and morphological aspects of the urinary tract before and after birth. John G. Gearhart, Richard C. Rink, and Pierre D. E. Mouriquand cover all areas of the field, including pediatric surgery, radiology, nephrology, endocrinology, biochemistry, and obstetrics. Access the latest research through new chapters on tissue engineering, acute scrotum, and more. The appealing new full-color design, streamlined approach, and online access at expertconsult.com make this an invaluable resource to pediatric urologists, pediatric surgeons, residents and fellows worldwide.\n\nProvides detailed descriptions of the best approaches for the functional, biological, and morphological aspects of the urinary tract before and after birth.\nFeatures the fully searchable text online at expertconsult.com for convenient reference.\n\nIncludes new chapters on tissue engineering, acute scrotum and disorders of the penis, and perinatal urological emergencies to cover the most up-to-date research in the field.\n\nPresents comprehensive coverage in a short, readable, and succinct format so that the material is easy to locate and disseminate.\n\nProvides cutting edge coverage from editors at the forefront of the specialty so you know the best available approaches.\n\nEases reference and visual understanding through an all-new full-color design.","torrent":{"xt":"urn:btih:db61abd31f72df927d3438cffed3b46e4d5394d1","amp;dn":"Pediatric.urology.2e.2009.Gearhart.PDF.%5BTN1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db61abd31f72df927d3438cffed3b46e4d5394d1","infoHashBuffer":{"type":"Buffer","data":[219,97,171,211,31,114,223,146,125,52,56,207,254,211,180,110,77,83,148,209]},"announce":[],"urlList":[]}}