{"title":"Citizen klansmen the Ku Klux Klan in Indiana","uid":11805403,"size":598316,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc1b96697762fcc902442df4fbe1afd7749b9da7&amp;dn=Citizen+klansmen+the+Ku+Klux+Klan+in+Indiana&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1428558372,"description":"Indiana had the largest and most politically significant state organization in the massive national Ku Klux Klan movement of the 1920s. Using a unique set of Klan membership documents, quantitative analysis, and a variety of other sources, Leonard Moore provides the first comprehensive analysis of the social characteristics and activities of the Indiana Klan membership and thereby reveals the nature of the group's political support. Challenging traditional assumptions about the Klan, Moore argues that in Indiana the organization represented an extraordinarily wide cross section of white Protestant society. More than 25 percent of native-born men in the state became official members. Indeed, the Klan was many times larger than any of the veterans' organizations that flourished in Indiana at the same time and was even larger than the Methodist church, the state's leading Protestant denomination. The Klan's enormous popularity, says Moore, cannot be explained solely by the group's appeal to nativist sentiment and its antagonism toward ethnic minorities. Rather, the Klan gained wide-spread support in large part because of its response to popular discontent with changing community relations and values, problems of Prohibition enforcement, and growing social and political domination by elites. Moreover, Moore shows that the Klan was seen as an organization that could promote traditional comunity values through social, civic, and political activities. It was, he argues, a movement primarily concerned not simply with persecuting ethnic minorities but with promoting the ability of average citizens to influence the workings of soiciety and government. Thus, Moore concludes, the Klan of the 1920s may not have been as much a backward-looking aberration as it was an important example of one of the powerful popular responses to social conditions in twentieth-century America.\n\nPublisher: The University of North Carolina Press (1 November 1991)\nLanguage: English\nISBN-10: 0807819816\nISBN-13: 978-0807819814","torrent":{"xt":"urn:btih:dc1b96697762fcc902442df4fbe1afd7749b9da7","amp;dn":"Citizen+klansmen+the+Ku+Klux+Klan+in+Indiana","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc1b96697762fcc902442df4fbe1afd7749b9da7","infoHashBuffer":{"type":"Buffer","data":[220,27,150,105,119,98,252,201,2,68,45,244,251,225,175,215,116,155,157,167]},"announce":[],"urlList":[]}}