{"title":"W.Chmielarz - Wampir - Dawid Wolski 1 [PDF+MOBI] [PL]","uid":13660629,"size":3579563,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc4531a9fa6e2fc1c22c7c1c7dc8e1d8d4b821b6&amp;dn=W.Chmielarz+-+Wampir+-+Dawid+Wolski+1+%5BPDF%2BMOBI%5D+%5BPL%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"everdarksoul","files":3,"time":1456240748,"description":"Wojciech Chmielarz - Wampir - cykl: Dawid Wolski, tom 1\r\njęzyk: PL / format: PDF+MOBI / jakość: bardzo dobra\r\n\r\nMateusz nie miał powodu pragnąć śmierci... Był zwykłym dwudziestolatkiem. Studiował socjologię, ale planował przenieść się na informatykę. Chciał podróżować, zwiedzić świat...\r\nPewnej majowej nocy wszedł na dach wieżowca i skoczył. Nie zostawił listu. Nikt niczego nie widział. Prokuratura uznała, że to samobójstwo...\r\n\r\nJednak dla matki Mateusza, nie wszystko wydaje się tak oczywiste. Wynajęty przez nią Dawid Wolski - prywatny detektyw, krnąbrny i o wyjątkowo niemiłym usposobieniu - rozpoczyna śledztwo, i wchodzi w zaskakująco bezwzględny świat nastolatków, a sprawa komplikuje się coraz bardziej, kiedy tajemnice gliwickich zaułków zaczynają splatać się z wirtualną rzeczywistością...\r\nCo łączyło Mateusza z Alicją - zaginioną dziewczyną, której szuka całe miasto..? Czy Mateusz miał jakiś związek z siecią nastoletnich prostytutek..?\r\nI dlaczego niektórzy członkowie jego rodziny, najwyraźniej woleliby &quot;ukręcić łeb&quot; śledztwu ?!\r\n\r\nOdpowiedzi poszukajcie wraz z Dawidem Wolskim, w pierwszym tomie nowego cyklu kryminalnego Wojciecha Chmielarza - autora bestsellerowych serii o Jakubie Mortce oraz Wiktorze Froście.\r\nSeria zatytułowana jest &quot;Cykl giliwicki - Dawid Wolski&quot;, a powieść &quot;Wampir&quot; to jego pierwsza - bardzo wysoko oceniana - odsłona.\r\n_____________________________________________________________\r\n\r\nTakiego bohatera jak Dawid Wolski polska literatura kryminalna chyba jeszcze nie miała - tak złego, pozbawionego skrupułów i dobrej woli śledczego-amatora, jakim jest ten bezwzględny i za czorta nie dający się lubić detektyw. Jakub Mortka, Teodor Szacki, Sasza Załuska, - ba! nawet Harry Hole, czy Philip Marlowe to przy nim laicy i praworządni obywatele... Dawida Wolskiego zwyczajnie NIE DA się lubić: drażni, wkurza, irytuje - jednym słowem budzi skrajne emocje. I ...fajno - i dobrze!\r\nTo nie jest wystudiowane szelmostwo, ale &quot;zło w czystej postaci&quot;. Żaden z niego super-bohater - ale konsekwentny i uparty gość, któremu nie poszło na studiach prawniczych, który z rodziną nie żyje najlepiej - a jedyne, co się dla niego liczy, to szybka forsa i święty spokój. Gdy więc otrzymuje zlecenie, żeby ponownie zbadać sprawę śmierci Mateusza, którą prokuratura i policja uznały za samobójstwo, nie waha się ani przez moment wietrząc w tej sprawie łatwy zarobek - za nic...\r\nJednak to, co z początku wydawało się prostym zleceniem, którego celem było przede wszystkim wyciągnięcie forsy od zrozpaczonej matki chłopaka, poniewczasie okazuje się wyjątkowo skomplikowaną zagadką. Śmierć młodego, pełnego ambicji i marzeń Mateusza, który skoczył z dachu gliwickiego wieżowca, staje się więc początkiem trudnej drogi. Drogi, którą Wolski musi pokonać, żeby dowiedzieć się, co naprawdę stało się tamtej feralnej nocy...\r\nDrogi, u celu której leży także wyjaśnienie zagadki zniknięcia Alicji - dziewczyny poszukiwanej przez niemal wszystkich mieszkańców miasta","torrent":{"xt":"urn:btih:dc4531a9fa6e2fc1c22c7c1c7dc8e1d8d4b821b6","amp;dn":"W.Chmielarz+-+Wampir+-+Dawid+Wolski+1+%5BPDF%2BMOBI%5D+%5BPL%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc4531a9fa6e2fc1c22c7c1c7dc8e1d8d4b821b6","infoHashBuffer":{"type":"Buffer","data":[220,69,49,169,250,110,47,193,194,44,124,28,125,200,225,216,212,184,33,182]},"announce":[],"urlList":[]}}