{"title":"avast! Pro Antivirus+ Internet Security+ Premier 2016 11.1.2241","uid":12681429,"size":680315446,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dc75dd491696e0871905bc0753c63a12e88e4b6e&amp;dn=avast%21+Pro+Antivirus%2B+Internet+Security%2B+Premier+2016+11.1.2241+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OnlyByTheRain","files":4,"time":1446564737,"description":"[b]avast! Pro Antivirus / Internet Security / Premier 2016 11.1.2241 Final[/b]\r\n\r\n[img]https://dump.bz/storage-1/0315/fFHt37svVU5HSNiCkBOfPidXw9g9Udca.jpg[/img]\r\n\r\n[b]Our most advanced security suite adds military-grade data shredding and automatic software updates in addition to antivirus, firewall, and Home Network Security. avast! is only the most trusted name in antivirus, actively protecting more than 200 million PCs, Macs and Androids.\r\n\r\nAutomatic software updates\r\nHackers love to exploit old software. It’s the weakest link in most people’s security. Avast Premier automates software updating so you don’t have to think about it.\r\n\r\nPutting you a few steps ahead\r\nLooking for the ultimate? You're in the right place. In addition to all the features of Internet Security, you are getting advanced security measures keeping your PCs and network even safer.\r\n\r\nYes, your PC can run it\r\nIf your PC can run the full version of Windows 8.1, it can run Premier. Period.\r\n\r\nSystem Requirements\r\nYou need at least Windows XP (with SP2) installed. Windows Vista, 7, 8, and even 8.1 are fully supported (unless your device runs the Starter or RT edition) in both the 32- and 64-bit variant. A 10-year old Pentium 3 processor will do, with 128 MB RAM and 2 GB of hard-drive space. And now imagine the stellar performance with your new hardware!\r\n\r\nWhat's new:\r\n\r\nNEW: Passwords - Avast can now manage your passwords and generate strong passwords for you. Just one password to remember.\r\n - checks your passwords security\r\n - stores your passwords securely\r\n - includes browser extensions for easier logging in and form filling\r\n - generates strong passwords\r\n\r\nNEW: SafeZone browser - Replaced the SafeZone for safer shopping and banking in Pro, Internet Security and Premier\r\n - Pay Mode: It isolates the session and protects it from possible keyloggers or other malicious software secretly lurking on your computer. With Pay Mode you can perform all your financial transactions in peace, without fear of your password or other personal details being stolen. Pay Mode runs automatically on banking site, but it can be also turned on manually.\r\n - Shielded Window: To open there suspicious websites and to ensure full anonymity\r\n - Ad Blocking: includes built in ad blocker extension\r\n - Video downloading for offline viewing\r\n - Easy setup: Automatically imports your bookmarks, history and cookies from your current default browser\r\n\r\n\r\nNEW: User interface - More space for content, easy control\r\n\r\nNEW: Feedback possible directly from program - report bugs, feature requests and other suggestions easier\r\n\r\nIMPROVED: Home network security now detects more router vulnerabilites and shows more details\r\n\r\nIMPROVED: Installation - it should be now faster and less obtrusive.\r\n\r\nIMPROVED: WebShield HTTPS Scanning - We introduced a new method of HTTPs scanning. It is used in Firefox, Chrome and Opera. It works without changing the certificates and the security parameters and certificates are verified by the browser itself, including checks for untrusted or revoked certificates.\r\n\r\n+ Many other minor tweaks and bug fixes[/b]","torrent":{"xt":"urn:btih:dc75dd491696e0871905bc0753c63a12e88e4b6e","amp;dn":"avast%21+Pro+Antivirus%2B+Internet+Security%2B+Premier+2016+11.1.2241+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc75dd491696e0871905bc0753c63a12e88e4b6e","infoHashBuffer":{"type":"Buffer","data":[220,117,221,73,22,150,224,135,25,5,188,7,83,198,58,18,232,142,75,110]},"announce":[],"urlList":[]}}