{"title":"Las Cuatro Bodas de Marisol [DVDRIP][spanish]","uid":6331353,"size":766642708,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dcf6824c9b2f0f746b16280ae625e2f10510f782&amp;dn=Las+Cuatro+Bodas+de+Marisol+%5BDVDRIP%5D%5Bspanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"furtaperas","files":-1,"time":1303297350,"description":"Pais: EspaÃƒÂ±a\nIdioma: EspaÃƒÂ±ol\nGÃƒÂ©nero: Comedia\n\nAÃƒÂ±o: 1967\nActores: Marisol, Jean-Claude Pascal, Isabel GarcÃƒÂ©s, Daniel MartÃƒÂ­n, Emilio GutiÃƒÂ©rrez Caba.\n\nMarisol es una actriz de cine que mantiene un noviazgo con Frank Moore (Jean-Claude Pascal), el director de la pelÃƒÂ­cula que estÃƒÂ¡ rodando. La relaciÃƒÂ³n entre los novios va viento en popa y deciden contraer matrimonio. Sin embargo, Marisol estÃƒÂ¡ recelosa de que Frank, compinchado con el productor, Gordon, sÃƒÂ³lo quiera casarse para dar publicidad a la pelÃƒÂ­cula. Por ello, decide tramar un plan: llama a tres antiguos pretendientes y les hace acudir a la boda. Los tres, ante todos los medios que la televisan, exigen que se suspenda la ceremonia, ya que Marisol ya ha dado palabra de matrimonio a los tres.\nMarisol, poco despuÃƒÂ©s, cuenta las tres historias a Frank, todas ellas protagonizadas por ella, su madre (Isabel GarcÃƒÂ©s) y cada uno de los pretendientes. En la primera, el pretendiente es Martin (Axel Darna), un cantante inglÃƒÂ©s que la conoce mientras ella se escapa de un internado en Londres. En la segunda, el pretendiente es Rafael (Emilio GutiÃƒÂ©rrez Caba), un maletilla que ella encuentra en el cortijo donde estÃƒÂ¡ viviendo. Decide amadrinarle y organiza una corrida para ÃƒÂ©l y hacerle famoso.\nEn la tercera y ÃƒÂºltima, el pretendiente es el doctor Pierre DurÃƒÂ¡n (Daniel MartÃƒÂ­n) un mÃƒÂ©dico que trabaja en la selva africana, al que conoce cuando Marisol, que estÃƒÂ¡ rodando su primera pelÃƒÂ­cula con Gordon, interpretando a una monja, se hace pasar por monja autÃƒÂ©ntica para que la asesora del equipo de rodaje, que debÃƒÂ­a irse con el doctor, pueda ver a sus padres. Marisol cuenta todas estas historias a Frank, pero su reacciÃƒÂ³n no serÃƒÂ¡ la que Marisol espera..","torrent":{"xt":"urn:btih:dcf6824c9b2f0f746b16280ae625e2f10510f782","amp;dn":"Las+Cuatro+Bodas+de+Marisol+%5BDVDRIP%5D%5Bspanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcf6824c9b2f0f746b16280ae625e2f10510f782","infoHashBuffer":{"type":"Buffer","data":[220,246,130,76,155,47,15,116,107,22,40,10,230,37,226,241,5,16,247,130]},"announce":[],"urlList":[]}}