{"title":"True Romance - The Tarantino Cut (new extended &amp; recut version)","uid":4452308,"size":1484343721,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dd213ef25d409f1f881dc0757a1862698512a876&amp;dn=True+Romance+-+The+Tarantino+Cut+%28new+extended+%26+recut+version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"spoke.of","files":5,"time":1224320053,"description":"Think you've seen True Romance?  Think again. \n\t\nYou certainly haven't seen the film that its writer envisioned.\n\nThe original screenplay by Quentin Tarantino, much like his Reservoir Dogs and Pulp Fiction,  had an answers-first, questions-later structure to it.  And that, more than anything else, was what made it interesting. \n\nTrue Romance was written, very carefully written, to be a non-linear story.  And Tony Scott, the director, shot it that way.  But at some point during the editing process, Scott got cold feet.  Worried that the audience wouldn't understand the movie, he decided to put all the scenes in chronological order.\n\nAnd he ruined the film.\n\nThe story of True Romance was supposed to be divided into three parts.  Part one: the characters know more than the audience.  Part two: the audience catches up.  Part three: the audience knows more than the characters.  \n\nBy putting the film in chronological order, Scott spoiled everything.  Say goodbye to all the surprises and say goodbye to anything approaching subtlety.  Say hello to dialogue that's repetitious and pointless. \n\nThis is especially true of the early part of the movie, where every line was meant to tease the viewer and slowly dole out information.  Scott took that away.\n\nAll this to say that assembling a 'Tarantino' cut of True Romance has been a long held dream of mine.\n \nUsing the original screenplay as a guide, and re-inserting as much cut footage as possible, this new version of the film is probably the closest any of us will ever get to seeing Tarantino's vision.\n\nWith the scenes of the film back in their proper non-linear order,  small throwaway lines are suddenly much more meaningful, and otherwise minor sequences suddenly become quite relevant. \n\nThe deleted scenes are also worth mentioning.  Quite a bit was cut from the theatrical release.  Dialogue that was deemed too nasty, or scenes that served as bridges in the original structure were all removed.\n \nThe saddest, most inexcusable victim of the Scott cut would have to be the character of Alabama.  For reasons (at least to my knowledge) unknown, Scott left most of her best moments on the cutting room floor.  Several scenes where she talks with Clarence, tells him stories about herself, or just plain explains where her head is at, were inexplicably omitted.\n\nBut that's the beauty of fan edits.  In this new cut, everything is restored.  The scenes all return to their proper place, and Alabama gets the screen time she always deserved.\n\nOh, and the ending is fixed, too.  Gone is the happy happy 'Magic eye patch, frolicking on the beach, Elvis Junior' ending.  We return instead to Tarantino's much nastier, much more satisfying finale.\n\nBefore I go, I'd like to mention that I did't like True Romance very much when I first saw it.  Other than the Hopper/Walken scene, and Oldman's trippy performance, I thought it was fairly forgettable.  Just a boy meets girl story.\n\nSure, the boy was psychotic and the girl was a hooker and they kill or are responsible for the deaths of nearly every person they meet, but that's besides the point.  It just didn't do much for me.  Of course, at the time, I didn't know that it had been so severely mangled.  At the time, all I knew was that it didn't have that spark that made Tarantino's other work sing. \n\nWell, now it hits the high notes.  You're welcome.\n\nI've been waiting fifteen years for someone at the studio to wise up and realize that there's money to be made from a 'Tarantino' cut of True Romance.  Fact is, I'm pretty sure that if someone put the work in, this would surely merit a re-release in theaters.  Hey, if a less good version of Donnie Darko can get one, 'The Tarantino cut' of True Romance should be a shoe-in.\n\nThanks for listening.  \n\n\nFeel free to send any praise, complaints, or legal threats to:\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;e99a9986828cc7868fc79b868488878a8ca98e84888085c78a8684&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n\nOh, and hey, my upload is wicked crappy.  Please help seed.  I'd really like to get this out there.  And spread the word.\n","torrent":{"xt":"urn:btih:dd213ef25d409f1f881dc0757a1862698512a876","amp;dn":"True+Romance+-+The+Tarantino+Cut+%28new+extended+%26+recut+version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd213ef25d409f1f881dc0757a1862698512a876","infoHashBuffer":{"type":"Buffer","data":[221,33,62,242,93,64,159,31,136,29,192,117,122,24,98,105,133,18,168,118]},"announce":[],"urlList":[]}}