{"title":"Woody Allen - Stand Up Comic  1964-1968","uid":7911637,"size":72415940,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ddbe4fcfb12fa1bef76a4ce21f9ccc028ceab247&amp;dn=Woody+Allen+-+Stand+Up+Comic++1964-1968&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jazznbluz","files":25,"time":1355235158,"description":"Allen's performances on this album alone (film and literary career notwithstanding) secure his place in the pantheon of American comedy. Standup Comic is a compilation of three historic albums: Woody Allen, recorded at Mr. Kelley's in Chicago 1964; Woody Allen, Vol. 2, at the Shadows in Washington D.C. in 1964; and The Third Woody Allen Album, recorded at Eugene's in San Francisco, 1968. Standup Comic and its vinyl counterpart, Woody Allen: The Nightclub Years (1964-1968), contain the same routines. Some versions of the latter are unedited from the source material, while the former has many edits which, in most cases, make the routines stronger. In his trademark style, both bizarre and surreal, Allen takes you on a comedic roller coaster with stunning confidence. Many classic routines on this album foreshadow much of Allen's cinematic output, laying the groundwork for things to come. &quot;Brooklyn&quot; foreshadows a segment in Radio Days. In his NYU routine, Allen tells the audience about &quot;cheat[ing] on [his] metaphysics final, [he] looked within the soul of the boy sitting next to [him].&quot; This zinger is reused in Annie Hall. On Allen's honeymoon night, he claims his wife stopped in the middle of everything to &quot;give him a standing ovation&quot;; that is the effect this album would have on anyone. \n","torrent":{"xt":"urn:btih:ddbe4fcfb12fa1bef76a4ce21f9ccc028ceab247","amp;dn":"Woody+Allen+-+Stand+Up+Comic++1964-1968","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddbe4fcfb12fa1bef76a4ce21f9ccc028ceab247","infoHashBuffer":{"type":"Buffer","data":[221,190,79,207,177,47,161,190,247,106,76,226,31,156,204,2,140,234,178,71]},"announce":[],"urlList":[]}}