{"title":"Antiques.Roadshow.S37E15.Liverpool.Metropolitan.Cathedral.1.mp4","uid":11791320,"size":657778734,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:de826582106c0a7071d17b85736468dc8f1aa736&amp;dn=Antiques.Roadshow.S37E15.Liverpool.Metropolitan.Cathedral.1.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xela_5","files":1,"time":1427951809,"description":"Antiques Roadshow UK - S37E15 - Broadcast Sunday 22 March.\n\nI created the file using &quot;get i-player&quot; so it is bigger than normal and I have no idea how to edit or make it smaller!\n\n\nThe Antiques Roadshow returns with a visit to Liverpool Metropolitan Cathedral, where treasures include a miniature kitchen range, a piece of the city's heritage found in a French flea market and a sextant used at sea in the race to rescue survivors of the Titanic. \n\nDeep in the vast crypt designed by architect Sir Edwin Lutyens, the Roadshow team discover an eclectic array of treasures including a miniature kitchen range crafted in metal, a fragment of a 12th-century Hindu sculpture found buried in a garden and a 1970s barber's chair that is very much 'on trend.'\n\nSpecialist Will Farmer tells the moving story behind a 1930s Lenci ceramic of a mother and child and hears how 13 carved glass door panels that once graced the foyer of the Liverpool Philharmonic Hall were rescued from a flea market in France. \n\nThe team also admire a chunky merchant's ring that might date from the 15th century and a collection of items belonging to Captain Arthur Rostron, the man in charge of the Carpathia on the night it received the fateful message that the Titanic had struck an iceberg, leading to a desperate race to rescue survivors.\n\nIn this episode's Antiques Roadshow Uncovered, Fiona Bruce meets a couple who appeared on one of our First World War specials and unites them with a viewer who contacted the show with news of a moving discovery","torrent":{"xt":"urn:btih:de826582106c0a7071d17b85736468dc8f1aa736","amp;dn":"Antiques.Roadshow.S37E15.Liverpool.Metropolitan.Cathedral.1.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de826582106c0a7071d17b85736468dc8f1aa736","infoHashBuffer":{"type":"Buffer","data":[222,130,101,130,16,108,10,112,113,209,123,133,115,100,104,220,143,26,167,54]},"announce":[],"urlList":[]}}