{"title":"When Parents Text - Lauren Kaelin &amp; Sophia Fraioli","uid":9225175,"size":997144,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dee3c8285afb633003ec8feb606c4fce06c64da7&amp;dn=When+Parents+Text+-+Lauren+Kaelin+%26amp%3B+Sophia+Fraioli&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Mohammad_AT","files":3,"time":1385001065,"description":"A collection of insanely funny texts between parents and kids, &quot;When Parents Text&quot; is a surprisingly affecting window into the complicated time when parents aren't ready to let go, and kids aren't ready to &quot;be &quot;let go. The parents are well-meaning but hopeless, silly and a little corny, and befuddled by the technology. The kids are bewildered yet patient: the perfect straight man. And the authors, two recent college graduates, Lauren Kaelin and Sophia Fraioli, have an unerring editorial instinct to select the funniest, sweetest, quirkiest, most-telling exchanges.There's the revelatory: &quot;Mom: My fingers are saying words. This is amazing.&quot; The virtual scolding: &quot;Dad: I will deal with your sassy behavior when I get home. Meanwhile have some fiber.&quot;The autofill-challenged: &quot;Mom: dig up some tadpoles on ur way homo. Me: ummm, what? Mom: It autocorrected me. I mean to say dig up some tadpoles on ur way homo. (4 minutes later) Mom: PICK UP SOME TAMPONS ON YOUR WAY HOME.&quot;The manically inappropriate: &quot;Mom: Woo Hoo--Ruth died, you know Uncle Lyman's wife, BUT I have your Braves tickets and check on the table!!&quot;And the downright inexplicable: &quot;Dad: You could poop your pants in the yankee candle store and no one would know.&quot;Launched as a website, www.whenparentstext.com is a phenomenon. It receives 300,000 to 500,000 page views a day, with features in &quot;The Huffington Post,&quot; &quot;Entertainment Weekly,&quot; &quot;College Humor,&quot; and more. &quot;When Parents Text&quot; includes the best of texts from the website, plus more than 50 percent all-new material never before published.Includes an emoticon glossary and 16-page color insert of MMS texts-- multimedia messaging service, aka, bizarre photos from mom and dad. It's the perfect gift for every text-savvy kid to give to his or her parents.","torrent":{"xt":"urn:btih:dee3c8285afb633003ec8feb606c4fce06c64da7","amp;dn":"When+Parents+Text+-+Lauren+Kaelin+%26amp%3B+Sophia+Fraioli","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dee3c8285afb633003ec8feb606c4fce06c64da7","infoHashBuffer":{"type":"Buffer","data":[222,227,200,40,90,251,99,48,3,236,143,235,96,108,79,206,6,198,77,167]},"announce":[],"urlList":[]}}