{"title":"PC Auto Shutdown v6.2 Key + Keygen [4realtorrentz]","uid":12849372,"size":1168984,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:df132a4b9abf05db1a3cec03fcad4b8486d9fc34&amp;dn=PC+Auto+Shutdown+v6.2+Key+%2B+Keygen+%5B4realtorrentz%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"menin1","files":1,"time":1448592230,"description":"PC Auto Shutdown v6.2 Key + Keygen [4realtorrentz]\r\n\r\nPC Auto Shutdown is a handy software that helps you automatically\r\nshutdown, power off, reboot, hibernate, suspend or log off\r\ncomputers at schedule time you specifies. It can shut down\r\ncomputers at schedule time when no user is logged in or when\r\ncomputers are in suspended power conservation mode. It gives you\r\ndifferent ways to schedule the shutdown event for your needs, such\r\nas daily, weekly and only once. During the shutdown, it can clean\r\nup Recycle Bin, temporary files, IE cache, IE cookies, IE history,\r\nIE auto- complete entries and recent document list to improve\r\nsystem performance and protect your privacy.\r\n\r\nSummary:\r\n\r\n- A guided schedule creation process\r\nThe user interface of the program consists of a wizard, where you can organize several timers. In the first part you set up one or multiple timers - add a timer title, select shutdown actions, time (in hours and minutes), and activate it once, daily, on week days, or once a week, but you can also edit or delete these tasks.\r\n\r\n- Manage time settings and keep them secured\r\nIn the following step, the program requires you to configure the countdown duration time before a shutdown event is activated, enable / disable the display of the system tray icon for easy access, as well as the Abort button in countdown window, and prevent users from changing the system time.\r\n\r\n- Clever integration of hotkey support\r\nAdditionally, you can assign hotkeys to shutdown actions (power off, shutdown, reboot, hibernate, suspend, log off), but also enable and select sound to play while the shutdown command is activated (loop sound, adjust volume).\r\n\r\n- Cleans your computer before triggering a command\r\nFurthermore, you can clean up some items during the shutdown action - Recycle Bin, Windows temporary files, Internet Explorer (temporary files, cookies, browser history, address bar history) and recent documents list, as well as enable password protection and the logging of shutdown events (view/empty log file).\r\n\r\n- As a conclusion\r\nAll in all, the program uses a small amount of system resources, but it doesn't come with a help file or more advanced settings. Nevertheless, it is a decent application for scheduling the shutdown operation on your computer, saving you a decent amount of time.\r\n\r\nWhat's new in PC Auto Shutdown 6.0:\r\n\r\n- Support Windows 10\r\n\r\nInstructions:\r\n\r\n1. Unpack and install\r\n2. Use given details to register\r\n3. Done","torrent":{"xt":"urn:btih:df132a4b9abf05db1a3cec03fcad4b8486d9fc34","amp;dn":"PC+Auto+Shutdown+v6.2+Key+%2B+Keygen+%5B4realtorrentz%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df132a4b9abf05db1a3cec03fcad4b8486d9fc34","infoHashBuffer":{"type":"Buffer","data":[223,19,42,75,154,191,5,219,26,60,236,3,252,173,75,132,134,217,252,52]},"announce":[],"urlList":[]}}