{"title":"Hackers Are People Too - 2008","uid":10692058,"size":366626088,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:df1314d928051e884ffe57b4ce1f0d4badc14e93&amp;dn=Hackers+Are+People+Too+-+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DrPHead","files":3,"time":1407131381,"description":"Hackers Are People Too - 2008\nis a 2008 documentary film about the hacker community, \nwritten and directed by Ashley Shwartau.\n\nHackers do laundry. Hackers like movies. Hackers are people and could be your neighbors, your brother, your friends. Presenting a portrait of the hacking community, created by the community themselves, this film breaks down negative stereotypes by letting hackers show you that they are really no different from anyone else. Delving into areas such as the way hackers think, what is hacking, hackers in the media, and women in the security-hacking field, this film will have you questioning your ideas about what a hacker really is.\n\nA portrait of the hacking community. In an effort to challenge preconceived notions and media-driven stereotypes HACKERS ARE PEOPLE TOO lets hackers speak for themselves and introduce their community to the public.\n\nFilmed on location at 2 popular hacker conventions, this documentary presents the hacking community from their own perspective, providing insight into what makes a hacker, the hacking community and the problems the hacking community faces. With only the words of hackers, this documentary tries to break stereotypes and misconceptions, showing the public that hackers are indeed people.","torrent":{"xt":"urn:btih:df1314d928051e884ffe57b4ce1f0d4badc14e93","amp;dn":"Hackers+Are+People+Too+-+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df1314d928051e884ffe57b4ce1f0d4badc14e93","infoHashBuffer":{"type":"Buffer","data":[223,19,20,217,40,5,30,136,79,254,87,180,206,31,13,75,173,193,78,147]},"announce":[],"urlList":[]}}