{"title":"Audience - The House On The Hill [1971][320KBPS]","uid":11614936,"size":130711792,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:df23f9b4f187ab0077be5d345e0807099681ed38&amp;dn=Audience+-+The+House+On+The+Hill+%5B1971%5D%5B320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LameDuck69","files":12,"time":1417493286,"description":"Audience - The House On The Hill [1971]\n\n\n\n\n01. Jackdaw   \n02. You're Not Smiling   \n03. I Had A Dream    \n04. Raviole    \n05. Nancy   \n06. Eye To Eye    \n07. I Put A Spell On You   \n08. The House On The Hill   \n09. Indian Summer \n\n\n\n\n320 KBPS [CBR]\nCover Art\n\nFrom Wikipedia:\n\n\nAudience is a cult British art rock band which existed between 1969 and 1972, and reformed in 2004.\n\nThe original band consisted of Howard Werth (born Howard Alexander Werth, 26 March 1947, The Mother's Hospital, Clapton, East London) on nylon-strung electric acoustic guitar and vocals, Keith Gemmell (born Keith William Gemmell, 15 February 1948, Hackney Hospital, Hackney, East London) on tenor and alto sax, flute and clarinet, bass guitarist and vocalist Trevor Williams (born Trevor Leslie Williams, 19 January 1945, Hereford General Hospital, Hereford, Herefordshire, and drummer/vocalist Tony Connor (born Anthony John Connor, 6 April 1947, Romford, Havering).\n\n--------------------------------------------------------------------------------\n\nAudience rose from the ashes of a semi-professional soul band named 'Lloyd Alexander Real Estate', which had included all the Audience members except Connor, who had unsuccessfully auditioned for the earlier band when John Richardson left to form The Rubettes. However, when Werth, Williams, and Gemmell decided to form their new band, they thought of Connor. The 'Lloyd Alexander Real Estate' issued one 45rpm single on President PT157 in 1967 &quot;Gonna Live Again&quot;/&quot;Watcha' Gonna Do (When Your Baby Leaves You)&quot;, a Mod R&amp;B record.\n\nWithin weeks of starting rehearsals, Audience had acquired management, a publishing contract, a residency at Ronnie Scott's Jazz Club, and a recording contract with Polydor, with whom they recorded their first album Audience, an acoustic guitar-driven album featuring Gemmell's saxophone often electrically altered to resemble an electric lead guitar and with string and horn arrangements by Andrew Pryce Jackman. But the band was dissatisfied with the record company's promotional approach (a single, &quot;Too Late I'm Gone&quot; from the album had been planned and was canceled), and temporarily moved to Switzerland to avoid involvement in proposed publicity stunts.\n\nBy the end of the year, the band was drawing public and journalistic acclaim for their songs, arrangements, and stage act. They had also been commissioned to write the score for Bronco Bullfrog, an East End skinhead film directed by Barney Platts-Mills, which established a genre subsequently taken up by Mike Leigh.\n\n--------------------------------------------------------------------------------\n\nThe House on the Hill is the third album by the British art rock band Audience, released in 1971. At about the same time, a single, &quot;Indian Summer&quot;, reached number 74 on the Billboard Hot 100;. The North American version of the album on Elektra Records added &quot;Indian Summer&quot; as the opening track, along with &quot;It Brings A Tear&quot; which had already appeared on the UK album Friend's Friend's Friend. The Elektra LP dropped the song &quot;Eye To Eye&quot;.\n\nBoth the UK and North American LPs were originally issued as gatefold. The UK gatefold contains black-and-white photos of each band member. The Elektra Records gatefold contains the album lyrics with a photo of the &quot;house on the hill&quot; in the background. The Elektra LP was later reissued in the early 1980s, non-gatefold.\n\nThe 1991 Virgin Records UK CD release, issued in the U.S. on Caroline Records, used the British LP track listing, adding the single &quot;Indian Summer&quot; to the end of the album. The Elektra Records version of The House On The Hill has never been issued on CD.\n\n--------------------------------------------------------------------------------\n\nPersonnel:\n\n\nTony Connor: drums, percussion and vibes\n\nTrevor Williams: bass guitar and vocals\n\nHoward Werth: electric classical guitar and vocals\n\nKeith Gemmell: tenor saxophone, recorder, clarinet and flute\n\nRobert Kirby: string arrangement and conducting for &quot;Raviole&quot;\n\nMembers of the LSO: strings on &quot;Raviole&quot;","torrent":{"xt":"urn:btih:df23f9b4f187ab0077be5d345e0807099681ed38","amp;dn":"Audience+-+The+House+On+The+Hill+%5B1971%5D%5B320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df23f9b4f187ab0077be5d345e0807099681ed38","infoHashBuffer":{"type":"Buffer","data":[223,35,249,180,241,135,171,0,119,190,93,52,94,8,7,9,150,129,237,56]},"announce":[],"urlList":[]}}