{"title":"Olvido.(ebook).","uid":6412758,"size":11082417,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df5a838944bd48920d557e055bdff0598ad8ee2e&amp;dn=Olvido.%28ebook%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":-1,"time":1306053775,"description":"Ã‚Â¿QuÃƒÂ© es lo que determina tu identidad? Ã‚Â¿Las ropas que vistes? Ã‚Â¿La forma en la que te trata la gente? Ã‚Â¿Las experiencias y recuerdos que has ido acumulando en tu memoria?\n\nCuando Nick Petrov despierta en la cama de un hospital, la ropa que lleva es dos tallas superior a la suya, todo el mundo le trata como una vÃƒÂ­ctima... y no puede recordar cÃƒÂ³mo ha acabado allÃƒÂ­. Petrov es un brillante investigador privado, famoso por sus ÃƒÂ©xitos en casos de niÃƒÂ±os desaparecidos y que se convirtiÃƒÂ³ en una celebridad al detener a un brutal asesino en serie llamado Gerald Reasoner. Cuando una madre desesperada acude a ÃƒÂ©l para que le ayude a encontrar a su hija desaparecida, su sexto sentido le avisa de que estÃƒÂ¡ ante un caso especialmente peligroso. Tres dÃƒÂ­as mÃƒÂ¡s tarde, cuando ha reunido todas las pistas que necesita para resolver el misterio, un inesperado accidente le sume en la inconsciencia. Al recuperar el conocimiento, se da cuenta de que no recuerda nada de los dÃƒÂ­as previos a su internaciÃƒÂ³n, es decir, desde que comenzara a investigar el caso de la muchacha desaparecida. AdemÃƒÂ¡s, debe enfrentarse con la terrible noticia de que tiene un tumor en el cerebro. Sin embargo, Nick sabe que tiene un caso pendiente: reconstruir el tiempo en blanco se convierte en una obsesiÃƒÂ³n, especialmente cuando realiza un descubrimiento sorprendente que darÃƒÂ¡ un giro inesperado a su investigaciÃƒÂ³n\n\n\nCon una poderosa trama doble, Peter Abrahams ofrece una combinaciÃƒÂ³n clÃƒÂ¡sica: una novela policiaca oscura y descarnada realzada por el sorprendente final. Su escritura inteligente y una historia admirablemente entrelazada convierten a Olvido en otro clÃƒÂ¡sico de este maestro del suspense.\n","torrent":{"xt":"urn:btih:df5a838944bd48920d557e055bdff0598ad8ee2e","amp;dn":"Olvido.%28ebook%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df5a838944bd48920d557e055bdff0598ad8ee2e","infoHashBuffer":{"type":"Buffer","data":[223,90,131,137,68,189,72,146,13,85,126,5,91,223,240,89,138,216,238,46]},"announce":[],"urlList":[]}}