{"title":"CDRoller.v7.70.97-RES-patch.rar","uid":4569043,"size":5896660,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e0220b076cef1a1fedea73a6ec0599cc2f222003&amp;dn=CDRoller.v7.70.97-RES-patch.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jsph69","files":1,"time":1228990737,"description":"**********************************************************************\nCDRoller is a powerful, easy-to-use and low-cost toolset for CD/DVD data recovery. CDRoller supports industry-standard ISO 9660 file system, including Microsoft&amp;#039;s extensions for long file names support, so-called Joliet extensions. CDRoller also supports the discs formatted in UDF file system, including versions 1.02, 1.50, 2.0, 2.01 and also so-called UDF Bridge format. Support of wide set of CD, CD-R, CD-RW and DVD formats such as: CD-DA, CD-ROM, CD-WO, CD-ROM XA and Mixed-Mode CD, Stamped multisession CD, CD-MRW (&quot;Mt. Rainier&quot; CD-RW), DVD-ROM, DVD-R, DVD-RW, DVD+R, DVD+RW, DVD-RAM.\n\nFeatures:\nÃƒÂ² Effectively retrieves the data off the discs created by &quot;drag and drop&quot; CD/DVD writing software, such as well-known Roxio (Adaptec) and Ahead Nero software packages, CeQuadrat&amp;#039;s PacketCD, Sonic Solutions DLA, B&amp;#039;s CLiP and others.\nÃƒÂ² Recovers DVD video and photos, created by a wide set of standalone devices that record directly onto disks, including Hitachi, Canon, Panasonic, Samsung and Sony DVD camcorders as well as standalone video recorders.\nÃƒÂ² Includes a built-in Video Splitter. Splits the recovered VOB or VRO files into a several clips (scenes), automatically converting a &quot;raw&quot; DVD-video into MPEG files without loss of quality. Specially tested on the discs, recorded by Hitachi DVD camcorders.\nÃƒÂ² Burns a new DVD with recovered video that can be played back in the most DVD players.\nRecovers CD data written by Sony Mavica CD digital cameras.\nÃƒÂ² Includes a fault-tolerant UDF Reader. Provides direct access to UDF discs, including CDs and DVDs written by old versions of Roxio (Adaptec) DirectCD and Drag-To-Disk. Finds and retrieves accidently deleted files, files located in the corrupted folders, files on incorrectly closed disks, etc.\n&quot;On-the-fly&quot; unpacks the files initially compressed by Roxio (Adaptec) DirectCD.\nÃƒÂ² Retrieves back up files from the discs recorded in several stages (multisession discs).\nÃƒÂ² Includes a built-in CD/DVD data burner. There is no need to run third-party CD/DVD mastering software if you wish to burn a new DVD-video disc or backup your files and folders immediately after recovery. The &quot;Burn&quot; option is integrated into a common shell. Just write a new disc with recovered data shortly, without leaving CDRoller!\nÃƒÂ² Erases CD and DVD re-writable media. Supports quick and full erase methods.\nÃƒÂ² Examines disc sectors at low level. Displays the sector content in text, binary, hexadecimal or unicode mode. It also scans all sectors of a disc (selected track or file) for particular data. Recommended for engineering purposes and also for law enforcement and forensic investigators.\nÃƒÂ² Identifies the lost files on ISO/Joliet discs with the damaged file system (volume descriptors, path tables and directories), using the raw data only.\nÃƒÂ² Rescues the data from scratched, damaged or defective discs.\nÃƒÂ² Provides direct access to the hardware, bypassing the Windows File System. Looks for the lost tracks (sessions) every time when you insert a new disc into the drive\nÃƒÂ² Digitally extracts audio tracks into a wide set of wave formats.\nÃƒÂ² Tests CD/DVD readability.\nÃƒÂ² Extracts ISO Image file. Burns ISO Image file to a new disc.\nÃƒÂ² Catalogs files and folders into CD/DVD library.\nÃƒÂ² All features are integrated into a common and easy-to-use intuitive shell.\n\nSupport of wide set of CD, CD-R, CD-RW and DVD formats such as:\n* CD/DVD format CD-DA,\n* CD/DVD format CD-ROM,\n* CD/DVD format CD-WO,\n* CD/DVD format CD-ROM XA and Mixed-Mode CD,\n* CD/DVD format Stamped multisession CD,\n* CD/DVD format CD-MRW (&quot;Mt. Rainier&quot; CD-RW),\n* CD/DVD format DVD-ROM, DVD-R, DVD-RW, DVD+R, DVD+RW, DVD-RAM.\n\nChanges in Version 7.60 - June 02, 2008:\n* Current version of CDRoller.\n* Recover DVD Video updated. Added support of DVD+R DL discs created by Sony DVD camcorders.\n* Split Video updated. Now, you can assign a new name and path for each new video clip (output MPEG file) in the process. This can be useful if you split a several VOB/VRO files at the same time.\n\nOC: Windows 95/98/ME/2000/XP/2003/Vista\n","torrent":{"xt":"urn:btih:e0220b076cef1a1fedea73a6ec0599cc2f222003","amp;dn":"CDRoller.v7.70.97-RES-patch.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0220b076cef1a1fedea73a6ec0599cc2f222003","infoHashBuffer":{"type":"Buffer","data":[224,34,11,7,108,239,26,31,237,234,115,166,236,5,153,204,47,34,32,3]},"announce":[],"urlList":[]}}