{"title":"The Federalist Papers (1787-1788)","uid":4155611,"size":1221747527,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e0514624e32e97466d08fbb6309527a3372240cc&amp;dn=The+Federalist+Papers+%281787-1788%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"groverblue","files":85,"time":1209140804,"description":"The Federalist Papers are a series of 85 articles advocating the ratification of the United States Constitution. Seventy-seven of the essays were published serially in The Independent Journal and The New York Packet between October 1787 and August 1788. A compilation of these and eight others, called The Federalist, was published in 1788 by J. and A. McLean.\n\nThe Federalist Papers serve as a primary source for interpretation of the Constitution, as they outline the philosophy and motivation of the proposed system of government. The authors of the Federalist Papers wanted to both influence the vote in favor of ratification and shape future interpretations of the Constitution. According to historian Richard B. Morris, they are an &quot;incomparable exposition of the Constitution, a classic in political science unsurpassed in both breadth and depth by the product of any later American writer.&quot;\n\nThe articles were written by Alexander Hamilton (nos. 1, 6?9, 11?13, 15?17, 21?36, 59?61, and 65?85), James Madison (nos. 10, 14, 18?20, 37?58, and 62?63), and John Jay (2?5, and 64). They appeared under the pseudonym &quot;Publius,&quot; in honor of Roman consul Publius Valerius Publicola. Madison is generally credited as the father of the Constitution and became the fourth President of the United States. Hamilton was an active delegate at the Constitutional Convention, and became the first Secretary of the Treasury. John Jay became the first Chief Justice of the United States.","torrent":{"xt":"urn:btih:e0514624e32e97466d08fbb6309527a3372240cc","amp;dn":"The+Federalist+Papers+%281787-1788%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0514624e32e97466d08fbb6309527a3372240cc","infoHashBuffer":{"type":"Buffer","data":[224,81,70,36,227,46,151,70,109,8,251,182,48,149,39,163,55,34,64,204]},"announce":[],"urlList":[]}}