{"title":"Black and White and Noir - Americas Pulp Modernism (Art Ebook).p","uid":9967318,"size":4273375,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e056299cf1e18997afc00df68147c56c8b32421b&amp;dn=Black+and+White+and+Noir+-+Americas+Pulp+Modernism+%28Art+Ebook%29.p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1397591060,"description":"Columbia University Press / 2002 / English / 325 / ISBN: 0231114818 / 4 MB / pdf\n\nBlack &amp; White &amp; Noir explores America's pulp modernism through penetrating readings of the noir sensibility lurking in an eclectic array of media: Office of War Information photography, women's experimental films, and African-American novels, among others. It traces the dark edges of cultural detritus blowing across the postwar landscape, finding in pulp a political theory that helps explain America's fascination with lurid spectacles of crime. We are accustomed to thinking of noir as a film form popularized in movies like The Maltese Falcon, The Big Sleep, and, more recently, Quentin Tarantino's Pulp Fiction. But it is also, Paula Rabinowitz argues, an avenue of social and political expression. This book offers an unparalleled historical and theoretical overview of the noir shadows cast when the media's glare is focused on the unseen and the unseemly in our culture. Through far-ranging discussions of the Starr Report, movies such as Double Indemnity and The Big Heat, and figures as various as Barbara Stanwyck, Kenneth Fearing, and Richard Wright, Rabinowitz finds in film noir the representation of modern America's attempt to submerge and mask its violent history of racial and class antagonisms. Black &amp; White &amp; Noir also explores the theory and practice of stilettos, the ways in which girls in the 1950s viewed film noir as a secret language about their mothers' pasts, the extraordinary tone-setting photographs of Esther Bubley, and the smutty aspect of social workers' case studies, among other unexpected twists and provocative turns.","torrent":{"xt":"urn:btih:e056299cf1e18997afc00df68147c56c8b32421b","amp;dn":"Black+and+White+and+Noir+-+Americas+Pulp+Modernism+%28Art+Ebook%29.p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e056299cf1e18997afc00df68147c56c8b32421b","infoHashBuffer":{"type":"Buffer","data":[224,86,41,156,241,225,137,151,175,192,13,246,129,71,197,108,139,50,66,27]},"announce":[],"urlList":[]}}