{"title":"A Revolution In Eating by James E. McWilliams","uid":9418460,"size":12747932,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e082d148768f66f1487eace7fd7c7df53e6a8114&amp;dn=A+Revolution+In+Eating+by+James+E.+McWilliams&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":-1,"time":1388506122,"description":"Sugar, pork, beer, corn, cider, scrapple, and hoppin' John all became staples in the diet of colonial America. The ways Americans cultivated and prepared food and the values they attributed to it played an important role in shaping the identity of the newborn nation. In A Revolution in Eating, James E. McWilliams presents a colorful and spirited tour of culinary attitudes, tastes, and techniques throughout colonial America.\nConfronted by strange new animals, plants, and landscapes, settlers in the colonies and West Indies found new ways to produce food. Integrating their British and European tastes with the demands and bounty of the rugged American environment, early Americans developed a range of regional cuisines. From the kitchen tables of typical Puritan families to Iroquois longhouses in the backcountry and slave kitchens on southern plantations, McWilliams portrays the grand variety and inventiveness that characterized colonial cuisine. As colonial America grew, so did its palate, as interactions among European settlers, Native Americans, and African slaves created new dishes and attitudes about food. McWilliams considers how Indian corn, once thought by the colonists as &quot;fit for swine,&quot; became a fixture in the colonial diet. He also examines the ways in which African slaves influenced West Indian and American southern cuisine.\nWhile a mania for all things British was a unifying feature of eighteenth-century cuisine, the colonies discovered a national beverage in domestically brewed beer, which came to symbolize solidarity and loyalty to the patriotic cause in the Revolutionary era. The beer and alcohol industry also instigated unprecedented trade among the colonies and further integrated colonial habits and tastes. Victory in the American Revolution initiated a &quot;culinary declaration of independence,&quot; prompting the antimonarchical habits of simplicity, frugality, and frontier ruggedness to define American cuisine. McWilliams demonstrates that this was a shift not so much in new ingredients or cooking methods, as in the way Americans imbued food and cuisine with values that continue to shape American attitudes to this day","torrent":{"xt":"urn:btih:e082d148768f66f1487eace7fd7c7df53e6a8114","amp;dn":"A+Revolution+In+Eating+by+James+E.+McWilliams","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e082d148768f66f1487eace7fd7c7df53e6a8114","infoHashBuffer":{"type":"Buffer","data":[224,130,209,72,118,143,102,241,72,126,172,231,253,124,125,245,62,106,129,20]},"announce":[],"urlList":[]}}