{"title":"Craig Venter: On the verge of creating synthetic life","uid":4670683,"size":62603905,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e0c23cab469a3f1c3bfab155133399150f7520f2&amp;dn=Craig+Venter%3A+On+the+verge+of+creating+synthetic+life&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1232723399,"description":"&quot;Can we create new life out of our digital universe?&quot; Craig Venter asks. His answer is &quot;yes&quot; -- and pretty soon. He walks through his latest research and promises that we'll soon be able to build and boot up a synthetic chromosome.\n\nCraig Venter, the man who led the private effort to sequence the human genome, is hard at work now on even more potentially world-changing projects.\n\nFirst, there's his mission aboard the Sorcerer II, a 92-foot yacht, which, in 2006, finished its voyage around the globe to sample, catalouge and decode the genes of the ocean's unknown microorganisms. Quite a task, when you consider that there are tens of millions of microbes in a single drop of sea water. Then there's the J. Craig Venter Institute, a nonprofit dedicated to researching genomics and exploring its societal implications.\n\nIn 2005, Venter founded Synthetic Genomics, a private company with a provocative mission: to engineer new life forms. Its goal is to design, synthesize and assemble synthetic microorganisms that will produce alternative fuels, such as ethanol or hydrogen. He was on Time magzine's 2007 list of the 100 Most Influential People in the World.\n\nIn early 2008, scientists at the J. Craig Venter Institute announced that they had manufactured the entire genome of a bacterium by painstakingly stitching together its chemical components. By sequencing a genome, scientists can begin to custom-design bootable organisms, creating biological robots that can produce from scratch chemicals humans can use, such as biofuel.\n\n    &quot;Either he is one of this era's most electrifying scientists, or he's one of the most maddening.&quot;\n\nWashington Post\n___________________________________________________________________________________\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law) &lt;a href=&quot; http://petitions.number10.gov.uk/shariastop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://petitions.number10.gov.uk/shariastop&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it... &lt;a href=&quot; http://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog... &lt;a href=&quot; http://thephyrexian.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thephyrexian.tk&lt;/a&gt;","torrent":{"xt":"urn:btih:e0c23cab469a3f1c3bfab155133399150f7520f2","amp;dn":"Craig+Venter%3A+On+the+verge+of+creating+synthetic+life","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0c23cab469a3f1c3bfab155133399150f7520f2","infoHashBuffer":{"type":"Buffer","data":[224,194,60,171,70,154,63,28,59,250,177,85,19,51,153,21,15,117,32,242]},"announce":[],"urlList":[]}}