{"title":"Jesse Livermore - World's Greatest Stock Trader","uid":11048155,"size":1115502,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3519e1247005b8a650370028af2fa204b4311a5&amp;dn=Jesse+Livermore+-+World%27s+Greatest+Stock+Trader&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pro21","files":1,"time":1410978847,"description":"&quot;Wall Street never changes, the pockets change, the suckers change, the stocks change, but Wall Street never changes, because human nature never changes.&quot;-Jesse Livermore\n\nImmortalized in the fictionalized bestselling investment classic Reminiscences of a Stock Operator as &quot;Larry Livingstone,&quot; Jesse Livermore is considered by many to be the best trader in history. Now, for the first time, the complete true-life story of one of Wall Street's most intriguing and successful figures comes to life in Jesse Livermore: World's Greatest Stock Trader. Take a revealing and intimate look into the life, mind, and financial prowess of this legendary trader through family interviews, professional triumphs, and the revolutionary trading techniques he developed. Detailing Livermore's personal life story, author Richard Smitten vividly depicts the never-before-revealed private side of this enigmatic man, while educating you on the trading principles, timing techniques, and money management strategies that made Livermore several fortunes over his lifetime-when he adhered to them.\n\nLivermore ran away from home in 1891 at the age of fourteen, with five dollars in his pocket. He started his stock market career as a chalkboard boy in the Boston offices of PaineWebber. A year later he was trading full time. He accumulated so much money by the time he was twenty that he was banned from all the &quot;Bucket Shops&quot; of New York and Boston. With his radical trading methods and an unlimited amount of patience, Livermore cornered the cotton market and made a killing in the stock market crash of 1907, amassing more than $3 million in one day.\n\nJ. P. Morgan personally asked him to stop shorting the market. With friends like financier Bernard Baruch, Walter Chrysler, Charlie Chaplin, and Alfred Sloan of General Motors, Livermore walked among giants and learned many lessons along the way. He sold the market short in 1929 and entered the depression with $100 million in cash. Livermore eventually discovered that social status and money could not help battle depression or repair disintegrating marriages and distant relationships with his sons.\n\nIn the only extensive biography of Jesse Livermore, you will stand at the center of his fascinating universe and watch him evolve. Experience the man, myth, and legend as you trace his progress from different wives to different trading strategies, Long Island estates to Palm Beach resorts, yachts, and private railway cars. Capture, for the first time, the full story both personally and professionally of the most successful trader of all time in a nonstop story of trading, triumph, and tragedy.\n\n &lt;a href=&quot;\nhttp://bayimg.com/kaaEeAAGH&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/kaaEeAAGH&lt;/a&gt;","torrent":{"xt":"urn:btih:e3519e1247005b8a650370028af2fa204b4311a5","amp;dn":"Jesse+Livermore+-+World%27s+Greatest+Stock+Trader","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3519e1247005b8a650370028af2fa204b4311a5","infoHashBuffer":{"type":"Buffer","data":[227,81,158,18,71,0,91,138,101,3,112,2,138,242,250,32,75,67,17,165]},"announce":[],"urlList":[]}}