{"title":"Hillsong LIVE - God Is Able CD NL (2011) TBS","uid":6797017,"size":164442573,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e4b17b30163b5df2deb44a4c38dea8d241dbadf7&amp;dn=Hillsong+LIVE+-+God+Is+Able+CD+NL+%282011%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sammynet","files":21,"time":1320452069,"description":"Hillsong Church brengt op 26 juli 2011 een nieuw live-album uit met de titel \\\\\\'God is able\\\\\\'. \nDe opnames voor dit album vonden plaats in november 2010 in het \\\\\\'Sydney Entertainment Centre\\\\\\' in AustraliÃƒÂ«. \nDe aanbidding werd geleid door Reuben Morgan, Darlene Zschech, Joel Houston, Ben Fielding en andere leden van het Hillsong worship team. \nIn een toelichting schrijft Ben Fielding: \\\\\\&quot;Alle nummers op dit album vormen een samenvatting van ons jaar als kerk. \nDe songs zijn een uitdrukking van wie God is en wat Hij heeft gedaan. \nDe kerkleden zongen ze uit volle borst mee. \nIk ben ervan overtuigd dat dit album een fris geluid laat horen en de songs geven expressie aan onze aanbidding.\\\\\\&quot;\n\nHillsong With Hearts As One\n\nTrack Listing\n\n01   Rise (Joel Houston and Reuben Morgan) - Worship Leader: Joel Houston\n02   With Us (Reuben Morgan) - Worship Leader: Jad Gillies\n03   Unending Love (Jill Mccloghry and Sam Knock) - Worship Leader: Annie Garratt, b. Jad Gillies\n04   The Lost Are Found (Sam Knock &amp; Ben Fielding) - Worship Leader: Ben Fielding b. Darlene Zschech, Reuben Morgan &amp; Joel Houston\n05   God Is Able (Reuben Morgan and Ben Fielding) - Worship Leaders: Reuben Morgan b.Darlene Zschech\n06   The Difference (Reuben Morgan) - Worship Leader: Jonathan Douglass (JD)\n07   Alive In Us (Reuben Morgan) - Worship Leader: Darlene Zschech\n08   You Are More (Reuben Morgan) - Worship Leader: Darlene Zschech, b. Reuben Morgan\n09   Narrow Road (Braden Lang) - Worship Leader: Dave Ware, b. Darlene Zschech\n10   My Heart Is Overwhelmed (Reuben Morgan and Ben Fielding) - Worship Leader: Ben Fielding, b. Darlene Zschech\n11   Cry Of The Broken (Darlene Zschech &amp; Reuben Morgan) - Worship Leader: Darlene Zschech (Solo by Darlene Zschech with Piano Accompaniment)\n12   Go (Bonus Track)\n13   Awakening (Bonus Track)","torrent":{"xt":"urn:btih:e4b17b30163b5df2deb44a4c38dea8d241dbadf7","amp;dn":"Hillsong+LIVE+-+God+Is+Able+CD+NL+%282011%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4b17b30163b5df2deb44a4c38dea8d241dbadf7","infoHashBuffer":{"type":"Buffer","data":[228,177,123,48,22,59,93,242,222,180,74,76,56,222,168,210,65,219,173,247]},"announce":[],"urlList":[]}}