{"title":"Why Civil Resistance Works - Erica Chenoweth. PDF","uid":10115290,"size":7344501,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5b18f1aa46adb97edc377c2a3b464fa732107ef&amp;dn=Why+Civil+Resistance+Works+-+Erica+Chenoweth.+PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UnviolentPeacemaker","files":2,"time":1399584511,"description":"Why Civil Resistance Works: The Strategic Logic of Nonviolent Conflict (Columbia Studies in Terrorism and Irregular Warfare)\n &lt;a href=&quot;\nhttp://www.ericachenoweth.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ericachenoweth.com/&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Erica_Chenoweth&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Erica_Chenoweth&lt;/a&gt;\n\nFor more than a century, from 1900 to 2006, campaigns of nonviolent resistance were more than twice as effective as their violent counterparts in achieving their stated goals. By attracting impressive support from citizens, whose activism takes the form of protests, boycotts, civil disobedience, and other forms of nonviolent noncooperation, these efforts help separate regimes from their main sources of power and produce remarkable results, even in Iran, Burma, the Philippines, and the Palestinian Territories.\n\nCombining statistical analysis with case studies of specific countries and territories, Erica Chenoweth and Maria J. Stephan detail the factors enabling such campaigns to succeed and, sometimes, causing them to fail. They find that nonviolent resistance presents fewer obstacles to moral and physical involvement and commitment, and that higher levels of participation contribute to enhanced resilience, greater opportunities for tactical innovation and civic disruption (and therefore less incentive for a regime to maintain its status quo), and shifts in loyalty among opponents' erstwhile supporters, including members of the military establishment.\n\nChenoweth and Stephan conclude that successful nonviolent resistance ushers in more durable and internally peaceful democracies, which are less likely to regress into civil war. Presenting a rich, evidentiary argument, they originally and systematically compare violent and nonviolent outcomes in different historical periods and geographical contexts, debunking the myth that violence occurs because of structural and environmental factors and that it is necessary to achieve certain political goals. Instead, the authors discover, violent insurgency is rarely justifiable on strategic grounds.\n\n------------------\n\nEditorial Reviews\nReview\n\nThis is the first major scholarly book to make a well-supported argument that, contrary to what many people believe, nonviolent resistance is more effective than armed resistance in overthrowing regimes, an advantage that is maintained even when the target is not democratic.\n(Robert Jervis, Columbia University)\n\nErica Chenoweth and Maria J. Stephan offer a fresh, lively, and penetrating analysis of the conditions under which nonviolent resistance succeeds or fails. Using a wealth of data and in-depth case studies, they show that the scholarly emphasis on forceful approaches is misguided: nonviolent movements are often better able to mobilize supporters, resist regime crackdowns, develop innovative resistant techniques, and otherwise take on and defeat repressive regimes and build durable democracies.\n(Daniel Byman, Georgetown University and senior fellow, Saban Center at the Brookings Institution)\n\nAfter the breathtaking events of 2011, can anyone doubt that nonviolent civil resistance is an effective tool for political change? In this provocative, well-written, and compelling book, Erica Chenoweth and Maria J. Stephan demonstrate that nonviolent civil resistance is usually a better way to force political change. They identify the conditions favoring its success and provide a convincing explanation for why nonviolent resistance is so effective. Their analysis is rigorous yet accessible, and their conclusions have profound implications for anyone seeking to understand -- or promote -- far-reaching social and political reform.\n(Stephen Walt, Harvard University)\n\nThis is social science at its best. Years of critical study culminate in a book on one dominating issue: how does nonviolent opposition compare with violence in removing a regime or achieving secession? The authors study successes and failures and alternative diagnoses of success and failure, reaching a balanced judgment meriting careful study.\n(Thomas C. Schelling, Harvard University, recipient of the Nobel Prize in Economics)\n\nAll of us dedicated to peaceful protest as a way to change the world can take heart from this book.\n(Amitabh Pal Progressive)\n\nThe work belongs in all academic libraries.... Highly recommended.\n(Choice)\n\nWell researched, skillfully written, insightful, and timely.\n(Joseph G. Bock Dynamics of Asymmetric Conflict)\nAbout the Author\nErica Chenoweth is an associate professor at the Josef Korbel School of International Studies at the University of Denver and an Associate Senior Researcher at the Peace Research Institute of Oslo. Previously she taught at Wesleyan University and held fellowships at Harvard, Stanford, and the University of California at Berkeley.\nMaria J. Stephan is a strategic planner with the U.S. Department of State. Formerly she served as director of policy and research at the International Center on Nonviolent Conflict (ICNC) and as an adjunct professor at Georgetown University and American University. She has also been a fellow at the Kennedy School of Government's Belfer Center for Science and International Affairs. ","torrent":{"xt":"urn:btih:e5b18f1aa46adb97edc377c2a3b464fa732107ef","amp;dn":"Why+Civil+Resistance+Works+-+Erica+Chenoweth.+PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5b18f1aa46adb97edc377c2a3b464fa732107ef","infoHashBuffer":{"type":"Buffer","data":[229,177,143,26,164,106,219,151,237,195,119,194,163,180,100,250,115,33,7,239]},"announce":[],"urlList":[]}}