{"title":"Gulf War and Health: Updated Literature Review of Sarin [blackat","uid":8871895,"size":2195675,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5faf006ec461791560a652e6c476565d8b1f0ce&amp;dn=Gulf+War+and+Health%3A+Updated+Literature+Review+of+Sarin+%5Bblackat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackatk","files":-1,"time":1378089254,"description":"| Dedicated to those who died at the hands of a madman while the world did nothing but boast, bicker, and buck-pass.\n\n\n\nThe Gulf War in 1990-1991 was considered a brief and successful military operation, with few injuries or deaths of US troops. The war began in August 1990, and the last US ground troops returned home by June 1991. Although most Gulf War veterans resumed their normal activities, many soon began reporting a variety of nonexplained health problems that they attributed to their participation in the Gulf War, including chronic fatigue, muscle and joint pain, loss of concentration, forgetfulness, headache, and rash. Because of concerns about the veterans' health problems, the Department of Veterans Affairs (VA) requested that the Institute of Medicine (IOM) review the scientific and medical literature on the long-term adverse health effects of agents to which the Gulf War veterans may have been exposed. This report is a broad overview of the toxicology of sarin and cyclosarin. It assesses the biologic plausibility with respect to the compounds in question and health effects.\n\n\n\nPaperback: 132 pages\nPublisher: National Academies Press (October 12, 2004)\nLanguage: English\nISBN-10: 0309092949\nISBN-13: 978-0309092944\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Gulf-War-Health-Updated-Literature/dp/0309092949/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Gulf-War-Health-Updated-Literature/dp/0309092949/&lt;/a&gt;\n\n\n\n\n\nTags: Sarin, cyclosarin, VX, Tabun, Oman, Phosghene, Chlorine, Lewisite, Mustard, Germany, Syria, organo, organophosphate, bio,toxin, CNS, acetylcholine, cholinesterase, spine, cns, nerve, agent, nbc, cbrn, wmd, Assad, Russia, Novichok, Russia, United States, treaty, pralidixome, atropine, pam, autoinjecter, mopp, mopp 3, mopp4, chemwar, usamriid, bsl2, bsl3, bsl4, bsl5, chemistry, pesticide, nazi, ndsdp, ww1, ww2, disaster, management, fema, emergency, management, public, policy, planning, homeland, dhs, arms, control, proliferation, law, enforcement, united, nations, unsc, un, national, security, domestic, nuclear,chemical, biological, weapon, weaponry, assymetric, unconventional, uw, attack, gas, gassed, countervalue, strategy, strategic, deterrence, responsibility, to , protect, r2p, kurd, kurdistan, saddam, kurdish, gulf, terror,terrorism,Education,Reference,History,Military,Science,Law,Criminal Law,Forensic Science,Medical, medicine,Books,Internal Medicine,Dermatology, Law,Medicine,Health,Sciences,Clinical,Dermatology,Science,Mathematics,Environmental Studies,Social Sciences,Military Sciences,security studies, political science,domestic,national,Politics,Criminology,Professional,Technical,Engineering,Special Topics,Biological Sciences,Biology,Earth,Sciences \n","torrent":{"xt":"urn:btih:e5faf006ec461791560a652e6c476565d8b1f0ce","amp;dn":"Gulf+War+and+Health%3A+Updated+Literature+Review+of+Sarin+%5Bblackat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5faf006ec461791560a652e6c476565d8b1f0ce","infoHashBuffer":{"type":"Buffer","data":[229,250,240,6,236,70,23,145,86,10,101,46,108,71,101,101,216,177,240,206]},"announce":[],"urlList":[]}}