{"title":"The Beatles - Help! [Top of the Pops, 1965].VOB","uid":9587669,"size":76296192,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e69cce5fdf9d5c3c634418748238331c96ac3865&amp;dn=The+Beatles+-+Help%21+%5BTop+of+the+Pops%2C+1965%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SgtRlee","files":-1,"time":1391841590,"description":"The Beatles - Help! [Top of the Pops, 1965].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;Help!&quot; is a song by the Beatles that served as the title song for both the 1965 film and its soundtrack album. It was also released as a single, and was number one for three weeks in both the United States and the United Kingdom.\n\n\nThey made this other promotional clip of &quot;Help!&quot; on 23 November 1965 for inclusion in the year-end recap special of Top of the Pops. Directed by Joseph McGrath, the black-and-white clip shows the group miming to the song while sitting astride a workbench. Starr holds an umbrella overhead throughout the song, which becomes useful as fake snow falls during the final verse.\n\n\n&quot;Help!&quot; was written by John Lennon, but credited to Lennon &amp; McCartney. During an interview with Playboy in 1980, Lennon recounted: &quot;The whole Beatles thing was just beyond comprehension. I was subconsciously crying out for help&quot;.\n\nThe documentary series The Beatles Anthology revealed that Lennon wrote the lyrics of the song to express his stress after the Beatles' quick rise to success. &quot;I was fat and depressed and I was crying out for 'Help',&quot; Lennon told Playboy. Writer Ian MacDonald describes the song as the &quot;first crack in the protective shell&quot; Lennon had built around his emotions during the Beatles' rise to fame, and an important milestone in his songwriting style.\n\nIn the 1970 Rolling Stone &quot;Lennon Remembers&quot; interviews, Lennon said it was one of his favourites among the Beatles songs he wrote, but he wished they had recorded it at a slower tempo. In these interviews, Lennon said he felt that &quot;Help!&quot; and &quot;Strawberry Fields Forever&quot; were his most honest, genuine Beatles songs and not just songs &quot;written to order&quot;. According to Lennon's cousin and boyhood friend Stanley Parkes, however, &quot;Help!&quot; was written after Lennon &quot;came in from the studio one night. 'God,' he said, 'they've changed the title of the film: it's going to be called 'Help!' now. So I've had to write a new song with the title called 'Help!'.&quot;\n\nAccording to McCartney, he was called in &quot;to complete it&quot; in a two-hour joint writing session on 4 April 1965 at Lennon's house in Weybridge, claiming to have helped on the &quot;countermelody&quot;.\n\nThe Beatles were an English rock band formed in Liverpool in 1960. They became the most commercially successful and critically acclaimed act in the rock music era. The group's best-known lineup consisted of John Lennon, Paul McCartney, George Harrison, and Ringo Starr. Rooted in skiffle and 1950s rock and roll, the Beatles later utilized several genres, ranging from pop ballads to psychedelic rock, often incorporating classical and other elements in innovative ways. In the early 1960s, their enormous popularity first emerged as &quot;Beatlemania&quot;, but as their songwriting grew in sophistication, they came to be perceived by many fans and cultural observers as an embodiment of the ideals shared by the era's sociocultural revolutions. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Help!_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Help!_(song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/PAiCOAAFc&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/PAiCOAAFc&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 4000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 448kbps\n   Duration: 00:02:15\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.3\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:e69cce5fdf9d5c3c634418748238331c96ac3865","amp;dn":"The+Beatles+-+Help%21+%5BTop+of+the+Pops%2C+1965%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e69cce5fdf9d5c3c634418748238331c96ac3865","infoHashBuffer":{"type":"Buffer","data":[230,156,206,95,223,157,92,60,99,68,24,116,130,56,51,28,150,172,56,101]},"announce":[],"urlList":[]}}