{"title":"The Bible and the Dead Sea Scrolls","uid":4723415,"size":7425853,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e6a96b4e9b73a9df5aab34023d22ae576f1e5215&amp;dn=The+Bible+and+the+Dead+Sea+Scrolls&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"timnehguy","files":4,"time":1234629683,"description":"The Bible and the Dead Sea Scrolls: \nThe Princeton Symposium on the Dead Sea Scrolls \nEditor: James H. Charlesworth\n\nPrinceton Symposium on Judaism And Christian Origins 1997 Princeton\n\nPublisher: Baylor University Press (2006)\nLanguage: English\n3 volume set | Pages: 1598 (one volume/PDF edition)\n\nThe recovery of 800 documents in the eleven caves on the northwest shores of the Dead Sea is one of the most sensational archeological discoveries in the Holy Land to date. These three volumes, the very best of critical scholarship, demonstrate in detail how the scrolls have revolutionized our knowledge of the text of the Bible, the character of Second Temple Judaism, and the Jewish beginnings of Christianity.\n\nJames H. Charlesworth has assembled a stellar gathering of Dead Sea Scrolls scholars in these rich volumes. They will make a lasting and profoundly significant contribution to the understanding of the greatest archeological find of modern times and the light it throws on the Bible. --Michael E. Stone, Gail Levin de Nur Professor of Comparative Religion, Professor of Armenian Studies, The Hebrew University of Jerusalem\n\nThe three volume edition Bible and the Dead Sea Scrolls will become a milestone for Old and New Testament research. The authors are leading scholars in this field and no other publication has collected so many interesting contributions about the largest finding of biblical and Jewish texts in the last century. --Martin Hengel, University of Tubingen\n\nThese three volumes containing fresh and updated research on the Dead Sea Scrolls, the Bible, the Qumran community, and early Christianity, written by renown scholars from the U.S., Canada, Europe, and Israel, and edited by one of the world's leading scholars, promise to be a major and definitive contribution to scholarship. --Adolfo Roitman, Curator of the Dead Sea Scrolls and Head of the Shrine of the Book, The Israel Museum, Jerusalem \n\nCheck my torrents for more reference works on a variety of spiritual traditions.","torrent":{"xt":"urn:btih:e6a96b4e9b73a9df5aab34023d22ae576f1e5215","amp;dn":"The+Bible+and+the+Dead+Sea+Scrolls","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6a96b4e9b73a9df5aab34023d22ae576f1e5215","infoHashBuffer":{"type":"Buffer","data":[230,169,107,78,155,115,169,223,90,171,52,2,61,34,174,87,111,30,82,21]},"announce":[],"urlList":[]}}