{"title":"Raisin Pie (Restored)","uid":7640788,"size":170142038,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e6bafcc00e59ffe26ab349a4e0eeb19dec0dd4f6&amp;dn=Raisin+Pie+%28Restored%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1347774673,"description":"Issues 1-5 of 'Raisin Pie'\n\nFantagraphics Books, 2002-2007\n\nWritten and Illustrated by Rick Altergott and Ariel Bordeaux \n\n\nRick Altergott is a professional illustrator and cartoonist, residing in Pawtucket, Rhode Island, with his wife, fellow cartoonist Ariel Bordeaux. Their collaborative comic book Raisin Pie is published by Fantagraphics.\n\nAltergott is best known for Doofus, a long-running series published by Fantagraphics, notorious for its low-brow, scatological humor. Doofus chronicles the misadventures of two small-town weirdos, Doofus and Henry Hotchkiss.\n\nAltergott's first published work was in the early 1980s, but he didn't really settle into the comics world until late in the decade, when he contributed regularly to the humor magazine Cracked. Throughout the 1990s Altergott published the small-press comic Douche Bag Dougan (the titular hero of which later made an appearance in Fantagraphics' Zero Zero anthology.) Altergott's work has also appeared in Duplex Planet Illustrated and Hate (both published by Fantagraphics), where he was repeatedly promoted by Peter Bagge.\n\nIn September 2006, Altergott released a serious biblical mini-comic based on the life of Saint Matthias. In 2008, Altergott and Bordeaux contributed to the anthology Kramers Ergot 7.\n\nAltergott is good friends with cartoonist Daniel Clowes, and lived in Chicago for a period when Clowes also lived there. Due to the similarities in their drawing styles, some observers have suggested that Altergott is a pseudonym for Clowes, allowing Clowes to draw in a different, Wally Wood-inspired style. This is untrue.\n\nAltergott is also friends with Jaime Hernandez.","torrent":{"xt":"urn:btih:e6bafcc00e59ffe26ab349a4e0eeb19dec0dd4f6","amp;dn":"Raisin+Pie+%28Restored%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6bafcc00e59ffe26ab349a4e0eeb19dec0dd4f6","infoHashBuffer":{"type":"Buffer","data":[230,186,252,192,14,89,255,226,106,179,73,164,224,238,177,157,236,13,212,246]},"announce":[],"urlList":[]}}