{"title":"Mega.Mansions.Series.1.3of6.Oheka.Castle.720p.HDTV.x264.AAC.MVGr","uid":11931351,"size":490109377,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:e77b5a732c07d4a370098fc0f04efd2092cbd2b9&amp;dn=Mega.Mansions.Series.1.3of6.Oheka.Castle.720p.HDTV.x264.AAC.MVGr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"artistharry","files":1,"time":1431808874,"description":"Mega Mansions: Series 1\n\nTravel Documentary hosted by John Beach, published by Travel Channel UK in 2015 - English narration\n   &lt;a href=&quot;\nhttp://docuwiki.net/images/2/28/Mega-Mansions-Series-1-Cover.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/images/2/28/Mega-Mansions-Series-1-Cover.jpg&lt;/a&gt;\n\nInformation\n------------------------------\n\nMega Mansions: Series 1\nMega Mansions is a high-energy exclusive trip inside America's most exclusive and supersized mansions. We're traveling coast-to-coast with a VIP pass to the estates most visitors never get to see. In each 30-minute episode, we go beyond the gates for a double dose of luxury as we explore two amazing mansions. We'll meet the owners, and talk to designers and architects to get the inside scoop on what makes these mansions truly one-of-a-kind. Series offers a tour inside America's mansions from hidden vaults in the Hearst Castle, to the private Bachelor's Wing at the Biltmore Estate, to a state-of-the-art San Francisco palace where the lights, music and climate are controlled by a smart phone.\n\n\n1)  Hearst Castle and Villa Belvedere \nSee the historical 70,000-square-foot Hearst Castle in San Simeon, CA, with a never-before-seen tour of the basement vaults. Then, tour a state-of-the-art waterfront estate in San Francisco, with epic views of the city and bay.\n\n2)  Vizcaya and Bradbury Estate \nFirst stop - the 8-acre, $78 million-dollar Bradbury Estate in the most expensive zip code in America, Bradbury, CA. Then it's off to Vizcaya Museum and Garden, a fantasy dream home turned popular Miami tourist attraction. Travel from one coast to the other to get an all access pass inside two gigantic properties, the Bradbury Estate and Vizcaya Museum and Gardens. In the affluent hills of Southern California, the Bradbury Estate is worth an estimated $78.8 million dollars, encompasses 8 acres, and the main house totals 30,000 square. The stand out features include the Olympic sized pool, million gallon trout pond, and underground firing range. From the West coast to the sizzling Florida coast, sit a prestigious waterfront villa in Miami Beach. With its priceless imported European antiques and the most impressive gardens in America, it's no wonder that Vizcaya is one of Miami's most popular attractions. Both estates were custom designed to meet the extravagant tastes of its owners, which just so happen to be one of America's most impressive properties too.\n\n3)  Oheka Castle and Mansion on O Street \nVisit the second largest private home in the United States - Oheka Castle in Long Island, New York. Then, it's off to DC to tour the Mansion on O Street -- a $50 million dollar maze disguised as 5 town homes on a city street.\n\n4)  Biltmore Estate and Star Island \nThe Biltmore Estate in Asheville, NC, is the largest private home in America. Then, travel south with us to Miami's most celebrated bachelor pad -- a $65 million dollar playpen on the exclusive Star Island.\n\n5)  Mansion at MGM Grand and Old Westbury Gardens \nTour the opulent Mansion at the MGM Grand in Las Vegas where your wish is their command. Then, it's off to Westbury, NY, for the original &quot;mega mansion&quot; at Old Westbury Gardens - a fortress built for a steel king.\n\n6)  The Jones Manor and Cravens Estate \nFirst stop - a 28,000 sq. ft. tech geek's fantasy home outfitted with state of the art gadgets, The Jones Manor in Indianapolis. Then it's off to Pasadena to the lavish Cravens Estate adorned with century-old European pieces. 'Mega Mansions' is off to Indianapolis, Indiana to tour the home of genius inventor Scott Jones. This 28,000 square foot home is outfitted with some awesome technology and the whole house has a really fun feel; it truly is the home of the computer whiz kid who struck it rich. Scott Jones shows off his digitally controlled wine vault, the retina scanner that act as lock and key, as well as some pricy antique technology artifacts that he collects. Then 'Mega Mansions' hits the West Coast to check out the Cravens Estate in Pasadena California. The Cravens Estate was built in the early 1900's for around $10 Million (adjusted for inflation) dollars. They had a stash spot in the dining room for booze (because this was during prohibition) and an intricate, imported staircase and skylight that would be the envy of any multi-millionaire, then and now. And you might recognize The Cravens Estate from the movies too.\n\n\n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;5c14353b341c1068726d&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 3181 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280 x 720\n * Audio Codec: AAC LC\n * Audio English\n * Audio Bitrate: 160 kb/sVBR 48 KHz\n * Audio Channels: Stereo 2\n * Run-Time: 22mins\n * Framerate: 25 fps\n * Number of Parts: 6\n * Container Mp4\n * Part Size: 472 MB\n * Source: HDTV\n * Encoded by: Harry65","torrent":{"xt":"urn:btih:e77b5a732c07d4a370098fc0f04efd2092cbd2b9","amp;dn":"Mega.Mansions.Series.1.3of6.Oheka.Castle.720p.HDTV.x264.AAC.MVGr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e77b5a732c07d4a370098fc0f04efd2092cbd2b9","infoHashBuffer":{"type":"Buffer","data":[231,123,90,115,44,7,212,163,112,9,143,192,240,78,253,32,146,203,210,185]},"announce":[],"urlList":[]}}