{"title":"Billy Joel - Just The Way You Are (Beat Club) (2nafish)","uid":5639128,"size":160366596,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e9152dfb6e3797ed66d487ef16a6a91cf1c92a61&amp;dn=Billy+Joel+-+Just+The+Way+You+Are+%28Beat+Club%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1277020598,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Just the Way You Are&quot; is a love song from Billy Joel's 1977 pop rock album, The Stranger. It was written as a birthday gift to Joel's first wife Elizabeth Weber. After they divorced, Joel said that when performing the song, he would imagine what he would eat for dinner or what he would do after the show, or even accidentally sing alternate lyrics written by Liberty DeVitto (&quot;She took the dog, the house, the car&quot;). This was his first US Top 10 (reaching #3) and UK Top 20 single, and it was also Joel's first Gold single in the US. &quot;Just the Way You Are&quot; won the 1978 Grammy Awards for Record of the Year and Song of the Year.\n\nJoel has gone on record stating that he personally dislikes the song and was originally going to leave it off the album. However, at the request of both Linda Ronstadt and Phoebe Snow (both were recording in other studios in the same building at the time), Joel and Ramone agreed to leave it on the album. Joel does not perform &quot;Just the Way You Are&quot; regularly; however, it is performed as a duet with Elton John in their Face-to-Face Tour.\n\nThe Stranger is the fifth studio album by musician Billy Joel, released in 1977. While his four previous albums had been moderate chart successes, this was his breakthrough album, spending six weeks at #2 in the U.S. album charts. It remains Joel's best-selling non-compilation album to date.\n\nThe Stranger contained nine songs, many of which are now considered &quot;classic Joel.&quot; &quot;Movin' Out,&quot; &quot;She's Always a Woman,&quot; &quot;Just The Way You Are,&quot; &quot;Scenes From an Italian Restaurant,&quot; &quot;Everybody Has A Dream,&quot; and &quot;Only The Good Die Young&quot; were all written prior to recording, while &quot;Vienna,&quot; &quot;The Stranger,&quot; and &quot;Get It Right The First Time&quot; all came from short tunes or fragments of songs that Joel finished in the studio. Each song had stories attached to it. The seven-and-a-half-minute epic &quot;Scenes From an Italian Restaurant&quot; began as the shorter &quot;Ballad of Brenda and Eddie,&quot; a section that now forms the third part of the song. Joel came up with the signature whistle line which he whistled to producer Phil Ramone, claiming that he needed to find an instrument to play it. Ramone replied: &quot;No, you don't. That's 'The Stranger,' the whistling.&quot; The aforementioned whistling at the opening and closing of Joel's &quot;The Stranger&quot; was, consciously or unconsciously, inspired by the Alessandro Alessandroni's (Italian composer of film scores) tune of the same name.\n\nFour singles from the LP charted on the Billboard Hot 100: &quot;Just The Way You Are,&quot; (#3), &quot;Movin' Out&quot; (#17), &quot;She's Always a Woman,&quot; (#17), and &quot;Only The Good Die Young&quot; (#24).\n\nMuch of the album's success is attributed to Joel's collaboration with producer Phil Ramone, whose innovative production methods complemented Joel's songs. This fruitful collaboration would continue for a decade. Singles released from the album include &quot;Just the Way You Are&quot; (which won the Grammy for Record of the Year), the acoustic ballad &quot;She's Always A Woman,&quot; the mildly controversial &quot;Only the Good Die Young,&quot; and &quot;Movin' Out (Anthony's Song),&quot; which later lent its title to Movin' Out, an acclaimed hit Broadway musical based on Billy Joel's songs. This album overtook Simon and Garfunkel's Bridge Over Troubled Water album to become the best-selling album on the Columbia Records imprint at the time. Generally regarded as Joel's finest work, in 2003, the album was ranked number 67 on Rolling Stone magazine's list of the 500 greatest albums of all time.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:e9152dfb6e3797ed66d487ef16a6a91cf1c92a61","amp;dn":"Billy+Joel+-+Just+The+Way+You+Are+%28Beat+Club%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9152dfb6e3797ed66d487ef16a6a91cf1c92a61","infoHashBuffer":{"type":"Buffer","data":[233,21,45,251,110,55,151,237,102,212,135,239,22,166,169,28,241,201,42,97]},"announce":[],"urlList":[]}}