{"title":"Science and Islam (BBC 2009)","uid":4930781,"size":2044661760,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e94ab1e349a088890ec318f4bb1dae9c46addbff&amp;dn=Science+and+Islam+%28BBC+2009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DeltaPan","files":3,"time":1244034993,"description":"All 3 episodes of Science and Islam.\n\n\nEpisode 1 - The Language of Science\n\nPhysicist Jim Al-Khalili travels through Syria, Iran, Tunisia and Spain to tell the story of the great leap in scientific knowledge that took place in the Islamic world between the 8th and 14th centuries.\n\nIts legacy is tangible, with terms like algebra, algorithm and alkali all being Arabic in origin and at the very heart of modern science - there would be no modern mathematics or physics without algebra, no computers without algorithms and no chemistry without alkalis.\n\nFor Baghdad-born Al-Khalili this is also a personal journey and on his travels he uncovers a diverse and outward-looking culture, fascinated by learning and obsessed with science. From the great mathematician Al-Khwarizmi, who did much to establish the mathematical tradition we now know as algebra, to Ibn Sina, a pioneer of early medicine whose Canon of Medicine was still in use as recently as the 19th century, he pieces together a remarkable story of the often-overlooked achievements of the early medieval Islamic scientists.\n\n\nEpisode 2 - The Empire of Reason\n\nPhysicist Jim Al-Khalili travels through Syria, Iran, Tunisia and Spain to tell the story of the great leap in scientific knowledge that took place in the Islamic world between the 8th and 14th centuries.\n\nIn this episode, Al-Khalili travels to northern Syria to discover how, a thousand years ago, the great astronomer and mathematician Al-Biruni estimated the size of the earth to within a few hundred miles of the correct figure.\n\nHe discovers how medieval Islamic scholars helped turn the magical and occult practice of alchemy into modern chemistry.\n\nIn Cairo, he tells the story of the extraordinary physicist Ibn al-Haytham, who helped establish the modern science of optics and proved one of the most fundamental principles in physics - that light travels in straight lines.\n\nProfessor Al-Khalili argues that these scholars are among the first people to insist that all scientific theories are backed up by careful experimental observation, bringing a rigour to science that didn't really exist before.\n\n\nEpisode 3 - The Power of Doubt\n\nPhysicist Jim Al-Khalili tells the story of the great leap in scientific knowledge that took place in the Islamic world between the 8th and 14th centuries.\n\nAl-Khalili turns detective, hunting for clues that show how the scientific revolution that took place in the 16th and 17th centuries in Europe had its roots in the earlier world of medieval Islam. He travels across Iran, Syria and Egypt to discover the huge astronomical advances made by Islamic scholars through their obsession with accurate measurement and coherent and rigorous mathematics.\n\nHe then visits Italy to see how those Islamic ideas permeated into the West and ultimately helped shape the works of the great European astronomer Copernicus, and investigates why science in the Islamic world appeared to go into decline after the 16th and 17th centuries, only for it to re-emerge in the present day.\n\nAl-Khalili ends his journey in the Royan Institute in the Iranian capital Tehran, looking at how science is now regarded in the Islamic world.","torrent":{"xt":"urn:btih:e94ab1e349a088890ec318f4bb1dae9c46addbff","amp;dn":"Science+and+Islam+%28BBC+2009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e94ab1e349a088890ec318f4bb1dae9c46addbff","infoHashBuffer":{"type":"Buffer","data":[233,74,177,227,73,160,136,137,14,195,24,244,187,29,174,156,70,173,219,255]},"announce":[],"urlList":[]}}