{"title":"Dastak (1970) MHce DVD5 - No Subs - Rehana Sultan, Sanjeev Kumar","uid":10842073,"size":4658218248,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e9c32602663bc8ce5fa23d5f9164385603f7bc23&amp;dn=Dastak+%281970%29+MHce+DVD5+-+No+Subs+-+Rehana+Sultan%2C+Sanjeev+Kumar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1408744959,"description":"Dastak (1970) MHCe DVD5 - No Subs - Rehana Sultan, Sanjeev Kumar [DDR]\n\nDastak (The Knock) is a classic Hindi film made in 1970, it was written and directed by Rajinder Singh Bedi, and was his directorial debut.\nThe film is still known for its award-winning performances by its leading cast, Sanjeev Kumar, and the newcomer, Rehana Sultan, and for its memorable songs by Madan Mohan, he won his first National Film Award for it, and the lyrics of Majrooh Sultanpuri. Hrishikesh Mukherjee, the famous film director turned editor of this black-and-white film, and won a Filmfare Award, his second after Madhumati in 1958. \n\nCAST:- Sanjeev Kumar, Rehana Sultan, Shakeela Bano Bhopali, Anwar Hussain, Manmohan Krishna, Niranjan Sharma, Kamal Kapoor, Dev Kishan, Johnny Whisky, Anju Mahendru\n\nProducer - Director: Rajinder Singh Bedi\nMusic Director: Madan Mohan\t\nLyricists: Majrooh Sultanpuri\t\n\nSongs are included in MP3s\nDastak (1970) 00. Title Music and Screen Credits, Madan Mohan \nDastak (1970) 01. Baiyan Naa Dharo O Balma , Lata Mangeshkar, Majrooh Sultanpuri, Madan Mohan\nDastak (1970) 02. Na Thadapu Ne Ki\nDastak (1970) 03. Maayi Re Main Kaase Kahoon, Lata, Majrooh Sultanpuri, Madan Mohan\nDastak (1970) 04. Tumse Kahoon Ek Baat, Mohammed Rafi, Majrooh Sultanpuri, Madan Mohan\nDastak (1970) 05. Hum Hain Mata-E-Koocha-O-Bazar Ki Tarah, Lata, Majrooh Sultanpuri, Madan Mohan\nDastak (1970) 06. All SOngs\n\n     FILM AWARDS\n    1971 National Film Award for Best Actor - Sanjeev Kumar\n    1971 National Film Award for Best Actress - Rehana Sultan\n    1971 National Film Award for Best Music Direction - Madan Mohan,\n    1972 Filmfare Best Cinematographer Award -(B&amp;W) - Kamal Bose\n    1970 - National Film Awards - Best Music Direction (Songs) - Madan Mohan \n\n    Madan Mohan won his only National Award for his music for this film.\n    Madan Mohan did not take any fee for his work in this film because of his regard for the film's heroine Rehana Sultan.\n    Madan Mohan felt that the National Award he received for this film came very late in his career and was initially planning to not go to Delhi to accept the award. Sanjeev Kumar, who won the National Award for Best     Actor that year, finally convinced him to accept the award. In fact, the two of them had the same kind of tuxedo tailored for the award function!\n\n    SONGS \n    Mai Ri Main Kaase Kahoon (Male) - This song was not intended for commercial release. Madan Mohan had recorded this version in his own voice as a dummy track for Lata Mangeshkar to record later in her voice.\n    \nMUSIC NOTES:-\nIt was the time when the nation was gripped by the western rhythms prevalent in the music of music directors like R.D. Burman, but films music director stood his ground as a maestro of classical rhythms on the dholak and raga based melodies. The music of Dastak stood out for its allegiance to the classical traditions of raga based melodies given by its music director Madan Mohan, who managed to get from Lata Mangeshkar, ostensibly her best performance as a playback singer.\nLyrics\n\nThe film is known for its poignant lyrics by famous lyricist of his times, Majrooh Sultanpuri, especially in capturing the painful state of the story's female protagonist, Salma.\nBe it a dramatic statement about the society: &quot;Hum hai mataye koocha bazaar ki tarah, Uthti hai har nigaah kharidaar ki tarah..&quot;.\nOr a silent pain of: &quot;Mai Ri mai ka se Kahoon pe apne jiya ki...&quot; \n\nPRODUCTION NOTES:-\nThe film presents an expanded version of his radio play, Naql-e-Makaani (Moving to a New House), first performed on All India Radio, Lahore in 1944. \n\nUpon its released the film established Rajinder Singh Bedi as an important force in Indian Parallel Cinema, as Dastak is still considered an important film of the decade.  Subsequently in 1972 film's director Rajinder Singh Bedi was awarded the Padma Shri.\n\nTalking about the film, noted director, Hrishikesh Mukjherjee once said, &quot;Rajinder Singh Bedi was an extraordinarily gifted writer. Indeed, I feel privileged that I could edit his maiden venture as writer-director 'Dastak' in stark B&amp;W starring Sanjeev Kumar and Rehana Sultan. Rehana won the 'Urvashi' award then the term for the National Award for Best Actress and I won the coveted Filmfare award for my first love-editing!&quot; \nSynopsis\n\nThe film was known for its unusual story line set in a red light area, where a newly-wed couple Hamid (Sanjeev Kumar) and Salma (Rehana Sultan) unwittingly rent a flat, and thus begins their daily turmoil at the knocks (Dastak) on their door, as the previous occupant of their home was Shamshad Begum (Shakeela), a famous mujrewali (nautch girl).\n\nTells the story of newly weds Hamid and Salma. They move into a rental flat next door to the local red light district. The flat had been the former home of a well known mujra and qawali singer, Shamshad. Men still come to the door in the hope of seeing Shamshad and do not seem too put out by seeing Salma despite her protestations. The couple struggle to live within the bounds of their own moral code while the earnings of prostitution seem to be flaunted around them. Hamid gets more and more angry and seemingly unable to reconcile his morality with the immorality of the world and at one point beats his wife and then rapes her making her into a 'whore' of his fantasy. The story here bears resemblance to the later 'Ek Chadar Maili Si' by the same director and seems to explore the complex world of women and sexuality as viewed by Indian men: mother, goddess, whore. This film also explores the ethos of prostitution in its reality and as a metaphor for the outside world. \n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4514 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 448kb/s CBR 48000 Hz\nAudio Streams: 6\nAudio Languages: Hindi\nRunTime: 2:03:38\nSubtitles: NONE\nRipped by: Trinidad [DDR]   \nDuration: 2:03:38","torrent":{"xt":"urn:btih:e9c32602663bc8ce5fa23d5f9164385603f7bc23","amp;dn":"Dastak+%281970%29+MHce+DVD5+-+No+Subs+-+Rehana+Sultan%2C+Sanjeev+Kumar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9c32602663bc8ce5fa23d5f9164385603f7bc23","infoHashBuffer":{"type":"Buffer","data":[233,195,38,2,102,59,200,206,95,162,61,95,145,100,56,86,3,247,188,35]},"announce":[],"urlList":[]}}