{"title":"El Corsario De Hierro [Comic][CBR]","uid":6699989,"size":789038933,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e9c619487f803791ba69d2d312504b1c01401588&amp;dn=El+Corsario+De+Hierro+%5BComic%5D%5BCBR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"furtaperas","files":-1,"time":1316936080,"description":"l Corsario de Hierro es una serie de historietas de aventuras creada por VÃƒÂ­ctor Mora (guiÃƒÂ³n) y AmbrÃƒÂ³s (dibujo), que empezÃƒÂ³ a publicarse en 1970\nen el semanario de humor Mortadelo (Editorial Bruguera). La obra tiene numerosas afinidades con otros famosos cÃƒÂ³mics de aventuras creados con\nanterioridad por VÃƒÂ­ctor Mora, como El CapitÃƒÂ¡n Trueno o El Jabato, pero, a diferencia de ÃƒÂ©stos, pertenece al gÃƒÂ©nero de piratas.\n\n\n\nArgumento\n\n\nVÃƒÂ­ctor Mora afirma haber sitÃƒÂºado esta historieta en el siglo XVII, despuÃƒÂ©s del Gran incendio de Londres, pero la trama abunda en anacronismos\ny sucesos inverosÃƒÂ­miles.\n\nEl protagonista asiste en su infancia al asesinato de su padre por Lord Benburry. Es adoptado por La Vieja Dama del Mar y se convierte en pirata,\ndedicÃƒÂ¡ndose a atacar preferentemente los barcos de Lord Benburry, ennoblecido ya por Carlos II de Inglaterra gracias a las riquezas adquiridas en\nsu innoble labor. Antiguo pirata &quot;Mano Azul&quot;, no se llega a explicar jamÃƒÂ¡s por que su mano deja de ser Azul en su vejez. Padece gota crÃƒÂ³nica,\nes uno de los nobles favoritos de la corte, y aunque ha abandonado la piraterÃƒÂ­a sigue invirtiendo en todo tipo de actividades legales, pero inmorales\ncomo el trÃƒÂ¡fico de esclavos, la explotaciÃƒÂ³n de niÃƒÂ±os, o la colonizaciÃƒÂ³n de America del Norte.\n\nDurante una estancia en la cÃƒÂ¡rcel el Corsario conoce a los dos personajes que le darÃƒÂ¡n en adelante el adecuado contrapunto cÃƒÂ³mico: el gigantesco\nescocÃƒÂ©s Mac Meck y el extravagante mago italiano Merlini (que no dejan de recordar a los Goliath y CrispÃƒÂ­n de El CapitÃƒÂ¡n Trueno o, mÃƒÂ¡s aÃƒÂºn, a los Taurus\ny Fideo de Mileto de El Jabato). Mac Meck es un bonachÃƒÂ³n pastor escocÃƒÂ©s con una fuerza descomunal que entra en cÃƒÂ³lera cuando le ridiculizan por su &quot;Kilt&quot;\nmientras que Merlini es un esmirriado prestidigitador aficionado que siempre se mete en lÃƒÂ­os debido a sus fracasados &quot;giocos di mani&quot;; en realidad aspira\na convertirse en alquimista de prestigio y sueÃƒÂ±a con dirigir una empresa de espectÃƒÂ¡culos. Merlini es el gran personaje cÃƒÂ³mico de la serie, mÃƒÂ¡s rica\nen humor que las anteriores de VÃƒÂ­ctor Mora.\n\nOtros personajes de la serie son los siguientes:\n\n* Lady Roxana, sobrina de Lord Benburry, enamorada -Ã‚Â¿cÃƒÂ³mo no?- del Corsario.\n* Princesa Bianca Di Orsini: Dama veneciana, amiga del Corsario, tambiÃƒÂ©n enamorada de este.\n* Giancarlo:TÃƒÂ­o alquimista de la Princesa Bianca Di Orsini autor de numerosos inventos y admirado por el inefable Merlini.\n* Diamba y Tamak, esclavos liberados por el Corsario.\n* Capitana Dagas: rival del Corsario que termina por convertirse en su aliada.\n* Des Brieux: lugarteniente de la Capitana Dagas y platÃƒÂ³nicamente enamorado de ella.\n* ColibrÃƒÂ­: mujer india que estÃƒÂ¡ a punto de casarse con el Corsario.\n* Foxie: Jefe de la guardia de Lord Bemburry\n* Lord Archibald: Hermano de lord Bemburry al que ÃƒÂ©ste trata de arrancarle sus riquezas.\n* Sinau de Esmirna: Mago hechicero enemigo del corsario.\n* Hassan el Eunuco\n* El boyardo Tamaroff\n* Turjan Pacha\n* El condottiere Negro","torrent":{"xt":"urn:btih:e9c619487f803791ba69d2d312504b1c01401588","amp;dn":"El+Corsario+De+Hierro+%5BComic%5D%5BCBR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9c619487f803791ba69d2d312504b1c01401588","infoHashBuffer":{"type":"Buffer","data":[233,198,25,72,127,128,55,145,186,105,210,211,18,80,75,28,1,64,21,136]},"announce":[],"urlList":[]}}