{"title":"Tears For Fears - The Hurting [UK Bonus Tracks] @192Kbs","uid":3298008,"size":96050829,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e9e3c7e3b32ff76495e33678df8630f2885ff948&amp;dn=Tears+For+Fears+-+The+Hurting+%5BUK+Bonus+Tracks%5D+%40192Kbs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KingStar","files":16,"time":1109956438,"description":"The Hurting would have been a daring debut for a pop-oriented band in any era, but it was an unexpected success in England in 1983, mostly by virtue of its makers' ability to package an unpleasant subject -- the psychologically wretched family histories of Roland Orzabal and Curt Smith -- in an attractive and sellable musical format. Not that there weren't a few predecessors, most obviously John Lennon's Plastic Ono Band album (which was also, not coincidentally, inspired by the work of primal scream pioneer Arthur Janov); but Lennon had the advantage of being an ex-Beatle when that meant the equivalent to having a box next to God's in the great arena of life, where Tears for Fears were just starting out. More than two decades later, &quot;Pale Shelter,&quot; &quot;Ideas as Opiates,&quot; &quot;Memories Fade,&quot; &quot;Suffer the Children,&quot; &quot;Watch Me Bleed,&quot; &quot;Change,&quot; and &quot;Start of the Breakdown&quot; are powerful pieces of music, beautifully executed in an almost minimalist style. &quot;Memories Fade&quot; offers emotional resonances reminiscent of &quot;Working Class Hero,&quot; while &quot;Pale Shelter&quot; functions on a wholly different level, an exquisite sonic painting sweeping the listener up in layers of pulsing synthesizers, acoustic guitar arpeggios, and sheets of electronic sound (and anticipating the sonic texture, if not the precise sound of their international breakthrough pop hit &quot;Everybody Wants to Rule the World&quot;). The work is sometimes uncomfortably personal for this listener, but musically compelling enough to bring him back across the decades. The Hurting was remastered and reissued in an expanded version in 1999.","torrent":{"xt":"urn:btih:e9e3c7e3b32ff76495e33678df8630f2885ff948","amp;dn":"Tears+For+Fears+-+The+Hurting+%5BUK+Bonus+Tracks%5D+%40192Kbs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9e3c7e3b32ff76495e33678df8630f2885ff948","infoHashBuffer":{"type":"Buffer","data":[233,227,199,227,179,47,247,100,149,227,54,120,223,134,48,242,136,95,249,72]},"announce":[],"urlList":[]}}