{"title":"Fired Up - Jayne Ann Krentz.epub","uid":8887768,"size":347079,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9e6cf62a2a3831db6fa07fbb378d41a1e8fabad&amp;dn=Fired+Up+-+Jayne+Ann+Krentz.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1378502425,"description":"More than three centuries ago, Nicholas Winters irrevocably altered his genetic makeup in an obsessionfueled competition with alchemist and Arcane Society founder Sylvester Jones. Driven to control their psychic abilities, each man's decision has reverberated throughout the family line, rewarding some with powers beyond their wildest dreams, and cursing others to a life filled with madness and hallucinations.\n\nJack Winters, descendant of Nicholas, has been experiencing nightmares and blackouts - just the beginning, he believes - of the manifestation of the Winters family curse. The legend says that he must find the Burning Lamp or risk turning into a monster. But he can't do it alone; he needs the help of a woman with the gift to read the lamp's dreamlight.\n\nJack is convinced that private investigator Chloe Harper is that woman. Her talents for finding objects and accessing dream energy are what will save him, but their sudden and powerful sexual pull threatens to overwhelm them both. Danger surrounds them, and it doesn't take long for Chloe to pick up the trail of the missing lamp. And as they draw closer to the lamp, the raw power that dwells within it threatens to sweep them into a hurricane of psychic force.\n\nGenre: Fiction, Paranormal Romance","torrent":{"xt":"urn:btih:e9e6cf62a2a3831db6fa07fbb378d41a1e8fabad","amp;dn":"Fired+Up+-+Jayne+Ann+Krentz.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9e6cf62a2a3831db6fa07fbb378d41a1e8fabad","infoHashBuffer":{"type":"Buffer","data":[233,230,207,98,162,163,131,29,182,250,7,251,179,120,212,26,30,143,171,173]},"announce":[],"urlList":[]}}