{"title":"BIRTH.OF.THE.BEATLES.avi","uid":7128023,"size":877162778,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ea170f372d4188b45e9261aa9ce39ecca6033486&amp;dn=BIRTH.OF.THE.BEATLES.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"stag65","files":1,"time":1332596844,"description":"A slightly inaccurate picture about the early days of the fab four, or five as they started out.\nSome events are transposed in time or fictionalised to make a better movie.\nAs a side note all the Beatles tried to have the film banned.\n\nBritish director Richard Marquand graduated from BBC documentaries to dramatized features with 1979's Birth of the Beatles. This chronicle of the Fab Four begins when the group consisted of five musicians: John Lennon (Stephen MacKenna), Paul McCartney (Rod Culbertson), George Harrison (John Altman), Stu Sutcliffe (David Wilkinson), and Pete Best (Ryan Michael). The group begins its career in the dregs of a Hamburg, Germany nightclub (most of the film was made on location). Under the tutelage of manager Brian Epstein (Brian Jameson), the group sheds its rough-hewn image in favor of choirboy haircuts and Eton collars; along the way, Sutcliffe dies and drummer Best is replaced by Richard Starkey, (aka Ringo Starr, played here by Ray Ashcroft). First aired in the U.S. on November 23, 1979, Birth of the Beatles is significant as the only Beatle biopic made while John Lennon was still alive","torrent":{"xt":"urn:btih:ea170f372d4188b45e9261aa9ce39ecca6033486","amp;dn":"BIRTH.OF.THE.BEATLES.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea170f372d4188b45e9261aa9ce39ecca6033486","infoHashBuffer":{"type":"Buffer","data":[234,23,15,55,45,65,136,180,94,146,97,170,156,227,158,204,166,3,52,134]},"announce":[],"urlList":[]}}