{"title":"The amazing Spider-Man (2012), [XviD - Ita - Mp3]TNT Village","uid":13018581,"size":1015889920,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ea5f7f0624655b004d4e442af31ce2623fbd9ddd&amp;dn=The+amazing+Spider-Man+%282012%29%2C+%5BXviD+-+Ita+-+Mp3%5DTNT+Village&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"markus899","files":1,"time":1450317191,"description":"The amazing Spider-Man (2012), [XviD - Ita - Mp3]TNT Village\r\n\r\n.: Release Originale :.\r\n \nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=358012\r\n\r\n.: Trama :.\r\n\r\n\r\nDopo un tentativo di furto nella casa dei genitori, il piccolo Peter Parker, di quattro anni, viene affidato agli zii paterni, Ben e May Parker. Rimasto orfano a causa di un misterioso incidente occorso ai suoi genitori, Peter cresce a casa degli zii. Tredici anni dopo è un ragazzo con una forte passione per la scienza e la tecnologia, e frequenta la Midtown Science High School. Le sue giornate non sono sempre limpide: gli sporadici dispetti dei bulli, Flash Thompson in primis, e l'assenza di veri amici hanno formato in lui quella vena di cinismo e sarcasmo che caratterizzeranno anche la sua eroica controparte. Fra gli studenti della scuola spicca Gwen Stacy, figlia del capo della polizia George Stacy, la quale nutre un amore per la scienza paragonabile al ragazzo e mostra un certo feeling verso quest'ultimo fin da quando ha modo di conoscerlo.\r\n\r\nUn giorno, fra i vecchi oggetti impolverati della cantina, Peter ritrova fortuitamente una valigetta appartenuta a suo padre, scienziato e uomo alquanto misterioso, avendo finalmente modo di cominciare a far luce sulla scomparsa dei suoi genitori. Le ricerche lo conducono alla Oscorp Tower, dove lavora il brillante Curt Connors, ex collega di suo padre privo del braccio destro mirante allo studio degli incroci fra specie per eliminare ogni difetto fisico della razza umana. Peter, spinto dalla curiosità, si allontana ingenuamente dal gruppo di visitatori per esplorare indisturbato un laboratorio nel quale verrà morso da un ragno geneticamente modificato. Nonostante lo spaesamento e l'incomprensione iniziali, Peter impara ben presto ad amare e ad essere intrigato dai poteri acquisiti. Così, dopo aver testato le sue nuove capacità durante la ricerca dell'omicida sui cui grava la morte di suo zio, Peter fabbrica una tuta (realizzata in Spandex Elastam) e costruisce due lancia-ragnatele con il biocavo della Oscorp, facendosi presto conoscere per le strade di Manhattan come Spiderman. La situazione non resterà tranquilla a lungo: caos e timori inizieranno a pervadere i cittadini con la comparsa del bestiale e terrificante Lizard, alter ego del Dott. Connors, mutatosi per un'errata quanto frettolosa sperimentazione umana sul proprio corpo, sotto la pressione esercitata dal malato Norman Osborn. Gli scontri che seguono tra Lizard e Spiderman vedono vincitore quest'ultimo, ma il nemico riesce a scoprirne l'identità e attacca la scuola in cui studia il ragazzo.\r\n\r\nPeter lo segue nelle fogne e scopre il piano dello scienziato: utilizzare il siero sull'intera città e trasformare gli umani in lucertole, dando vita a una specie più evoluta, più forte e più intelligente. Per compiere questo suo piano, Lizard connette il dispositivo alla Oscorp Tower, luogo in cui Peter aveva mandato Gwen per poter creare un antidoto in grado di riportare alla normalità lo scienziato. Gwen crea l'antidoto e sfugge al mostro, ma Peter, braccato dalla polizia, viene smascherato dal capitano George Stacy. Quest'ultimo, però, comprende il senso di giustizia del ragazzo e lo lascia proseguire verso la Oscorp Tower. Mentre Gwen fugge dall'edificio sotto esortazione del padre, Peter comincia ad affrontare Lizard e nella battaglia l'eroe ha la meglio e riesce a diffondere l'antidoto. Connors ritorna normale e, mentre Peter sta per precipitare dal palazzo, il dottore lo salva riuscendo ad afferrarlo, conscio di aver sbagliato e di essere stato vittima della sua follia. Il padre di Gwen, tuttavia, muore per mano di Lizard nel tentativo di aiutare Peter. Prima di spirare, il capitano della polizia di New York fa promettere a Peter di non coinvolgere più sua figlia nella sua doppia vita. Connors viene arrestato e Peter, così, è costretto a lasciare la ragazza. Il giorno dopo, a scuola, Peter ha ormai fatto amicizia con Flash, e decide di continuare a frequentare Gwen. \r\n\r\n.: Locandina :.\r\n \nhttp://thefilmstage.com/wp-content/uploads/2012/04/amazing_spider-man-620x848.jpg\r\n\r\n.: Crediti :.\r\nTitolo originale: The amazing Spider-man\r\n\r\nNazionalità: USA\r\n\r\nAnno: 2012\r\n\r\nGenere: Avventura/Supereroi\r\n\r\nRegia: Marc Webb\r\n\r\nProduzione: US\r\n\r\nDistribuzione: Columbia Pictures\r\n\r\nData di uscita:2012\r\n\r\nCast: Andrew Garfield Emma Stone, \r\n\r\n========================================\r\n\r\n.: Dati tecnici del file :.\r\n\r\nInfo sul file\r\n\r\n\r\nNome The amazing spider-man.avi\r\n\r\nData Tue, 11 Dec 2013 21:43:48 +0200\r\n\r\nDimensione 1,015,889,920 bytes (968.828125 MiB)\r\n\r\n\r\n\r\n\r\n\r\nTipo file RIFF (little-endian) data, AVI, 640 x 272, 25.00 fps, video: XviD\r\n\r\naudio: MPEG-1 Layer 3 (stereo, 48000 Hz)\r\n\r\n\r\n[ Info generiche ]\r\nDurata: 02:10:43 (7843 s)\r\nContenitore: AVI OpenDML\r\nL'AVI ha un indice?: Sì\r\nTotale tracce: 2\r\nTraccia n. 0: video\r\nTraccia n. 1: audio\r\nJunk: VirtualDub build 16297/release\r\n\r\n[ Dati rilevanti ]\r\nRisoluzione: 640 x 272\r\nLarghezza: multipla di 32\r\nAltezza: multipla di 16\r\n\r\n[ Traccia video ]\r\nFourCC: xvid/XVID\r\nRisoluzione: 640 x 272\r\nFrame aspect ratio: 40:17 = 2.352941 (~2.35:1)\r\nPixel aspect ratio: 1:1 = 1\r\nDisplay aspect ratio: 40:17 = 2.352941 (~2.35:1)\r\nFramerate: 25 fps\r\nTotale frames: 196,075\r\nDimensione stream: 880,883,039 bytes (840.07553 MiB)\r\nBitrate: 898.516424 kbps\r\nQf: 0.206461\r\nKey frames: 3,121 (0; 300; 588; 589; 591; ... 195988)\r\nNull frames: 0\r\nMin key int: 1\r\nMax key int: 300\r\nAvg key int: 62.824415\r\nRitardo: 0 ms\r\n\r\n[ Traccia audio ]\r\nAudio tag: 0x55 (MP3)\r\nCanali: 2\r\nChunks: 196,064\r\nDimensione stream: 125,488,000 bytes (119.674683 MiB)\r\nTipo di bitstream (bs): MPEG-1 Layer III\r\nChunk-aligned (bs): No\r\nBitrate (bs): 128 kbps CBR\r\nFreq. campionamento (bs): 48000 Hz\r\nModo (bs): joint stereo\r\nPadding (bs): No\r\nEmphasis (bs): none\r\nInitial skip (bs): 384 bytes\r\nPreload: 456 ms\r\nMax A/V diff: 472 ms\r\nRitardo: 0 ms\r\n\r\n[ Bitstream video ]\r\nTipo di bitstream: MPEG-4 Part 2\r\nUser data: XviD0009\r\nQPel: No\r\nGMC: No\r\nInterlacciamento: No\r\nAspect ratio: Square pixels\r\nQuant type: H.263\r\n\r\n[ Conformità al profilo ]\r\nProfilo selezionato: MTK PAL 6000\r\nRisoluzione: Ok\r\nFramerate: Ok\r\n\r\nRapporto creato da AVInaptic (18-12-2011) in data 2-09-2013 21:44:27","torrent":{"xt":"urn:btih:ea5f7f0624655b004d4e442af31ce2623fbd9ddd","amp;dn":"The+amazing+Spider-Man+%282012%29%2C+%5BXviD+-+Ita+-+Mp3%5DTNT+Village","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea5f7f0624655b004d4e442af31ce2623fbd9ddd","infoHashBuffer":{"type":"Buffer","data":[234,95,127,6,36,101,91,0,77,78,68,42,243,28,226,98,63,189,157,221]},"announce":[],"urlList":[]}}