{"title":"Mastering Microsoft Lync Server 2010 - Sybex","uid":7026395,"size":20321517,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea9647444eb641f5f4364af8e1bf9e8ef5d24f07&amp;dn=Mastering+Microsoft+Lync+Server+2010+-+Sybex&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ingoshwetrust","files":2,"time":1329025578,"description":" [img]http://pixhost.me/avaxhome/37/5a/00205a37_medium.jpeg[/img]\n\n\nNathan Winters, Keith Hanna, &quot;Mastering Microsoft Lync Server 2010&quot;\nSy ex | 2012 | ISBN: 1118089537 | 744 pages | PDF | 23,7 MB\n\nUnified Communications Made Easier with Lync and This Practical Guide\n\nIf you're in charge of Unified Communications (UC), this book is for you. Covering Microsoft Lync Server 2010 in detail, this practical guide shows you how to harness Lync's new capabilities and streamlined tools to simplify the implementation of UC across your business, large or small. From handling installation, remote access, and security to coordinating video chats, VoIP, social media, web conferencing, and more, you'll find a wealth of information and real-world examples on how to get the very most out of this high-demand UC technology.\n\nCoverage includes:\n\nMastering Lync fundamentals such as tools, standards, protocols, and security\n\nPlanning deployment, implementing, and handling upgrades from Office Communications Server\n\nManaging with Lync Control Panel and PowerShell\n\nSetting up Role-Based Access Control (RBAC)\n\nMonitoring, archiving, and troubleshooting\n\nGetting started with Telephony, connecting to the PSTN, and deploying your own conference bridge\n\nIntegrating with Exchange, SharePointÃ‚Â®, and Group Chat as well as other non-Microsoft hardware and software products such as Gateways, PBXs, and other IM clouds\n\nLearn How to Plan, Install, Configure, and Troubleshoot Lync\n\nUnderstand All Client, Server, and Voice Features\n\nCoordinate Web and Video Conferences, Enterprise Telephony, and Desktop Sharing\n\nFind Invaluable Examples of Actual Lync Deployments\n\nLeverage Lync Server 2010 Mobility Service and Lync Mobile Clients ","torrent":{"xt":"urn:btih:ea9647444eb641f5f4364af8e1bf9e8ef5d24f07","amp;dn":"Mastering+Microsoft+Lync+Server+2010+-+Sybex","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea9647444eb641f5f4364af8e1bf9e8ef5d24f07","infoHashBuffer":{"type":"Buffer","data":[234,150,71,68,78,182,65,245,244,54,74,248,225,191,158,142,245,210,79,7]},"announce":[],"urlList":[]}}