{"title":"Nubile Films - Sicilia ** NEW 17 Aug 2015 ** mp4","uid":12243413,"size":171653675,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:eae83d39280101bceb00b6dc0fa11e8b677aada3&amp;dn=Nubile+Films+-+Sicilia+%2A%2A+NEW+17+Aug+2015+%2A%2A+mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"TKTh3K1ng","files":1,"time":1439834456,"description":"Luscious blonde Sicilia sets the scene for seduction as she lays out candles on the table. When Kristof Cale arrives bearing a gift, Sicilia accepts it happily and then rushes off to change into the new bra and thong that her man gave her. Kristof loves seeing Sicilia in the sexy outfit that he picked out, and he instantly shows her just how much by helping her up onto the table so that he can slide her thong aside and bury his face in her creamy bald pussy.\n\nWhen Sicilia turns the tables and pulls out Kristof's cock, he is happy to let her take control and wrap her soft lips around the head. She is gentle in her ministrations, using her sweet hands and wet tongue to increase Kristof's anticipation before she takes him as far into her mouth as she can and starts sucking.\n\nHelping Sicilia back onto the table, Kristof delivers a few more sultry licks to her shaved snatch before rising to his feet and sliding his cock deep into her tight sheath. He keeps one leg propped up on his shoulder to increase his penetration as he wraps a hand around Sicilia's thigh to rub her clit as he fills and fucks her with long gentle strokes.\n\nSicilia loves the gentle rhythm that Kristof has set, but a slow go isn't going to get her off. She sits him down in a chair and climbs aboard, sinking down onto his fuck stick until she is fully impaled and ready to go for a stiffie ride at the pace that will lead her to paradise.\n\nWith her whole body still pulsing in ecstasy, Sicilia relocates back to the table and leans forward to present herself for Kristof to take her from behind. Her bottom and small boobs bounce in time to his thrusts while he pounds away at her luscious pussy, driving her once again to a peak of sheer joy.\n\nFinally sated, Sicilia makes sure that Kristof is satisfied as well. Sucking her man's dick while on her knees brings him close to cumming, but she leaves it to him to finish himself off with a handjob so that he can guide his release all over Sicilia's forehead and down to her mouth for a taste of salty sticky jizz.\n\nScreenshots:\n &lt;a href=&quot;\nhttp://imgsking.com/image/8lA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsking.com/image/8lA&lt;/a&gt;","torrent":{"xt":"urn:btih:eae83d39280101bceb00b6dc0fa11e8b677aada3","amp;dn":"Nubile+Films+-+Sicilia+%2A%2A+NEW+17+Aug+2015+%2A%2A+mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eae83d39280101bceb00b6dc0fa11e8b677aada3","infoHashBuffer":{"type":"Buffer","data":[234,232,61,57,40,1,1,188,235,0,182,220,15,161,30,139,103,122,173,163]},"announce":[],"urlList":[]}}