{"title":"Albatros D.III: Johannisthal, OAW and Oeffag variants ","uid":10360797,"size":2678314,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb195602364fd3d788ed7a9391179f2d17ad8a23&amp;dn=Albatros+D.III%3A+Johannisthal%2C+OAW+and+Oeffag+variants+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":1,"time":1402802286,"description":"\nby James Miller\n\nIn 1916, Imperial German aerial domination, once held by rotary-engined Fokker and Pfalz E-type wing-warping monoplanes, had been lost to the more nimble French Nieuport and British DH 2s which not only out-flew the German fighters but were present in greater numbers. Born-from-experience calls from German fighter pilots requested that, rather than compete with the maneuverability of these adversaries, new single-engine machines should be equipped with higher horsepower engines and armed with two, rather than the then-standard single machine guns. \n\nThe Robert Thelen-led Albatros design bureau set to work on what became the Albatros D.I and D.II and by April 1916 they had developed a sleek yet rugged machine that featured the usual Albatros semi-monocoque wooden construction and employed a 160hp Mercedes D.III engine with power enough to equip the aeroplane with two forward-firing machine guns. Visual hallmarks of the D.I and early production D.II include fuselage mounted Windhoff radiators and matching chords for the upper and lower wings.\n\nMeanwhile, Albatros had already produced the prototype of the D.II's successor, the D.III. Influenced by the French Nieuport sesquiplane design, the D.III featured lower wings of reduced chord and single-spar construction, with the interplane struts now meeting the lower wings in a 'V'. After arriving at the Front en masse in early 1917, the Royal Flying Corps did not possess a fighter that could arrest the Albatros' onslaught against the RFC reconnaissance machines and thus they suffered appalling casualties in a desperate period known as 'Bloody April'. \n\nHowever, despite the D.III's success, the sesquiplane design led to structural flaws that resulted in the deaths of several pilots, which caused the type to be grounded until the lower wings could be strengthened or replaced. Still, even after their return to service, German pilots knew not to prosecute a dive too aggressively lest they invite structural catastrophe.\n\nAlways chasing performance enhancements, by the time of 'Bloody April' Albatros had already designed and received a production order for the D.V.D.IIIs were manufactured concurrently but production was shifted to the Ostdeutsche Albatros Werke (OAW) in Schneidmuhl, where they received more robust construction. \n\nThey differed little from their Johannisthal D.III brethren externally, save for a slightly different skin application on the nose and a D.V-type rudder, which had a curved rather than straight trailing edge. They also had Mercedes engines of 175 hp, versus the 160 hp engines of the Johannisthal D.III. Overall they benefitted from the teething experience of the earlier D.IIIs and avoided the structural problems that resurfaced with the Johannisthal-built D.Vs.\n\nIn all, 500 D.IIIs and 840 D.III(OAW)s were produced and saw heavy service throughout 1917. They extracted a serious toll on the enemy but as the year progressed faced an increasing number of new enemy fighter types, including the Sopwith Pup, Sopwith Triplane, SPAD VII, and SE5a, but remained at the Front in high numbers (446 of both types were recorded on 31 October) until dwindling in spring 1918 (from 357 in February to 82 in June) with the arrival of the Fokker Dr.I and D.VII.","torrent":{"xt":"urn:btih:eb195602364fd3d788ed7a9391179f2d17ad8a23","amp;dn":"Albatros+D.III%3A+Johannisthal%2C+OAW+and+Oeffag+variants+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb195602364fd3d788ed7a9391179f2d17ad8a23","infoHashBuffer":{"type":"Buffer","data":[235,25,86,2,54,79,211,215,136,237,122,147,145,23,159,45,23,173,138,35]},"announce":[],"urlList":[]}}