{"title":"Trainz Driver v1.1.2","uid":8104922,"size":202543200,"categoryP":"games","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:eb28dc5ef5facc92d04f1dc4eb1c5a632f8b4373&amp;dn=Trainz+Driver+v1.1.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mobile-warez","files":2,"time":1360063358,"description":"Size: 199 MB\nLanguage: English\nRequirements: Compatible with iPhone 3GS, iPhone 4, iPhone 4S, iPhone 5, iPod touch (3rd generation), iPod touch (4th generation), iPod touch (5th generation) and iPad. Requires iOS 4.3 or later. This app is optimized for iPhone 5.\n\n\n\nDrive a huge selection of trains on routes from around the world. Consistently one of the top ranked Simulation Apps on iTunes. \n\nDon't take our word for it, just ask our many fans what they think ...\n\nIt's time to pack all that horsepower in your pocket and take Trainz Driver with you everywhere you go. \n\nWith a mix of realistic routes and arcade style sessions plus an easy to use interface, there is something for everyone aged 4 to 104!\n\nTrainz Driver puts you in the cab of a variety of locomotives from around the world. Choose from the &quot;Easy Mode&quot; speed controls, or the more advanced &quot;Realistic Mode&quot; control system. With multiple camera modes you can fly alongside your favourite train, admire the view from the cab, or watch from trackside all while you interact with industries and passenger stations, picking up and dropping off freight wagons, people, and more!\n\nNew content being released all the time - check out the Steam Engines in the &quot;Extra Content&quot; menu.\n\nExpand your experience: You can also create your own Routes and Sessions in Trainz Simulator for iPad (available for separate purchase on the App Store) and then share them with Trainz Driver users through our Download Station. Hundreds of user-created routes are already available, free to download.","torrent":{"xt":"urn:btih:eb28dc5ef5facc92d04f1dc4eb1c5a632f8b4373","amp;dn":"Trainz+Driver+v1.1.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb28dc5ef5facc92d04f1dc4eb1c5a632f8b4373","infoHashBuffer":{"type":"Buffer","data":[235,40,220,94,245,250,204,146,208,79,29,196,235,28,90,99,47,139,67,115]},"announce":[],"urlList":[]}}