{"title":"Titus[Dvd-R].ISO","uid":4435416,"size":4681435136,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ebb51afc09d87fe63952832c2516e5383e0d49d8&amp;dn=Titus%5BDvd-R%5D.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"calasma","files":1,"time":1223507028,"description":"DirecciÃƒÂ³n: Julie Taymor.\nPaises: Italia y USA.\nAÃƒÂ±o: 1999.\nDuraciÃƒÂ³n: 162 min.\nInterpretaciÃƒÂ³n: Osheen Jones (joven Lucius), Dario D Ambrosi (Clown), Anthony Hopkins (Titus Andronicus), Jessica Lange (Tamora), Raz Degan (Alarbus), Jonathan Rhys-Meyers (Chiron), Matthew Rhys (Demetrius), Harry Lennix (Aaron), Angus MacFadyen (Lucius), Kenny Doughty (Quintus), Blake Ritson (Mutius), Colin Wells (Martius), Alan Cumming (Saturninus), James Frain (Bassianus).\nGuiÃƒÂ³n: Julie Taymor; basado en la obra &quot;Titus Andronicus&quot; de William Shakespeare.\nProducciÃƒÂ³n: Conchita Airoldi, Jody Patton y Julie Taymor.\nMÃƒÂºsica: Elliot Goldenthal.\nFotografÃƒÂ­a: Luciano Tovoli.\nMontaje: FranÃƒÂ§oise Bonnot.\nDiseÃƒÂ±o de producciÃƒÂ³n: Dante Ferretti.\nDirecciÃƒÂ³n artÃƒÂ­stica: Pier Luigi Basile, Massimo Razzi y Domenico Sica.\nVestuario: Milena Canonero.\nDecorados: Carlo Gervasi.\nEstreno en EspaÃƒÂ±a: 23 Enero 2004.\n\nSipnosis: Titus Andronicus (Anthony Hopkins), el Gran General romano, regresa victorioso a casa tras una larga guerra contra los godos del norte, en el curso de la cual ha perdido a casi todos sus hijos, con excepciÃƒÂ³n de cuatro. Lucius, el ma-yor, le recuerda a su padre que una parte de la ceremonia en honor a la victoria es el sacrificio humano de un enemigo hecho prisione-ro. Titus elige al mayor de los hijos de Tamora (Jessica Lange), la Reina de los godos, quien ha sido traÃƒÂ­da a Roma como cautiva jun-to a sus tres hijos y al moro Aaron. Aunque Tamora suplica por la vida de su hijo, Titus lleva a su conclusiÃƒÂ³n el ritual, no por ÃƒÂ¡nimo cruel sino por lo que concibe como devociÃƒÂ³n religiosa. La Reina go-da y sus dos hijos restantes, Chiron y Demetrius, juran vengarse. Con ello, se inicia una historia de doble venganza; primero la de Ta-mora, y luego la de Titus\n","torrent":{"xt":"urn:btih:ebb51afc09d87fe63952832c2516e5383e0d49d8","amp;dn":"Titus%5BDvd-R%5D.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebb51afc09d87fe63952832c2516e5383e0d49d8","infoHashBuffer":{"type":"Buffer","data":[235,181,26,252,9,216,127,230,57,82,131,44,37,22,229,56,62,13,73,216]},"announce":[],"urlList":[]}}