{"title":"Electric Resistance - Brave New Day (2014)","uid":9632730,"size":65989467,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ebe818cb9d9b0df6d206e5ccc62343e9b57fd473&amp;dn=Electric+Resistance+-+Brave+New+Day+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FeSslav","files":-1,"time":1392809332,"description":"ELECTRIC RESISTANCE project appeared in the summer 2011. The base for first tracks was variety of world, described in books of O.Huxley, D.Oruell, E.Zamyatin and other splendid authors of science fiction. In music Techno-Industrial, mixed with all possible elements of other genres, was chosen as the main stylistic direction.\nThe creator of ELECTRIC RESISTANCE is Alexander Dmitriev. From first gigs the performance has been supported by Pavel Grudnev as a keyboarder/sampler. 2012 became a year of sound searching, stage experiments and choosing ways of development. At the beginning of 2013, the project paid more attention to live performance, to its visual part. So, currently ELECTRIC RESISTANCE is not only unusual vision of dark electric stage, but also an eye-catching show.\n\n\n&quot;Brave New Day&quot; - mini-album Russian EBM / Futurepop project ELECTRIC RESISTANCE, this is the second official release. In contrast to the &quot;S-Boeystoichivost&quot; new release more melodic, soulful lyrics that caused written in Russian. \nIn support of the mini-album released clip for the track 'City', which you can find on the official YouTube channel label INSANE RECORDS\n\nYou can support us: BandCamp, iTunes, Amazon, Spotify, Rdio, Google play, Deezer, Simfy, Rhapsody, iHeartRadio, Gracenot, MySpace, Medianet, MuveMusic, xBox music, eMusic, WiMP, Music Unlimited, Shazam, Nokia, Juke, JB HI-FI, 7Digital.\n\nTracklist:\n\n01.Electric Trash\n02.N.E.O.N.\n03.Remember\n04.City\n05.Glass\n06.Brave New Day\t","torrent":{"xt":"urn:btih:ebe818cb9d9b0df6d206e5ccc62343e9b57fd473","amp;dn":"Electric+Resistance+-+Brave+New+Day+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebe818cb9d9b0df6d206e5ccc62343e9b57fd473","infoHashBuffer":{"type":"Buffer","data":[235,232,24,203,157,155,13,246,210,6,229,204,198,35,67,233,181,127,212,115]},"announce":[],"urlList":[]}}