{"title":"FIFA.WC.2014.(13 jun-14 jul).BBC.Match.Of.The.Day.720p","uid":10649306,"size":18320200997,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:ed88ad30df4718a01baf9d4b128ab5cbb8c9d6eb&amp;dn=FIFA.WC.2014.%2813+jun-14+jul%29.BBC.Match.Of.The.Day.720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nepotu","files":-1,"time":1406587845,"description":"BBC Match Of The Day\n====================\n\n2014.06.13\n----------\nMark Chapman introduces the best of the action and reaction from the opening game of the 2014 World Cup between Brazil and Croatia. Host nation Brazil are vying for a record-extending sixth world crown and go into the tournament as the team to beat, led by poster boy Neymar.\nAlan Shearer and Danny Murphy provide the studio analysis.\n\n2014.06.14\n----------\nHighlights of the opening match in Group B as Spain face the Netherlands in a repeat of the 2010 World Cup final, as well as Chile's match with Australia, and the Group A clash between Mexico and Cameroon.\n\n\n2014.06.15\n----------\nHighlights of England's Group D opener against Italy from Manaus. The Three Lions drew their opening two group matches four years ago, as did Italy, and both will be looking to get off to a winning start this time around.\nEngland's other Group D rivals Uruguay and Costa Rica also get their World Cup campaigns up and running, as do Group C rivals Greece and Colombia, both making their first World Cup appearances of the 21st century. Ivory Coast are also in action against Japan.\n\n2014.06.16\n----------\nHighlights of three World Cup matches, which saw Switzerland play Ecuador, France meet Honduras and Argentina take on Bosnia-Herzegovina.\n\n\n2014.06.17\n----------\nHighlights of the two opening games in Group G between Germany and Portugal, and Ghana against the USA. Plus action from the Group F match as Iran take on Nigeria.\n\n2014.06.18\n----------\nHighlights of Brazil's Group A meeting with Mexico in Fortaleza. Neymar opened the scoring in a 2-0 Brazil win when the two countries met at the same venue in 2013. There is also action from both Group H opening matches, Belgium take on Algeria in Belo Horizonte, while Russia are in action against South Korea.\n\n2014.06.19\n----------\nHighlights of the matches in Group B between Spain and Chile and Australia against the Netherlands, plus the Group A clash as Cameroon take on Croatia in Manaus.\n\n2014.06.20\n----------\nHighlights of three World Cup matches, which saw England take on Uruguay, Colombia meet Ivory Coast and Japan play Greece.\n\n2014.06.21\n----------\nHighlights of Italy's Group D meeting with Costa Rica in Recife. The Azzurri won the only previous meeting between the two countries 20 years ago, Giuseppe Signori scoring in a 1-0 win. Group E seeds Switzerland meet France, with the last three meetings between the clubs having ended in draws, including their 2006 World Cup meeting. Ecuador and Honduras are also in action.\n\n2014.06.22\n----------\nHighlights from three World Cup matches, as Argentina take on Iran, Nigeria play Bosnia-Herzegovina and Germany meet Ghana.\n\n2014.06.23\n----------\nHighlights of the matches in Group H between Belgium and Russia, and Korea and Algeria, plus the Group G clash between USA and Portugal.\n\n2014.06.24\n----------\nDan Walker introduces the best of the action and reaction from the day's concluding matches in Groups A and B. Hosts Brazil met Cameroon in Brasilia, while Mexico and Croatia went head-to-head in Recife with a likely qualification place at stake. It was likely to be a similar scenario in the Group B fixture between Netherlands and Chile, while defending champions Spain met tournament outsiders Australia.\n\n2014.06.25\n----------\nHighlights from four World Cup matches, as England play Costa Rica, Italy meet Uruguay, Japan take on Colombia and Greece face Ivory Coast.\n\n2014.06.26\n----------\nAnother opportunity to see highlights of Wednesday's final group games, with former champions France and Argentina both in action.\n\n2014.06.27\n----------\nMark Chapman presents highlights of the final matches in Group G as the USA play Germany and Portugal take on Ghana. There is also action from the games that decided the placings in Group H with Algeria facing Russia and South Korea meeting Belgium.\n\n2014.06.29\n----------\nHighlights from the first two matches in the last 16 of the World Cup in Brazil.\n\n2014.06.30\n----------\nHighlights from two matches in the last 16 of the World Cup in Brazil.\n\n2014.07.01\n----------\nHighlights from two matches in the last 16 of the World Cup in Brazil.\n\n2014.07.02\n----------\nHighlights from two matches in the last 16 of the World Cup in Brazil.\n\n2014.07.05\n----------\nHighlights from the first and second quarter-finals at the World Cup in Brazil, as France face Germany and Brazil take on Colombia.\n\n2014.07.06\n----------\nHighlights from the third and fourth quarter-finals at the World Cup in Brazil.\n\n2014.07.09\n----------\nHighlights from the first semi-final at the World Cup in Brazil. Hosts Brazil meet Germany in Belo Horizonte.\n\n2014.07.10\n----------\nMark Chapman introduces highlights of the second World Cup semi-final as two-time winners Argentina take on the Netherlands in Sao Paulo. Argentina's first triumph in 1978 came with a 3-1 extra-time win over the Dutch in Buenos Aires, Mario Kempes famously scoring twice. The Netherlands are three-time World Cup runners-up, including four years ago.\n\n2014.07.13\n----------\nHighlights from the third place play-off of the 2014 World Cup from the Estadio Nacional in Brasilia, where hosts Brazil take on the Netherlands.\n\n2014.07.14\n----------\nHighlights of the 2014 Fifa World Cup final. Germany meet Argentina at the iconic Maracana stadium in Rio de Janeiro as the tournament reaches its climax.\n\n\nCredit: jurez-hh\t\t","torrent":{"xt":"urn:btih:ed88ad30df4718a01baf9d4b128ab5cbb8c9d6eb","amp;dn":"FIFA.WC.2014.%2813+jun-14+jul%29.BBC.Match.Of.The.Day.720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed88ad30df4718a01baf9d4b128ab5cbb8c9d6eb","infoHashBuffer":{"type":"Buffer","data":[237,136,173,48,223,71,24,160,27,175,157,75,18,138,181,203,184,201,214,235]},"announce":[],"urlList":[]}}