{"title":"Vidar Vang - Sidewalk Silhouettes [2012] FLAC]","uid":8061657,"size":263691784,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ee322fcebeea9ac80a2641ee98bc3a01b83adc2d&amp;dn=Vidar+Vang+-+Sidewalk+Silhouettes+%5B2012%5D+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":18,"time":1359098784,"description":"Artist: Release: Sidewalk Silhouettes\nMusicBrainz: b9a83e88-340f-483b-a2f7-b9942a58d891\nReleased: 2012-02-03\nLabel: VV Records\nCatalog#: VVR 03\nCountry: NO\nPackaging: Jewel Case\n\nTracklisting:\n\n01. From the Shadow of Elvis (04:36)\n02. You and Me Again (and Again) (01:07)\n03. Out of Time (02:44)\n04. Uphill (01:32)\n05. Already Gone (03:28)\n06. No Warning (02:10)\n07. The Chapman Autograph (05:51)\n08. Sweet Lovesong (02:12)\n09. Did You Think It Would Last? (02:18)\n10. Stand Up Straight (02:47)\n11. Rodeo (03:02)\n12. Out Where All the Rivers Meet (01:27)\n13. Can't Make You Come Back to Me (04:12)\n14. Moloen (00:29)\n15. Rock'n Roll Song (06:15)\n16. Isolation Rd. Part 2 (01:53)\n\nLiner notes:\nA decade ago, Cato Thomassen and Seasick Steve produced my debut album, &quot;Rodeo&quot;, at Jukejoint Studio in Notodden. One late night in the studio, after a couple of hours in Steve's well equipped in-house bar, I gained the courage to play Cato some ideas I had for a different kind of record than the one we were making with the band at the time. Songs which were 20 seconds long, instrumentals, songs that consisted of just a chorus or a verse - but also acoustic and different takes on material we were already working on. Cato jumped on the idea, and then and there we decided (as one often does after a visit to a bar) to make that album together. However, we didn't talk of when, how or where.\n\nIn November 2010 we met up at Cato's studio on the riverbank of Akerselva in Oslo. I brought along with me 22 songs and ideas, and after setting up a basic sound for my voice and acoustic guitar in the corner of the room, Cato pushed the &quot;record&quot; button. No headphones, no talkback, no red light, no interference, no promo plan, no release date - actually no one had any idea that we were in there making music at all. It was an absolutely liberating experience. It felt like I was playing at home, in my kitchen, where I always seem to find the right vibe. Cato and I had talked a lot about that we this time around wanted to approach overdubbing differently than one normally would on my songs. No pedal steel, fiddle or harmonica (even though one managed to make its way in there) - but 80s keyboards, the Dimension C pedal, Prophet, Stylophone, Hapsichord and so on. We started to play around with some airy keyboard sounds on &quot;Already Gone&quot;, and instantly heard a sound evolve. The cinematic feeling I've always been such a big fan of in the music I listen to - whether it's the haunting hums of &quot;Dark was the night, cold was the ground&quot;, the longing outro of &quot;Racing in the Streets&quot; or the beautifully scary &quot;Molde Canticle&quot; - became a recurrent term for the sound we were looking for.\n\nNo one heard any of the songs until we were done with all of the recordings. We never even brought home a rough mix ourselves. This, I believe, gave the sessions great focus, and strongly consolidated the musical world we created in that room.\n\nHere they are; my collection of Sidewalk Silhouettes (Vol.1 ... ?)\n\nVidar - Oslo, December, 2011\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:ee322fcebeea9ac80a2641ee98bc3a01b83adc2d","amp;dn":"Vidar+Vang+-+Sidewalk+Silhouettes+%5B2012%5D+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee322fcebeea9ac80a2641ee98bc3a01b83adc2d","infoHashBuffer":{"type":"Buffer","data":[238,50,47,206,190,234,154,200,10,38,65,238,152,188,58,1,184,58,220,45]},"announce":[],"urlList":[]}}