{"title":"Adopted Son","uid":7282135,"size":918176,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee57281d4a103f7dfc004c703f501445cfb30617&amp;dn=Adopted+Son&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"superluminal23","files":-1,"time":1337464798,"description":"Adopted Son is an uplifting world-spanning story about babies... alien babies! How cute is that?!? Darn cute, that's for sure. It is also about farming, bioterrorism, the civil rights movement, and third world revolutions.\n\nAlthough nominally a story of alien invasion based on Roswell Incident and the stories of 'abductees', it touches on a lot of today's social and political topics including; racism, terrorism, xenophobia, war, the intelligence community, bio-warfare, love, peace, family, genetic engineering, militarism, government bureaucracy, and what it means to be human. Here's what the publisher says about it:\n\nThe invasion has begun...\n\nAn invasion not from the stars but from within our wombs. All over the world children are being born...different. Their features are alien, their DNA isn't human, their loyalties are unknown. As scientists, spies, and regular citizens race to make sense of this new disease they find themselves asking the same question: Is this the first wave of an alien assault on Earth?\n\nCelebrated fiction author and bioterrorism expert Dominic Peloso weaves a complex tale of alien invasion, environmental catastrophe, and societal upheaval, in a world not too removed from our own. Adopted Son perfectly blends hard sci-fi with biting political and social commentary to create a truly modern literary masterpiece that transcends genres.","torrent":{"xt":"urn:btih:ee57281d4a103f7dfc004c703f501445cfb30617","amp;dn":"Adopted+Son","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee57281d4a103f7dfc004c703f501445cfb30617","infoHashBuffer":{"type":"Buffer","data":[238,87,40,29,74,16,63,125,252,0,76,112,63,80,20,69,207,179,6,23]},"announce":[],"urlList":[]}}