{"title":"Sexuallybroken------ Pretty redhead   Claire Robbins","uid":8877011,"size":785300150,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:eee64354906a66ed8ea5f48b69005314ec70329f&amp;dn=Sexuallybroken------+Pretty+redhead+++Claire+Robbins&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1378234311,"description":"Pretty redhead Claire Robbins tied down, vibrated and throat boarded out of her mind!  Claire Robbins\n\n\nMP4 only.\n \n \nWhen most people see a thrown away old wooden pallet in the dumpster, the last thing that crosses their mind is to fish it out and tie pretty little porn stars to it. We do things a bit differently around here at Sexuallybroken, and throat boarding was the very first thing we thought of when we saw it in the trash.\n\nThe tie is beautiful in its simplicity. Take a pallet, drill it into the stage, then take a porn star and drill her into the pallet with dick. Claire Robbins is propped against the pallet at the perfect angle to open up her throat hole. Her legs are tied spread wide apart and a vibrator is bolted down. There is no hope for escape, neither her pussy nor her throat has a chance. While the cock is throat boarding her into next week, the vibrator will be ripping multiple forced orgasms out of her exposed pussy. \n\nOnce she is roped in place, we step in with a hard dick and proceed to take Claire apart bit by bit. She can't even breathe unless we grant it. The cock owns her throat. Drool flows helplessly down her chin and coats her chest and belly. Her eyes glaze over and her body shifts into survival mode. She is an animal now, not a porn star. An animal just trying to get one more gulp of air into deprived lungs. All the while the vibrator is tirelessly doing its job. A vibrator never needs a break or gets distracted. All it does is force girls to cum-whether they want to or not. Long after the orgasms become painful and exhausting, they are still cumming.\n\nIn the end, Claire is hanging limply in her rope, covered in spit and cum and her own melted brains. Her eyes are glassy and her mouth is hanging open. The light is on, but nobody is home. It is a good look on her. Welcome back to Sexuallybroken bitch!\n \nScreens   &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/09_02crobbins4/SexuallyBroken-Claire-Robbins-Pretty-redhead-Claire-Robbins-tied-down-vibrated-and-throat-boarded-out-of-her-mind.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/09_02crobbins4/SexuallyBroken-Claire-Robbins-Pretty-redhead-Claire-Robbins-tied-down-vibrated-and-throat-boarded-out-of-her-mind.php&lt;/a&gt;\n\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:eee64354906a66ed8ea5f48b69005314ec70329f","amp;dn":"Sexuallybroken------+Pretty+redhead+++Claire+Robbins","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eee64354906a66ed8ea5f48b69005314ec70329f","infoHashBuffer":{"type":"Buffer","data":[238,230,67,84,144,106,102,237,142,165,244,139,105,0,83,20,236,112,50,159]},"announce":[],"urlList":[]}}