{"title":"BBC Rip Off Britain Food Series 1 08of10 720p x264 AAC HDTV ","uid":9860572,"size":1022418392,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:ef02db02cffe1b15d68baad9749f773455ccf61c&amp;dn=BBC+Rip+Off+Britain+Food+Series+1+08of10+720p+x264+AAC+HDTV+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MVGroup","files":-1,"time":1396289812,"description":"Rip Off Britain: Food Series 1\n\nHealth-Medical Documentary hosted by Gloria Hunniford and Angela Rippon and Julia Somerville, published by BBC in 2014 - English narration\n\n\nInformation\n------------------------------\n\nRip Off Britain: Food Series 1\nGloria Hunniford, Angela Rippon and Julia Somerville investigate the truth about our food in a series exposing everything from the secrets of the supermarkets to the reality of what is behind the labels.\n\n\n1)  Part 1 \nAmong the stories on the first programme: How much of what is served at the best-known restaurants on the high street is made on the premises and how much is simply bought in and reheated? And the team is on the road with the inspectors battling to ensure that food described as local has not actually come from the other side of the world. Plus, how free trials of diet pills can result in you losing a lot more money than weight, and why wholemeal bread is not always made in quite the way you might expect.\n\n2)  Part 2 \nA year after the horsemeat scandal, just how much can we trust the meat that ends up on our plates? With further food scares about TB and hepatitis in our meat, the team discover the truth about the risks and, with the help of top scientists, reveal how to make sure your food is safe to eat. Plus, the team find out more about the most common food poisoning bug in Britain, thought to be present in around two thirds of raw chicken. Is enough being done to tackle it, and what can you do to avoid getting it? Also on the programme, new ways of testing meat to stop anything like the horsemeat scandal happening again.\n\n3)  Part 3 \nGloria Hunniford, Angela Rippon and Julia Somerville investigate the quality and prices of the food sold in the supermarkets that dominate our weekly shop. A test on the freshness of fish sold at supermarket fish counters has some unexpected results. How much of what we buy could already be past its best? Also, the team reveal how much more you can end up paying in the big-name convenience stores, compared to their larger branches down the road. Should all their branches, whatever the size, charge the same for the same goods? Plus, with most supermarkets now offering upmarket food ranges, what is the difference between these and the cheaper alternatives? Are the 'posh' ones worth the extra cash?\n\n4)  Part 4 \nJulia Somerville, Angela Rippon and Gloria Hunniford investigate what we pay for our food and drink and ask whether it is too much. They look at why the cost of a roast dinner is on the rise, discover how the weather affects prices, and meet viewers angry at sky-high prices for snacks when flying. Plus, how can pubs justify charging as much for soft drinks as they do for beer? And why do some well-known restaurant chains charge more for their vegetarian meals than the meaty dishes with more expensive ingredients?\n\n5)  Part 5 \nAngela Rippon, Gloria Hunniford and Julia Somerville expose more secrets of the food business, investigating whether special offers and packaging are always everything they seem, and going undercover in the wine aisles to discover if all those supermarket wine deals really do offer value for money. Plus, a man angry at the appearance of his frozen fish goes behind the scenes of a food photography shoot to discover why the picture on the packet can so often look rather different from the food inside. And, how hard is it to buy just British? A family reveals the results of a year-long experiment, with examples of foods that may look like they're made in the UK but in fact come from further afield.\n\n6)  Part 6 \nThe Team are back to investigate more of the secrets of our shopping baskets. They look at how some supermarkets make it difficult to compare prices between products and work out the best deal, and examine what exactly goes into our sausages. Plus, when a test on food packaging reveals even bodybuilders struggle to open some bestselling foods, an industry boss is put on the spot to have a go himself. And the team explore why water is added to so many everyday foods.\n\n7)  Part 7 \nAngela Rippon, Gloria Hunniford and Julia Somerville get to grips with more complaints from viewers about food and drink, revealing the things the labels do not always make clear. The team also expose some of the unexpected ingredients that go into our favourite foods, such as crushed beetle, and reveal why adding one word to the label can mean that the food you are buying does not have to contain any of what you might have thought was the main ingredient. Plus, why some of the country's biggest household names have refused to sign up to the new labelling scheme designed to make it easier for us to eat healthily.\n\n8)  Part 8 \nIn this episode the team investigate more stories about what we eat, asking if most of us have a diet too sweet for our own good. They uncover some surprising facts, including how some smoothies have more sugar in them than a can of cola, and they meet the mother angry at the effect such apparently healthy drinks had on her children's teeth. Plus, as dieticians say some cereals should be eaten for dessert rather than breakfast, what is the best way to way to start your day when it comes to food? Also, a viewer gets to the bottom of why foods that look a sensible choice because they are low in fat might contain higher levels of sugar instead.\n\n9)  Part 9 \nAngela Rippon and the team reveal more secrets about our food and the way it's sold. Could that bag of healthy-looking salad at the bottom of the fridge be harbouring a dirty little secret? And how much notice should we take of all those confusing dates on the labels of what we buy? Could a good old-fashioned sense of smell be a better way to determine what is safe to eat? Plus, why frozen food can sometimes be better for you than fresh, and the campaigners determined to cut down on supermarket waste and at the same time ensure nothing goes uneaten from the farmer's field.\n\n10)  Part 10 \nGloria Hunniford, Angela Rippon and Julia Somerville round off the series investigating viewers' complaints about all things food and drink. They explore whether free-range eggs are really worth the extra cost, and reveal the unexpected levels of salt in some everyday products. Plus, with millions of us spending what seems a fortune on coffees and lunches on the go, the true cost of a high street cuppa is broken down; are our cafes and coffee shops charging over the odds? Also, how much can we trust the labels promising food is ethically produced?\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img853.imageshack.us/img853/445/1uf4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img853.imageshack.us/img853/445/1uf4.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img513.imageshack.us/img513/3313/n0dv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img513.imageshack.us/img513/3313/n0dv.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img833.imageshack.us/img833/3726/p7uj.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img833.imageshack.us/img833/3726/p7uj.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img203.imageshack.us/img203/8057/7w7l.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img203.imageshack.us/img203/8057/7w7l.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img824.imageshack.us/img824/2561/3sd6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img824.imageshack.us/img824/2561/3sd6.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img203.imageshack.us/img203/9482/sb4i.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img203.imageshack.us/img203/9482/sb4i.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img822.imageshack.us/img822/9312/1t2d.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img822.imageshack.us/img822/9312/1t2d.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img824.imageshack.us/img824/4223/vhyp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img824.imageshack.us/img824/4223/vhyp.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img833.imageshack.us/img833/1038/4zl8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img833.imageshack.us/img833/1038/4zl8.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img513.imageshack.us/img513/348/bzr8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img513.imageshack.us/img513/348/bzr8.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img23.imageshack.us/img23/3254/5w95.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img23.imageshack.us/img23/3254/5w95.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img811.imageshack.us/img811/5093/f77j.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img811.imageshack.us/img811/5093/f77j.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img824.imageshack.us/img824/1663/l43r.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img824.imageshack.us/img824/1663/l43r.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img856.imageshack.us/img856/801/5lr4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img856.imageshack.us/img856/801/5lr4.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img819.imageshack.us/img819/4388/4n1g.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img819.imageshack.us/img819/4388/4n1g.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img69.imageshack.us/img69/1361/7ld1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img69.imageshack.us/img69/1361/7ld1.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;1a52737d725a562e342b&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 3018 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280 x 720\n * Audio Codec: AAC LC\n * Audio English\n * Audio Bitrate: 160 Kbps ABR 48KHz\n * Audio Channels: Stereo 2\n * Run-Time: 44mins\n * Framerate: 25 FPS\n * Number of Parts: 10\n * Container Mp4\n * Part Size: average 970 MB\n * Source: HDTV\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.bbc.co.uk/programmes/b03ywzjz&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/programmes/b03ywzjz&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ef02db02cffe1b15d68baad9749f773455ccf61c","amp;dn":"BBC+Rip+Off+Britain+Food+Series+1+08of10+720p+x264+AAC+HDTV+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef02db02cffe1b15d68baad9749f773455ccf61c","infoHashBuffer":{"type":"Buffer","data":[239,2,219,2,207,254,27,21,214,139,170,217,116,159,119,52,85,204,246,28]},"announce":[],"urlList":[]}}