{"title":"Family.Guy.Season.1 - [Mp4.TVRip] [aninepointstar] [REQUESTED]","uid":4693204,"size":344034805,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:efac437ee47c7922fdb7abe5b886e4a5d2f350a3&amp;dn=Family.Guy.Season.1+-+%5BMp4.TVRip%5D+%5Baninepointstar%5D+%5BREQUESTED%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aninepointstar","files":7,"time":1233465446,"description":"Family.Guy.Season.1 - [Mp4.DVDRip.Xvid] [aninepointstar]\n-----------------------------------------------------------------------------------\n\n*NOTE: IF YOU WOULD LIKE ME TO UPLOAD MP4 MOVIES OR METAL MUSIC PLEASE POST A REQUEST ON MY NEWEST VIDEO AND I'LL SEE WHAT I CAN DO*\n\nCheck the episodes for yourself! I hear about a lot of people not knowing which episodes are whick, which go with wich season etc so go to this link and search them for yourself\n &lt;a href=&quot;\nhttp://www.tv.com/family-guy/show/348/episode_guide.html?season=1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tv.com/family-guy/show/348/episode_guide.html?season=1&lt;/a&gt;\n\n- This movie is for ipod, psp or any other mp4 player\n- This movie is the exact screen size for any portable mp4 player, hence the small file size\n- Remember not to download a torrent with 0 seeds (i screwed up a few of my torrents)\n- Please don't spam my torrents with comments\n- All torrents are tested before uploading\n- Comment and rate\n- I know a heap of people don't seed, so i'm onna explain something...most ISP's (internet service providers) don't count uploads so it shouldn't be a problem. If your ISP DOES count uploads then they most likely have on and off-peak service aswell SO say if your getting 30 gigs of downloads a month, your most likely getting 20gigs off-peak and 10gigs on-peak which means 20 gigs 12 at night - 7 in the morning and 10 gigs 7 in the morning - 12 at night SO just seed in the off-peak hours as this won't slow your internet down. i really don't see why it's such a problem. you don't get anything out of it, but it's what keeps torrents and sites like TPB alive so just do it.\n\nDON'T FORGET TO SEARCH MY OTHER TORRENTS FOR THE OTHER SEASONS ASWELL!\n\n\n*Please also note that if you wanna watch it on the tv, chuck it on a usb, external hardrive or ipod, (doesn't work with the touch) plug it into your 360, PS3 or DVD Player with a USB imput. Go play from external device. If the quality isn't good enough, go desplay settings and change the screen size so it's smaller and better quality*\n\nThank                     a      n n      n n  p p p p     s s s s s s s s s s                        aaa     n  n     n n p   pp   p  s s s s s s s s s\n                        aaaaa    n n n    n n p  p  p   p  s s \n                       a a a a   n nn n   n n p  p  p   p   s s\n                     a a    a a  n n n n  n n p   pp   p     s s\n                    a a      a a n n  n n n n p p p p p       s s\n                    a aaaaaaaa a n n   n nn n p p            s s\n                    a a      a a n n    n n n p p           s s\n                    a a      a a n n     n  n p p         s s \n                    a a      a a n n     n  n p p s s s s  s \n                             s s s s s s s s s s s s s s s \n                              --------------------------  \n                                 P R O D U C T I O N\n-----------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:efac437ee47c7922fdb7abe5b886e4a5d2f350a3","amp;dn":"Family.Guy.Season.1+-+%5BMp4.TVRip%5D+%5Baninepointstar%5D+%5BREQUESTED%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efac437ee47c7922fdb7abe5b886e4a5d2f350a3","infoHashBuffer":{"type":"Buffer","data":[239,172,67,126,228,124,121,34,253,183,171,229,184,134,228,165,210,243,80,163]},"announce":[],"urlList":[]}}