{"title":"Spacebase DF-9 Alpha 1b Hotfix","uid":9089238,"size":151458420,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:eff749f79b23e8acbc14dcd86362b929ce7b086c&amp;dn=Spacebase+DF-9+Alpha+1b+Hotfix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1382558406,"description":"In Spacebase DF-9, you'll build a home among the stars for a motley population of humans and aliens as they go about their daily lives. Mine asteroids, discover derelicts, and deal with the tribulations of galactic resettlement in Earth's distant future. Meteor impacts! Explosive decompression! Unbearable loneliness! \n\n Key Features: \n\n\n     Resource management \n     Carefully plan and build your base using raw matter, mine more from asteroids. \n     Detailed simulation of oxygen and vacuum \n     Keep citizens comfy and safe from asphyxiation. \n     Social simulation \n     Citizens mingle, forming friendships and enmities that affect morale and base culture. \n     Duty assignment \n     Assign citizens to duties they're well suited for, and watch base efficiency and happiness increase as these skills develop. \n\n Planned Features: \n\n The Alpha version here on Early Access is constantly being improved! Here are some of the big ticket items in our near-term development plan: \n\n     Carryable objects: Citizens pick up and interact with a wide range of smaller objects: food, tools, trinkets, fashion accessories. Citizens collect and trade some of these based on personal tastes. \n     Base history screen: See a chronicle of your base you can share with other players. Capture and annotate screenshots to document important or zany events. \n     Hydroponic Garden zones: Gardeners grow food, which citizens can cook and eat. Gourmet meals can be served in pubs. Plants in garden zones also generate extra oxygen for your base. \n     Power system: Build Fusion Reactors to provide power to rooms. Without power, lights go out and machines stop working. \n     Meteor strikes: Stray space debris can smash holes in your hull, causing vacuum hazards and damaging nearby structures. \n\n Instructions: \n 1.)Extract archives \n 2.)Run Space.exe \n 3.)Have fun! \n","torrent":{"xt":"urn:btih:eff749f79b23e8acbc14dcd86362b929ce7b086c","amp;dn":"Spacebase+DF-9+Alpha+1b+Hotfix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eff749f79b23e8acbc14dcd86362b929ce7b086c","infoHashBuffer":{"type":"Buffer","data":[239,247,73,247,155,35,232,172,188,20,220,216,99,98,185,41,206,123,8,108]},"announce":[],"urlList":[]}}