{"title":"New Marvel I Like 3-21-12","uid":7121369,"size":77135711,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f0ec933fd3a430883dbee548899f96110bd17362&amp;dn=New+Marvel+I+Like+3-21-12&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dadrkhomr","files":7,"time":1332379077,"description":"These are the Marvel comics I got from the week beginning 3/21/2012.  These are not a complete list of what Marvel put out this week.  There are other torrents for that. There are 6 titles in this week's offering. All comics are either in CBR or CBZ format and are labelled individually.  Please do not share my descriptions or torrent ads with anyone without messaging me first.  If this torrent has no seeds please msg me privately.  I will be glad to reup anything that has no seeds.\n\n[IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/avsx4.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/iim514.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/asm682.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/afbd6.jpg[/IMG]\n\nAmazing Spider-Man #682 (03/21/12 CBR)\n\nPart one of &quot;Ends of the earth,&quot; the next big Spider-Man event! The Doc Ock story you've waited 50 years for! Doctor Otto Octavius holds the entire earth hostage with his dying breath. What price will Spider-Man have to pay to buy the whole world one more day? Special appearance by the Avengers!\n\nAvengers Prelude: Fury's Big Week #6 (of 8) (03/21/12 CBR)\n\nThe newest installment of the official Marvel cinematic universe tie-in comics is here just in time for The Avengers movie! How will S.H.I.E.L.D. maintain the status quo in a world full of gamma-powered rage monsters, hammer wielding gods and men in iron suits? What exactly is The Avengers Initiative? If you thought you knew everything there was to know about director Nick Fury and the elusive Agents of S.H.I.E.L.D. - think again! \n\nAvengers X-sanction #4 (of 4) (03/21/12 CBR)\n\nAs the final hours tick down, Cable must take down a berzerker Wolverine and a wisecrackin' web-head to ensure a deadly future does not come to pass! Sets the stage for Avengers vs. X-Men! \n\nInvincible Iron Man #514 (03/21/12 CBR)\n\nTony Stark is called out for his actions during Fear Itself! The Mandarin on American soil! Has Bethany Cabe found the mole, or has the mole found Bethany Cabe? \n\nThunderbolts #171 (03/21/12 CBR)\n\nAs the 'Bolts continue their escape through time, Songbird escapes for an island vacation. But in Tahiti, a mad scientist sets his sights on Melissa Gold--but he ain't the only one mad about it! \n\nUncanny X-Men #9 (03/21/12 CBR)\n\nPrison break! Featuring the Avengers! \n\n","torrent":{"xt":"urn:btih:f0ec933fd3a430883dbee548899f96110bd17362","amp;dn":"New+Marvel+I+Like+3-21-12","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0ec933fd3a430883dbee548899f96110bd17362","infoHashBuffer":{"type":"Buffer","data":[240,236,147,63,211,164,48,136,61,190,229,72,137,159,150,17,11,209,115,98]},"announce":[],"urlList":[]}}