{"title":"Advanced Practical Medicinal Chemistry","uid":14626773,"size":3119207,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f1a0d047efa377756cad1d336c3ad39e0f45d721&amp;dn=Advanced+Practical+Medicinal+Chemistry&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1463316885,"description":"Advanced Practical Medicinal Chemistry - Ashutosh Kar (New Age, 2004).pdf\r\n\r\nISBN 978-81-224-2553-6\r\n\r\nThe Present Compendium On Advanced Practical Medicinal Chemistry Is Designed Specifically To Serve As A Text-Cum-Reference Book Not Only Intended For The Advanced Undergraduate And Graduate Students Of Pharmacy Specializing In Pharmaceutical Chemistry But Also For The Bulk-Drug Industrial Researchers And Academics Who Work Intimately With Medicinal Compounds. It Mainly Comprises Of Four Comprehensive Chapters. First Chapter Is Entirely Devoted To Safety In Chemical Laboratory, Which Is An Absolute Must For Each Medicinal Chemist. Second Chapter Is On Drug Synthesis And Concentrates On Three Vital Aspects, Namely : Conceptualization Of A Synthesis, Reaction Variants, And Stereochemistry. Third Chapter Exclusively Deals With Performing The Reactions And Entails The Wide Range Of Latest Laboratory Techniques Used In A Good Chemical Laboratory To Facilitate Synthesis Of Drugs.Fourth Chapter Is Particularly Focused And Earmarked To Synthesis Of Medicinal Compounds, And Essentially Include Various Cardinal Aspects, Such As :Types Of Chemical Reactions, Organic Name Reactions (Onrs), And Selected Medicinal Compounds. A Galaxy Of Eighty Carefully Chosen Medicinal Compounds Have Been Presented In Anoriginal-Unique-Style Comprising Of : Chemical Structure-Synonym (S)/Chemical Name(S)-Theory-Chemicals Required-Procedure-Precautions- Recrystallizatio-Theoretical Yield/Practical Yield-Physical Parameters-Uses, And -Questions For Viva-Voce.It Is Hoped That Advanced Practical Medicinal Chemistry Would Certainly Help To Bridge Existing Gap And Fill Up The Long Needed Vacuum In The Synthesis Of Drugs In Pharmaceutical Chemistry Departments, Academics And Bulk-Drug Industries, And May Provide The Basis For Meaningful Productive Group Discussions Of Synthetic Problems On A Broader Perspective","torrent":{"xt":"urn:btih:f1a0d047efa377756cad1d336c3ad39e0f45d721","amp;dn":"Advanced+Practical+Medicinal+Chemistry","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1a0d047efa377756cad1d336c3ad39e0f45d721","infoHashBuffer":{"type":"Buffer","data":[241,160,208,71,239,163,119,117,108,173,29,51,108,58,211,158,15,69,215,33]},"announce":[],"urlList":[]}}