{"title":"Prison Architect - Alpha 12 (Mac)","uid":8763351,"size":118611272,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:f20d244efaac6fad97346e070fbe6dd2c8ac4dda&amp;dn=Prison+Architect+-+Alpha+12+%28Mac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dwarth","files":1,"time":1375286835,"description":"= Theft and Contraband\nMany rooms around a prison are now a source of dangerous contraband\nPrisoners will sometimes steal contraband and try to smuggle it back to their cell for safe keeping\nPrisoners are less likely to steal metal items if they know they have to pass through a metal detector on their way back\nPrisoners carrying metal items will avoid Metal Detectors as best they can\nThere are four categories of contraband:\n- Weapons: Used during fights. A high &quot;Danger Level&quot; within your prison will drive a high demand for weapons\n- Tools: (Eventually) Used by prisoners to assist escaping\n- Narcotics: (Eventually) Used by prisoners who are bored or uncomfortable, or dealing with addiction\n- Luxuries: Items that make prison life a bit more bearable, such as mobile phones, alchohol etc\n\nNote: Prisoners currently only make use of Weapons, but they will still steal the other types of contraband\n\n= Contraband overlay\nThere is a new Contraband overlay in the main toolbar, unlocked by the Chief in Bureaucracy\nShows all potential sources of contraband within your prison, and also all recently found contraband\nYou can select any recently found item to see a trail of where it was stolen from, where it was hidden etc\n\n= Contraband Supply and Demand\nYou can see the market demand for any item in the new Contraband Report. High demand means many prisoners want this item\nThis screen also shows the supply of these items, representing how many of those items are owned by the prisoners\nPrisoners who want something they can't get will steal an item with high market value instead, so they can trade for it later\n\n= Searching powers\nYou can now order a search of a prisoner or his entire cell, from his Rap Sheet\nThere is a new emergency button on the toolbar: Shakedown, which searches every cell and prisoner in your jail\nNote: Searching prisoners really pisses them off, raising the danger level of your prison\nMetal Detectors automatically trigger a search of a prisoner when they detect something\nMetal Detectors now fall out of action for 3 seconds after detecting something\nThey also incorrectly detect something a small percentage of the time, resulting in unnecesary searches\n\n= Status Effects\nAll prisoners can now be affected by Status Effects, which change their behavior for a fixed period of time\nYou can see status effects on a prisoner by highlighting him.\nCurrent status effects:\n- Suppressed: Prisoners locked in Solitary Confinement will become suppressed and compliant due to their harsh treatment.\nThese suppressed prisoners are much less likely to cause trouble.\n- Well Fed: Prisoners who eat well will become &quot;well fed&quot;, contributing to the good feeling in the prison.\nWell fed prisoners are much less likely to cause trouble.\n\n= Needs System\n- Extensive performance improvements \n- The needs system was one of the slowest and most laggy parts of the game\n- Fixed: Prisoners sometimes can't find any need providers if the framerate is too low, and just stand around instead\n\n- Prisoners due for release within the next six hours are now listed on your todo list\n\n- New audio work for the Bureaucracy screen and the Reports windows, and new searching powers\n\n- Changed the way Guards follow patrols, so they should no longer clump together\n\n- Contraband found by guards is still dropped on the floor, but will now auto-vanish after 10 seconds \n\n- Fixed: Released prisoners are now permitted to route through Staff-Only zones on their way out\n\n- Fixed: Sometimes garbage would never be collected\n\n- Fixed: Callout units will now show their assigned route even when off screen\n\n- Fixed: Drains will no longer block doors from closing\n\n- Fixed: The time buttons on the clock will now highlight the currently selected speed correctly\t","torrent":{"xt":"urn:btih:f20d244efaac6fad97346e070fbe6dd2c8ac4dda","amp;dn":"Prison+Architect+-+Alpha+12+%28Mac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f20d244efaac6fad97346e070fbe6dd2c8ac4dda","infoHashBuffer":{"type":"Buffer","data":[242,13,36,78,250,172,111,173,151,52,110,7,15,190,109,210,200,172,77,218]},"announce":[],"urlList":[]}}