{"title":"Zoo Story- Life In The Garden Of Captives by Thomas French","uid":10692317,"size":3486291,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f217b1b28722bc3ccbc134e8b472f6045be6f1b0&amp;dn=Zoo+Story-+Life+In+The+Garden+Of+Captives+by+Thomas+French&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gratefuldawg77","files":5,"time":1407133975,"description":"Welcome to the savage and surprising world of Zoo Story, an unprecedented account of the secret life of a zoo and its inhabitants, both animal and human. Based on six years of research, the book follows a handful of unforgettable characters at Tampa's Lowry Park Zoo: an alpha chimp with a weakness for blondes, a ferocious tiger who revels in Obsession perfume, and a brilliant but tyrannical CEO known as El Diablo Blanco. Zoo Story crackles with issues of global urgency: the shadow of extinction, humanity's role in the destruction or survival of other species. More than anything else, though, it's a dramatic and moving true story of seduction and betrayal, exile and loss, and the limits of freedom on an overcrowded planet--all framed inside one zoo reinventing itself for the twenty-first century. Thomas French, a Pulitzer Prize-winning reporter, chronicles the action with vivid power: Wild elephants soaring above the Atlantic on their way to captivity. Predators circling each other in a lethal mating dance. Primates plotting the overthrow of their king. The sweeping narrative takes the reader from the African savannah to the forests of Panama and deep into the inner workings of a place some describe as a sanctuary and others condemn as a prison. All of it comes to life in the book's four-legged characters. Even animal lovers will be startled by the emotional charge of these creatures' histories, which read as though they were co-written by Dickens and Darwin. Zoo Story shows us how these remarkable individuals live, how some die, and what their experiences reveal about the human desire to both exalt and control nature.","torrent":{"xt":"urn:btih:f217b1b28722bc3ccbc134e8b472f6045be6f1b0","amp;dn":"Zoo+Story-+Life+In+The+Garden+Of+Captives+by+Thomas+French","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f217b1b28722bc3ccbc134e8b472f6045be6f1b0","infoHashBuffer":{"type":"Buffer","data":[242,23,177,178,135,34,188,60,203,193,52,232,180,114,246,4,91,230,241,176]},"announce":[],"urlList":[]}}