{"title":"Smugglers V (Latest Version) (GOG)","uid":10447066,"size":82197902,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f2765da9e61ad800e0add23acb78022ff7a7699c&amp;dn=Smugglers+V+%28Latest+Version%29+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sarah116","files":-1,"time":1403977546,"description":"Hey, here the latest version of &quot;Smugglers V&quot;. Hope you enjoy and please help seed.\n\n\n-----------------\n\n\nSmugglers V (1.3c Patch Notes)\n\n\n- Added feature: The historic quotes for the new combat skills have been \ncompleted. These were wrongly labeled as missing and &quot;early access&quot;, \nbecause of their origin as being a new feature of Smugglers 5: Invasion \n(the stand-alone expansion, which is in early access). \n\n- Bug fixed: The option called &quot;fullscreen mode&quot; that switched your \nscreen resolution has been removed. With the introduction of the \nincreased native screen resolution this has become unnecessary and was \nincompatible to the new system. This was the reason for the bug report \nof an error message at startup. \n\n- Bug fixed: An additional precaution has been included that should \nprevent wrongly issued &quot;missing file&quot; errors at the beginning of ship to \nship combat. \n\n\n------------------\n\n &lt;a href=&quot;\nhttp://www.gog.com/game/smugglers_v&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gog.com/game/smugglers_v&lt;/a&gt;\n\n\n- Explore a dynamic universe by trading, fighting, managing a crew and factories, boarding ships, and plundering planets\n\n- 80,000 words of new and dynamic short stories plus a non-linear campaign\n4 factions, 6 professions with 100+ different skills, 30+ spaceships ranging from fighters to battleships, cruise missiles and star bases\n\n- You can start and rule your own star empire or perform a hostile takeover of a pirate base!\n\n\nThe galaxy is at war - the Federation, the Coalition, the Outer Rim systems and the criminal Syndicate battle for control. It's a dangerous life for a pilot on the front lines, but it can also be a lucrative one - are you an honest trader, or does smuggling illegal goods sound more profitable? Will you join the war effort for your faction, set up your own empire, or simply explore the galaxy?\n\nThe fifth installment in the long-running Smugglers series features a completely revised turn-based combat system and a range of new ships to fly, as well as a host of exciting features.\n","torrent":{"xt":"urn:btih:f2765da9e61ad800e0add23acb78022ff7a7699c","amp;dn":"Smugglers+V+%28Latest+Version%29+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2765da9e61ad800e0add23acb78022ff7a7699c","infoHashBuffer":{"type":"Buffer","data":[242,118,93,169,230,26,216,0,224,173,210,58,203,120,2,47,247,167,105,156]},"announce":[],"urlList":[]}}