{"title":"H264 WebCam Pro 2.38","uid":4074968,"size":3627210,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f2d3f6fd9268e44a85e5e811281ac59bf16ca4e2&amp;dn=H264+WebCam+Pro+2.38&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wonderboy52","files":1,"time":1205255475,"description":"H264 WebCam Pro is a 16-channel h264 remote video surveillance software for Windows. This software has unique H264 User Name mode to manage dynamic ip address on internet. It has advanced video motion detection algorithm, various alert functions including Email, FTP, and sound. It can handle up to 16-channels video input and 16-channels of audio input, captures images up to 30 frames per second from USB and analog cameras, TV boards, capture cards etc. It uses H264 video encoder and AAC audio encoder etc, high quality video and audio effect with a low bandwidth, record file format may be MP4, MOV, FLV, SWF or AVI. The files can played with Windows Media Player or Real Player etc. Manual recording is available, along with scheduled recordings or motion-triggered recording. JPEG image snapshots can be made from video images, and detailed log files and help files are available. Other features include secure Login with a valid user ID and password from Net, automatically restore Net connection. This software has features of both digital video recorder and digital video server, and can work as a stand-alone product or be used to build a powerful surveillance network.","torrent":{"xt":"urn:btih:f2d3f6fd9268e44a85e5e811281ac59bf16ca4e2","amp;dn":"H264+WebCam+Pro+2.38","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2d3f6fd9268e44a85e5e811281ac59bf16ca4e2","infoHashBuffer":{"type":"Buffer","data":[242,211,246,253,146,104,228,74,133,229,232,17,40,26,197,155,241,108,164,226]},"announce":[],"urlList":[]}}