{"title":"The Creation of Anne Boleyn  (Unabridged)","uid":12089819,"size":347088087,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f2f644a39960dd1df91fa8df6460ae50ab30eadf&amp;dn=The+Creation+of+Anne+Boleyn++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"davieboy1966","files":16,"time":1436007643,"description":"Written by Susan Bordo\nRead by Barbara Rosenblat\nFormat: MP3\nUnabridged\n\nA groundbreaking retelling and reclaiming of Anne Boleyn's life and legacy puts old questions to rest and raises some surprising new ones.\n\nPart biography, part cultural history, The Creation of Anne Boleyn is a fascinating reconstruction of Anne's life and an illuminating look at her afterlife in the popular imagination. Why is Anne so compelling? Why has she inspired such extreme reactions? What did she really look like? Was she the flaxen-haired martyr of Romantic paintings or the raven-haired seductress of twenty-first century portrayals? (Answer: neither.) And perhaps the most provocative questions concern Anne's death more than her life. How could Henry order the execution of a once beloved wife? Drawing on scholarship and critical analysis, Susan Bordo probes the complexities of one of history's most infamous relationships.\n\nBordo also shows how generations of polemicists, biographers, novelists, and filmmakers imagined and reimagined Anne: whore, martyr, cautionary tale, proto-&quot;mean girl,&quot; feminist icon, and everything in between. In this lively book, Bordo steps off the well-trodden paths of Tudoriana to expertly tease out the human being behind the competing mythologies.\n\nLength: 12 hrs and 4 mins \n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:f2f644a39960dd1df91fa8df6460ae50ab30eadf","amp;dn":"The+Creation+of+Anne+Boleyn++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2f644a39960dd1df91fa8df6460ae50ab30eadf","infoHashBuffer":{"type":"Buffer","data":[242,246,68,163,153,96,221,29,249,31,168,223,100,96,174,80,171,48,234,223]},"announce":[],"urlList":[]}}