{"title":"Coogan-Money Creators-Who Creates Money-Who Should(1935)","uid":4537815,"size":589508,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f3a93bd19b5e508fe301600dcf5958f60cabb853&amp;dn=Coogan-Money+Creators-Who+Creates+Money-Who+Should%281935%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227809106,"description":"This Gertrude M. Coogan&amp;#039;s amazing book Money Creators - Who Creates Money? - Who Should Create It? (1935) which vividly explains the difference between an honest money system and the unlawful debt money system the world is saddled with. The author understood money systems and knew what a debt money system would do, because it has already done it to all of us. Do you want money made honest for you by the National Government or kept &amp;#039;sound&amp;#039; for the Money Creators by mis-government? Do you want U.S. dollars in sufficient number to the keep the &amp;#039;wolves of depression&amp;#039; from your door or do you want dollars in such overwhelming numbers to deprive them of &amp;#039;ALL&amp;#039; value as the Money Creators have done in other countries? The reader will ask, &quot;Why have not business leaders known that our money system is dishonest...?&quot; This book written in 1935 nearing the end of the world wide Great Depression contains sound advice for Americans and the U.S. Government. The US government has abrogated its responsibility and empowered the Money Creators to continue the financial, banking, and money system fraud against the citizens of the country. The day of reckoning may be close, yet possibly still time to reverse the fraud by carefully returning to the common sense rules of finance given by this author. 175 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:f3a93bd19b5e508fe301600dcf5958f60cabb853","amp;dn":"Coogan-Money+Creators-Who+Creates+Money-Who+Should%281935%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3a93bd19b5e508fe301600dcf5958f60cabb853","infoHashBuffer":{"type":"Buffer","data":[243,169,59,209,155,94,80,143,227,1,96,13,207,89,88,246,12,171,184,83]},"announce":[],"urlList":[]}}