{"title":"Mortification - 1998 Miracle Tour.mp4","uid":9673436,"size":657882413,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f3cf694a53dc11eb3ec3a9a7918d54d8960b8eb7&amp;dn=Mortification+-+1998+Miracle+Tour.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"godrulz","files":1,"time":1393514713,"description":"Yep, THIS IS THE MIRACLE TOUR FOR SURE! This concert in Dallas Texas was performed just 5 months after I was given 2 hours to live the 2nd time. In April 1998 I woke up an L1 paraplegic &amp; could not feel anything below the knees. I was told I would possibly never walk again. We had Recorded Triumph Of Mercy in the January &amp; I must have sent a Nuclear Blast CD to Metal Blade Records USA in March? I cannot remember! Anyway, when I was wheelchair bound, couldn't walk &amp; weighed just 90 pounds I got a phone call from Bill Metoyer at Metal Blade Records that I took at the Nurses Station in the Caulfield Rehabilitation Hospital where I lived for 3 months May, June &amp; July 1998 &amp; pushed my body till it walked again, even with my spine disconnected in the Lumbar 1. Metal Blade wanted to sign Triumph Of Mercy &amp; Mortification for 3 Albums &amp; Bill asked when we could next Tour The USA. I said &quot;August&quot;. Then I had 3 months to get walking! But as you can see, even though I was back up to 54 kilograms or about 125 pounds I was still very skinny &amp; uneasy on my feet. My Life's Story/ Biography is well on the way &amp; should be out early 2015. My Australian Manager Vic Campbell is penning the story &amp; is an incredible writer! MIRACLES STILL HAPPEN BECAUSE MY GOD IS THE GOD OF MIRACLES!! Steve.","torrent":{"xt":"urn:btih:f3cf694a53dc11eb3ec3a9a7918d54d8960b8eb7","amp;dn":"Mortification+-+1998+Miracle+Tour.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3cf694a53dc11eb3ec3a9a7918d54d8960b8eb7","infoHashBuffer":{"type":"Buffer","data":[243,207,105,74,83,220,17,235,62,195,169,167,145,141,84,216,150,11,142,183]},"announce":[],"urlList":[]}}