{"title":"Why Motivating People Doesn't Work . . . and What Does: The New","uid":12957142,"size":3008403,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f4dbbbc3593712862384de70c9a83994cf76b242&amp;dn=Why+Motivating+People+Doesn%27t+Work+.+.+.+and+What+Does%3A+The+New+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TopShelfBook","files":3,"time":1449797359,"description":"Why Motivating People Doesn't Work . . . and What Does: The New Science of Leading, Energizing, and Engaging\r\n\r\nTop leadership researcher, consultant, and coach Susan Fowler says stop trying to motivate people! It's frustrating for everyone involved and it just doesn't work. You can't motivate people—they are already motivated but generally in superficial and short-term ways. In this book, Fowler builds upon the latest scientific research on the nature of human motivation to lay out a tested model and course of action that will help leaders guide their people toward the kind of motivation that not only increases productivity and engagement but that gives them a profound sense of purpose and fulfillment.\r\n\r\nFowler argues that leaders still depend on traditional carrot-and-stick techniques because they haven't understood their alternatives and don't know what skills are necessary to apply the new science of motivation. Her Optimal Motivation process shows leaders how to move people away from dependence on external rewards and help them discover how their jobs can meet the deeper psychological needs—for autonomy, relatedness, and competence—that science tells us result in meaningful and sustainable motivation. \r\n\r\nOptimal Motivation has been proven in organizations all over the world—Fowler's clients include Microsoft, CVS, NASA, the Catholic Leadership Institute, H&amp;R Block, Mattel, and dozens more. Throughout the book, she illustrates how each step of the process works using real-life examples. Susan Fowler 's book is the groundbreaking answer for leaders who want to get motivation right!\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:f4dbbbc3593712862384de70c9a83994cf76b242","amp;dn":"Why+Motivating+People+Doesn%27t+Work+.+.+.+and+What+Does%3A+The+New+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4dbbbc3593712862384de70c9a83994cf76b242","infoHashBuffer":{"type":"Buffer","data":[244,219,187,195,89,55,18,134,35,132,222,112,201,168,57,148,207,118,178,66]},"announce":[],"urlList":[]}}