{"title":"Artificial Muscles - Applications of Advanced Polymeric Nanocomp","uid":14532315,"size":13529216,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f533adef3c4daaae8aae66046ea7a50b28aa1a85&amp;dn=Artificial+Muscles+-+Applications+of+Advanced+Polymeric+Nanocomp&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1462456458,"description":"Artificial Muscles - Applications of Advanced Polymeric Nanocomposites - Mohsen Shahinpoor et al. (CRC, 2007).pdf\r\n\r\nISBN 978-1-58488-713-3\r\n\r\nSmart materials are the way of the future in a variety of fields, from biomedical engineering and chemistry to nanoscience, nanotechnology, and robotics. Featuring an interdisciplinary approach to smart materials and structures, Artificial Muscles: Applications of Advanced Polymeric Nanocomposites thoroughly reviews the existing knowledge of ionic polymeric conductor nanocomposites (IPCNCs), including ionic polymeric metal nanocomposites (IPMNCs) as biomimetic distributed nanosensors, nanoactuators, nanotransducers, nanorobots, artificial muscles, and electrically controllable intelligent polymeric network structures.\r\n\r\nAuthored by one of the founding fathers of the field, the book introduces fabrication and manufacturing methods of several electrically and chemically active ionic polymeric sensors, actuators, and artificial muscles, as well as a new class of electrically active polymeric nanocomposites and artificial muscles. It also describes a few apparatuses for modeling and testing various artificial muscles to show the viability of chemoactive and electroactive muscles. The authors present the theories, modeling, and numerical simulations of ionic polymeric artificial muscles’ electrodynamics and chemodynamics. In addition, they feature current industrial and medical applications of IPMNCs.\r\n\r\nBy covering the fabrication techniques of and novel developments in advanced polymeric nanocomposites, this book provides a solid foundation in the subject while stimulating further research","torrent":{"xt":"urn:btih:f533adef3c4daaae8aae66046ea7a50b28aa1a85","amp;dn":"Artificial+Muscles+-+Applications+of+Advanced+Polymeric+Nanocomp","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f533adef3c4daaae8aae66046ea7a50b28aa1a85","infoHashBuffer":{"type":"Buffer","data":[245,51,173,239,60,77,170,174,138,174,102,4,110,167,165,11,40,170,26,133]},"announce":[],"urlList":[]}}