{"title":"Adguard for Android (v2.1.240) [Multi] (2015)","uid":12632537,"size":5346516,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:f5827311e0f309e6f71d896df3cf3a6d25b02897&amp;dn=Adguard+for+Android+%28v2.1.240%29+%5BMulti%5D+%282015%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Woitler","files":1,"time":1445871385,"description":"Application Name: Adguard\r\nPlatform: Android\r\nApplication Type: Web Filter, Anti-Banner, Anti-Phishing, Firewall and etc.\r\nRelease Date: October 26, 2015\r\nApplication Version: 2.1.240\r\nLanguage: English, German, Chinese, Japanese, French, Russian and etc.\r\nSystem requirements: Android 4.0.3 and higher\r\nType Installer: APK\r\nFile size: 5.09 MB\r\n----------------------------------------------------\r\nDescription\r\nAdguard - is a unique internet filter that protects you from the ubiquitous advertising, malware, and phishing sites, online tracking and more.\r\nAdguard is really cope with all kinds of completely blocking Internet advertising, pages load faster with it, it saves bandwidth and increase the protection of your device against possible threats. Adguard uses a unique technology that allows you to filter the traffic of your device, which does not require ROOT-law. The speed of the filter will not be affected by the work VPN-server, because it is located right on your device.\r\n----------------------------------------------------\r\nFunctionality\r\n1. The application does not require ROOT rights, which means that it can be used perfectly on any device;\r\n2. Adguard - the first application for Android with high quality filtration;\r\n3. Adguard able to block all kinds of advertising. Seriously, everything;\r\n4. The application is really simple, usable and intuitive;\r\n5. Protection against malware and phishing sites. Adguard prohibit downloading potentially dangerous applications and files, and will not allow you to become a victim of fraud;\r\n6. Blocking is not only in the browser, but also in games and applications!;\r\n7. The application speeds up the loading of web pages. Without further elements they open faster;\r\n8. Protection of personal data. Adguard ban tracking your online activities;\r\n9. Adguard - program, widely recognized in the world. More than 6 million people from different countries use version for Windows. And Adguard application for Android works perfectly well.\r\n----------------------------------------------------\r\nWhat's new in version 2.1.240?\r\n1. Multiple improvements in our TCP stack implementation.\r\n2. Moved firewall icons-cache to Cache folder to be able to clear it from app settings.\r\n3. Fixed unnecessary restart of protection in Proxy mode.\r\n4. Proxy mode: DNS cache is now flushed on network reconnect.\r\n5. Multiple GUI improvement in Low-Level Settings.\r\n6. Optimized Pcap functionality in Low-Level Settings.\r\n7. Update channel options are hidden for Amazon builds.\r\n8. Fixed handling of HTTP CONNECT requests without Host header.\r\n9. Small UI fix on Send Feedback screen.\r\n10. Added new localizations: Czech, French, Turkish, Serbian, Spanish","torrent":{"xt":"urn:btih:f5827311e0f309e6f71d896df3cf3a6d25b02897","amp;dn":"Adguard+for+Android+%28v2.1.240%29+%5BMulti%5D+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5827311e0f309e6f71d896df3cf3a6d25b02897","infoHashBuffer":{"type":"Buffer","data":[245,130,115,17,224,243,9,230,247,29,137,109,243,207,58,109,37,176,40,151]},"announce":[],"urlList":[]}}