{"title":"Dr.Web CureIt! 6.00.15 (2012) [Multilengual]","uid":6997721,"size":77655312,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f61424c21450e6a6effc44c85d3700427e6dbe6c&amp;dn=Dr.Web+CureIt%21+6.00.15+%282012%29+%5BMultilengual%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":-1,"time":1327945824,"description":"Dr.Web CureIt! 6.00.15 (2012) [Multilengual]\n &lt;a href=&quot;\nhttp://www.freedrweb.com/cureit/?lng=en&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freedrweb.com/cureit/?lng=en&lt;/a&gt;\n\nEnglish:\n---------\nVersion: 6.00.15.01170 (28.01.2012 06:40)\nOC: Windows 2000/XP/2003/Vista/7\nInterface: Multilingual\nStatus: Free\nFile Size: 74.05 Mb\n\nWe offer you a free virus scanner based on the Dr.Web - Dr.Web CureIt!. This utility is designed to detect and remove viruses and spyware. All that you need is to download it and press the &quot;Start&quot;, then start checking the entire company.\n\nUtility Dr.Web CureIt! - Detects and removes mail and network worms, file viruses, Trojans, stealth viruses, polymorphic, disembodied and macro viruses, infecting documents MS Office, script viruses, spyware (Spyware), programs, Password stealers, dialer , adware (Adware), keylogger, potentially dangerous and any other unwanted code.\n\n1. Does not provide protection in real time.\n2. The program does not include the module automatically updates the virus database, so in order to scan your computer the next time with the latest updates of virus database, you will have to download Dr.Web CureIt!\nDr.Web CureIt! Setup does not ask, do not conflict with any antivirus software, which\nThis means that at the time of scanning did not want to disable antivirus installed another manufacturer.\nDr.Web CureIt! has an unrivaled self-defense and enhanced mode for running anti-blocker Windows.\nDr.Web CureIt! automatically delineates the language of the OS (in the case, rather than the local language is not supported, set the English language). It is also very much want to highlight what is currently utility supports 34 languages.\n\nEspaÃƒÂ±ol:\n--------\nVersiÃƒÂ³n: 6.00.15.01170 (28.01.2012 06:40)\nOC: Windows 2000/XP/2003/Vista/7\nInterfaz: multilenguaje incluido espaÃƒÂ±ol\nEstado: Libre\nTamaÃƒÂ±o del archivo: 74,05 Mb\n\nLe ofrecemos un programa antivirus gratuito basado en el Dr.Web - Dr.Web CureIt!. Esta utilidad estÃƒÂ¡ diseÃƒÂ±ada para detectar y eliminar virus y spyware. Todo lo que necesitas es descargarlo y pulse el botÃƒÂ³n &quot;Inicio&quot;, luego iniciarÃƒÂ¡ la verificaciÃƒÂ³n de toda la empresa.\n\nUtilidad de Dr.Web CureIt! - Detecta y elimina los gusanos de correo y de red, los virus de archivo, troyanos, virus Stealth, virus polimÃƒÂ³rficos, sin cuerpo y macro, infecta documentos de MS Office, virus de script, los programas espÃƒÂ­a (spyware), programas, ladrones de contraseÃƒÂ±as, marcador , adware (Adware), keylogger, potencialmente peligrosos y cualquier otro cÃƒÂ³digo no deseado.\n\n1. No ofrece protecciÃƒÂ³n en tiempo real.\n2. El programa no incluye el mÃƒÂ³dulo actualiza automÃƒÂ¡ticamente la base de datos de virus, por lo que con el fin de analizar el equipo la prÃƒÂ³xima vez que con las ÃƒÂºltimas actualizaciones de la base de datos de virus, tendrÃƒÂ¡ que descargar Dr.Web CureIt!\nDr.Web CureIt! Programa de instalaciÃƒÂ³n no preguntes, no entrar en conflicto con el software antivirus, que\nEsto significa que en el momento de la exploraciÃƒÂ³n no se desea desactivar antivirus instalado otro fabricante.\nDr.Web CureIt! tiene un modo sin igual de legÃƒÂ­tima defensa y mejora para el funcionamiento de anti-bloqueo de Windows.\nDr.Web CureIt! automÃƒÂ¡ticamente delinea el idioma del sistema operativo (en el caso, en lugar de en el idioma local no es compatible, el idioma InglÃƒÂ©s). TambiÃƒÂ©n es mucho lo que quiero destacar es que actualmente utilidad es compatible con 34 idiomas.\n\n","torrent":{"xt":"urn:btih:f61424c21450e6a6effc44c85d3700427e6dbe6c","amp;dn":"Dr.Web+CureIt%21+6.00.15+%282012%29+%5BMultilengual%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f61424c21450e6a6effc44c85d3700427e6dbe6c","infoHashBuffer":{"type":"Buffer","data":[246,20,36,194,20,80,230,166,239,252,68,200,93,55,0,66,126,109,190,108]},"announce":[],"urlList":[]}}