{"title":"Doctor Strangelove (Collectors Edition) [DVD] [2002]","uid":6569431,"size":11525849088,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f61acac3dec7527a17f8e4918e4f04f97acd3e7a&amp;dn=Doctor+Strangelove+%28Collectors+Edition%29+%5BDVD%5D+%5B2002%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hoofdkussen","files":-1,"time":1311877285,"description":"www. Norskbits .com - Last ned Filmer, TV-serier, Spill, Program og Musikk http://www.norskbits.com\n\nCheck :: http://www.norskbits.com :: for more of my torrents, and the rest of the Kubrick collection!\n\nActors: Sterling Hayden, Slim Pickens, Peter Sellers, James Earl Jones, Peter Bull\nDirectors: Stanley Kubrick\nProducers: Stanley Kubrick\nFormat: Subtitled, PAL\nLanguage English\nSubtitles: Arabic, English, French, Hindi\nRegion: Region 2 (This DVD may not be viewable outside Europe. Read more about DVD formats.)\nAspect Ratio: 16:9 - 1.66:1\nNumber of discs: 2\nClassification: PG\nStudio: Sony Pictures Home Entertainment\nDVD Release Date: 18 Feb 2002\nRun Time: 91 minutes\nAverage Customer Review: 4.6 out of 5 stars  See all reviews (48 customer reviews)\nASIN: B000053W4Z\nAmazon Bestsellers Rank: 1,398 in Film &amp; TV (See Top 100 in Film &amp; TV)\n#9 in Film &amp; TV &gt; Classics &gt; Comedy\n#54 in Film &amp; TV &gt; Drama &gt; Comedy\n\nAmazon.co.uk Review\nArguably the greatest black comedy ever made, Stanley Kubrick's cold war classic is the ultimate satire of the nuclear age. Dr Strangelove or How I Learned to Stop Worrying and Love the Bomb, to give it its full title, is a perfect spoof of political and military insanity, beginning when General Jack D Ripper (Sterling Hayden), a maniacal warrior obsessed with &quot;the purity of precious bodily fluids&quot;, mounts his singular campaign against Communism by ordering a squadron of B-52 bombers to attack the Soviet Union. The Soviets counter the threat with a so-called &quot;Doomsday Device,&quot; and the world hangs in the balance while the US president (Peter Sellers) engages in hilarious hot-line negotiations with his Soviet counterpart. Sellers also plays a British military attachÃƒÂ© and the mad scientist Dr Strangelove; George C Scott is outrageously frantic as General Buck Turgidson, whose presidential advice consists mainly of panic and statistics about &quot;acceptable losses&quot;. With dialogue (&quot;You can't fight here! This is the war room!&quot;) and images (Slim Pickens's character riding the bomb to oblivion) that have become a part of our cultural vocabulary, Kubrick's film regularly appears on critics' lists of the all-time best. --Jeff Shannon, Amazon.com\nDVD Description\nStanley Kubrick's classic black comedy about a group of war-eager military men who plan a nuclear apocalypse is both funny and frightening - and seems as relevant today as ever. Through a series of military and political accidents, two psychotic generals - U.S. Air Force Commander Jack D. Ripper (Sterling Hayden) and Joint Chief of Staff &quot;Buck&quot; Turgidson (George C. Scott) trigger an ingenious, irrevocable scheme to attack Russia's strategic targets with nuclear bombs. The brains behind the scheme belong to Dr. Strangelove (Peter Sellers), a wheelchair-bound nuclear scientist who has bizarre ideas about man's future. The president (also Sellers) is helpless to stop the bombers, as is Captain Mandrake (Sellers once again). Dr. Strangelove is truly a brilliant film classic.\n\n\nwww. Norskbits .com - Last ned Filmer, TV-serier, Spill, Program og Musikk http://www.norskbits.com\n\nCheck :: http://www.norskbits.com :: for more of my torrents, and the rest of the Kubrick collection!","torrent":{"xt":"urn:btih:f61acac3dec7527a17f8e4918e4f04f97acd3e7a","amp;dn":"Doctor+Strangelove+%28Collectors+Edition%29+%5BDVD%5D+%5B2002%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f61acac3dec7527a17f8e4918e4f04f97acd3e7a","infoHashBuffer":{"type":"Buffer","data":[246,26,202,195,222,199,82,122,23,248,228,145,142,79,4,249,122,205,62,122]},"announce":[],"urlList":[]}}