{"title":"Under The Dome Episode 8 (720p)","uid":10726356,"size":302009931,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:f66a059ab01e5ff8c71bd8249b3a8c2d6f311c61&amp;dn=Under+The+Dome+Episode+8+%28720p%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shareregi","files":2,"time":1407567360,"description":"At night, Junior comes home but Big Jim points a gun at him and tells him to leave. The next morning, Big Jim confronts Ollie and gets Barbie, Linda, Junior and Carter to take the well from Ollie. But about ten guys with guns appear and Carter is shot. Junior betrays his father and joins Ollie's side. As Jim is rounding up volunteers to attack Ollie's farm, Barbie and Linda plan to blow up the well so that the other well's water will return. Barbie then tries to get Big Jim's approval but he denies it. Meanwhile, Norrie blames Joe for her mother's death and breaks up with him. Joe then tells Julia about the mini-dome and the egg and both go to see it. But this time the egg is pink and when Julia touches the dome, she sees another Joe who says, &quot;The monarch will be crowned.&quot; Joe then thinks that something bad will happen to him. Junior finds out from Ollie that his mother did not die from a car accident but from suicide. Junior then asks Ollie not to kill Jim because he wants to. Before Big Jim and the volunteers attack, Barbie infiltrates Ollie's farm, creates a homemade bomb, and sticks it to the well. At night, Big Jim, Linda, Phil, and the rest attack the farm. Jim then realizes that Barbie is going to go ahead with bombing Ollie's well. In the ensuing battle, Phil and some other people are shot and killed except for Phil who received a gunshot wound to his shoulder. Right before Barbie detonates the bomb, he is caught but escapes and destroys the well. While everyone realizes that the well has been destroyed, Junior appears and knocks Jim out with his gun. As Joe and Julia are exiting the forest and into the street, Linda almost hits Joe while she drives Phil to the hospital. Linda then reassures Joe that he will be fine. Angie and Norrie bond and she talks Norrie into getting back together with Joe. Norrie then tells Joe that she is ready to bury Alice. Big Jim is dragged into Ollie's living room and Ollie's men leave saying that they no longer need his water. Ollie then gives permission for Junior to kill Big Jim but instead, Junior asks Jim questions about his mother. When Junior starts to get soft, Ollie pulls out a gun and aims it at Jim but Junior shoots and kills Ollie. Big Jim and Junior then reconcile before parting ways. Big Jim is confronted by Barbie. At the police station, Linda is surprised to see Junior back and he tells her what happened. He says that he no longer has a home, and that he will now live in the cell. At Julia's house, Julia asks Barbie if he knows what the other Joe meant but he says no. It is then hinted that Angie may also be connected to the dome as evidenced by the camera panning across her shoulder blade to show a tattoo of a butterfly.","torrent":{"xt":"urn:btih:f66a059ab01e5ff8c71bd8249b3a8c2d6f311c61","amp;dn":"Under+The+Dome+Episode+8+%28720p%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f66a059ab01e5ff8c71bd8249b3a8c2d6f311c61","infoHashBuffer":{"type":"Buffer","data":[246,106,5,154,176,30,95,248,199,27,216,36,155,58,140,45,111,49,28,97]},"announce":[],"urlList":[]}}