{"title":"Junkyard - Tried And True [2003][320 KBPS]","uid":8638681,"size":60289363,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f68d2397022a7bb7bc9bf69c5f90f682071cfbff&amp;dn=Junkyard+-+Tried+And+True+%5B2003%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LameDuck69","files":10,"time":1372820293,"description":"Junkyard - Tried And True [2003]\n\n\n\n\n\n01 Fight\n02 Waste Of Time\n03 Tried And True\n04 Old #4\n05 Simple Man\n06 Holdin' On\n\n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nJunkyard is a hard rock/sleaze rock band formed in 1987 in Los Angeles, but they claim to be straight of Austin TX, with members formerly in Minor Threat, The Necros, and Dag Nasty.The band has often drawn comparisons with Guns N' Roses (which, like Junkyard, signed with Geffen Records).\n\nThe original line-up of the band was not David Roach, Chris Gates, Clay Anthony, and Patrick Muzingo. Max Gottlieb was an original guitarist and song writer and Johnny Hell was the original drummer. Currently, only one member of the band is original. Brian Baker (guitar, ex-Dag Nasty/Minor Threat), joined the band just prior to the recording of the first album. Although the band was heavily influenced by Southern rock, Baker had told Sounds, &quot;I hate the concept. I like that music but I'm not into the rebel flag or the throwing up in your pickup truck&quot;. The band was signed by Geffen Records in January 1988, with a self-titled Tom Werman-produced debut album issued in 1989, described by Allmusic as incorporating &quot;elements of Southern rock, boogie-woogie, and AC/DCism into one compact sound&quot;, this was followed two years later by Sixes Sevens &amp; Nines, produced by Ed sium and featuring contributions from Steve Earle. Anthony left the band shortly before the release of the second album amid drug problems, to be replaced by Todd Muscat.[4] The band was dropped by Geffen in 1992, with a third album recorded but not released, and disbanded shortly afterwards. The unreleased third album was subsequently issued as XXX and The Joker.\n\nRoach founded Borracho with members of Promise and Dogs D'Amour, while Gates formed 99 lbs. Muzingo formed Catfish and later Battery Club.\n\nA live album was issued in 2000, and Gates, Roach, Muzingo and Muscat reformed the band, with Tim Mosher (guitar/vocals) added to the line-up. A tour of Japan followed, with Dogs D'Amour guitarist Jo Dog added to the line-up for these dates. The new line-up recorded the 2003 mini-album Tried and True, comprising a mixture of old and new songs.\n\nIn 2008, the band released an album of previously unreleased material, originally recorded for a 1987 demo that helped get them signed to Geffen. The album is titled Put it on Ten and Pull the Knobs Off!.\n\nAlthough the band members have different ongoing projects, Junkyard is still together and are to play at the Rock Gone Wild event in 2009.\n\n\n","torrent":{"xt":"urn:btih:f68d2397022a7bb7bc9bf69c5f90f682071cfbff","amp;dn":"Junkyard+-+Tried+And+True+%5B2003%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f68d2397022a7bb7bc9bf69c5f90f682071cfbff","infoHashBuffer":{"type":"Buffer","data":[246,141,35,151,2,42,123,183,188,155,246,156,95,144,246,130,7,28,251,255]},"announce":[],"urlList":[]}}