{"title":"[Repost] Instant - The story of Polaroid - Christopher Bonanos [","uid":7912404,"size":31526594,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6ba94a906afd16a6b87606a61aa073d9598035d&amp;dn=%5BRepost%5D+Instant+-+The+story+of+Polaroid+-+Christopher+Bonanos+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KatQwerty","files":3,"time":1355251217,"description":"&quot;Instant photography at the push of a button!&quot; During the 1960s and '70s, Polaroid was the coolest technology company on earth. Like Apple, it was an innovation machine that cranked out one must-have product after another. Led by its own visionary genius founder, Edwin Land, Polaroid grew from a 1937 garage start-up into a billion-dollar pop-culture phenomenon. Instant tells the remarkable tale of Land's one-of-a-kind invention-from Polaroid's first instant camera to hit the market in 1948, to its meteoric rise in popularity and adoption by artists such as Ansel Adams, Andy Warhol, and Chuck Close, to the company's dramatic decline into bankruptcy in the late '90s and its unlikely resurrection in the digital age. Instant is both an inspiring tale of American ingenuity and a cautionary business tale about the perils of companies that lose their creative edge.\n\n\n\n&quot;Instant: The Story of Polaroid clocks in at a slim 192 pages, but it manages to be three books in one: a thoroughly charming, fact-filled stroll through the life and times of Edwin Land and the incredible company he built; a brief, poignant recap of Polaroid's plunge from the heights into not one but two wrenching bankruptcies; and a small but lovely collection of Polaroid images taken by well-known artists. Christopher Bonanos's well-researched and well-written book features a terrific Andy Warhol photo of Liza Minnelli, self-portraits by Chuck Close and Robert Mapplethorpe, and a David Hockney collage, along with photos by Walker Evans, Andre Kertesz, and William Wegman. It also includes several photos by Ansel Adams, who signed on as a $100-a-month Polaroid consultant in 1949, when the company made its first move into photography.&quot; -- Fortune.com\n\n&quot;Edwin Land was one of Steve Jobs's first heroes, and this book shows why. He created a startup in a garage that grew into a company that stood at the intersection of creativity and technology. This is a fascinating saga, both inspiring and cautionary, about innovation and visionary leadership.&quot; -- Walter Isaacson, author of Steve Jobs\n\t\t","torrent":{"xt":"urn:btih:f6ba94a906afd16a6b87606a61aa073d9598035d","amp;dn":"%5BRepost%5D+Instant+-+The+story+of+Polaroid+-+Christopher+Bonanos+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6ba94a906afd16a6b87606a61aa073d9598035d","infoHashBuffer":{"type":"Buffer","data":[246,186,148,169,6,175,209,106,107,135,96,106,97,170,7,61,149,152,3,93]},"announce":[],"urlList":[]}}