{"title":"Keith Richards - Talk Is Cheap [1988] [FLAC]","uid":8035029,"size":296270237,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f79ebdf085ee783b7b929602831ae31f9b57f2c9&amp;dn=Keith+Richards+-+Talk+Is+Cheap+%5B1988%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":14,"time":1358504472,"description":"01. Big Enough (3:20)\n02. Take It So Hard (3:12)\n03. Struggle (4:05)\n04. I Could Have Stood You Up (3:10)\n05. Make No Mistake (5:03)\n06. You Don't Move Me (4:47)\n07. How I Wish (3:32)\n08. Rockawhile (4:35)\n09. Whip It Up (3:58)\n10. Locked Away (5:49)\n11. It Means A Lot (5:21)\n\nCredits:\n\nProducer: Keith Richards\nProducer: Steve Jordan\n\nIn 1987, it was anyone's guess if the Stones would ever get back together. Sure, Mick Jagger and Keith Richards were well known for their public disagreements, but when Jagger decided to tour in support of his second solo album, Primitive Cool, Richards was disheartened and finally succumbed to the idea of recording without the Rolling Stones. Taking the band he had assembled to back up Chuck Berry for the Hail! Hail! Rock 'n' Roll documentary (along with longtime session player Waddy Wachtel), Richards put together an album that was straightforward, musical, and better than a good portion of the Stones' output in the first half of the '80s. The lead single &quot;Take It So Hard,&quot; &quot;Whip It Up,&quot; and &quot;Struggle&quot; are classic Richards riffology, and tracks like &quot;Locked Away&quot; are emotional without being maudlin and worldly but not sounding adult contemporary. The main point of Talk Is Cheap is the music, nothing more; Richards obviously didn't want to fret about anything but the groove. While Jagger's solo work sounded like Mick with some studio musicians, Keith had assembled a band, found a productive songwriting partner in Steve Jordan, and created a record that was free of frills. Simply put, Richards sounded like he was playing for himself, and playing with a certain sense of enjoyment. The new band, the X-pensive Winos, had a different work ethic than the Stones, forcing Richards to focus on the music. What resulted was a solid album built on fundamentals rather than style. It's hard not to see who the real musical force was in the Stones after hearing Talk Is Cheap.","torrent":{"xt":"urn:btih:f79ebdf085ee783b7b929602831ae31f9b57f2c9","amp;dn":"Keith+Richards+-+Talk+Is+Cheap+%5B1988%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f79ebdf085ee783b7b929602831ae31f9b57f2c9","infoHashBuffer":{"type":"Buffer","data":[247,158,189,240,133,238,120,59,123,146,150,2,131,26,227,31,155,87,242,201]},"announce":[],"urlList":[]}}