{"title":"Creating Pitch Perfect - The Story of AutoTune  (BBC 2013)","uid":8506069,"size":26884445,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f94c267710d59ac71cb7a99310a7617a5ba9ee31&amp;dn=Creating+Pitch+Perfect+-+The+Story+of+AutoTune++%28BBC+2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robin1966","files":2,"time":1369426663,"description":"Audiences need never suffer out-of-tune singing again, thanks to the development of pitch-correction software. But as well as correcting the inadequate, it has become a tool for new and creative ways of performing and recording.\n\nPresenter Catherine Bott is a Classical singer, broadcaster and experienced session musician. She visits a recording studio to see how the software works, and bravely submits her own voice for analysis by deliberately singing out of tune.\n\nSurprisingly, one of the best-known examples of pitch correction software - Auto-Tune - was developed by a former oil industry engineer working on the development of acoustic tests for interpreting seismic data. Dr Andy Hildebrand realised that the same technology could be used to analyse and modify pitch in audio files without affecting vocal quality. Catherine talks to Andy about how he came to develop the software.\n\nCatherine also looks at the creative use of pitch correction software - starting with the iconic use of the effect in Cher's 1998 single Believe, where extreme use of the effect creates a robotic vocal style used later by Kanye West and Channy Leaneagh singer with from the band Poliï¿½a. She visits composer and producer Steve Pycroft in his studio to see how the effect can be used on her vocals on a specially-arranged piece of Baroque music.\n\nAnd the negative side of pitch correction is also explored - is it encouraging singers to be lazy, knowing that any tuning errors can always be 'fixed in the mix'?\n\nWith contributions from studio engineers Tom Bailey and Olga Fitzroy, music critics Tom Ewing and Neil McKenzie, and Channy Leaneagh of Poliï¿½a.\n\n------------------------------------------------------------------------------File Information---------------------------------------------------------------------------\nFirst broadcast: BBC R4, 20 May 2013\nType: MPEG 1.0 Layer 3 - 128 kbps mp3 ï¿½ 44 khz - Joint Stereo\nDuration 28 minutes\nCaptured with Radio Downloader, edited with mp3DirectCut\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:f94c267710d59ac71cb7a99310a7617a5ba9ee31","amp;dn":"Creating+Pitch+Perfect+-+The+Story+of+AutoTune++%28BBC+2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f94c267710d59ac71cb7a99310a7617a5ba9ee31","infoHashBuffer":{"type":"Buffer","data":[249,76,38,119,16,213,154,199,28,183,169,147,16,167,97,122,91,169,238,49]},"announce":[],"urlList":[]}}