{"title":"S Health (works on all samsung devices running official android","uid":8997337,"size":9339643,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:f94fb7a05e2d8e0d5771ea7b4bd57cb45fb17d2a&amp;dn=S+Health+%28works+on+all+samsung+devices+running+official+android+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"suilox","files":1,"time":1380848312,"description":"S Health is a signature application released mainly fo the Galaxy S4 and the Note 3 both of them being a flagship device of the Samsung Electronics \n\n THIS APP allows users to watch their weight, blood pressure, and blood sugar levels from their phone. First announced at the Galaxy S III's unveiling back in May, the app syncs with blood pressure monitors and blood glucose meters from Lifescan, Omron, and A&amp;D over Bluetooth or USB depending on the device.\n \nS Health stores readings from these devices so the user can view them over time and share them with contacts or social networks. The idea is to provide a framework for users to set goals and track their progress. S Health is launching in the US, South Korea, and five European countries, and can be downloaded either from the Samsung Apps store or More Services link on the Galaxy S III.\n\nThose of you who are unable to get the app on Samsung APPS they can try this torrent.\n\nInstructions to install-\nWhen the torrent starts seeding just install it on your device normally.\nIf the installation is blocked due to security reasons on your samsung device then go to settings&gt;&gt;security&gt;&gt;device administration&gt;&gt;and leave the installation from unknown sources ticked.\nNote:This app is not tested on NON SAMSUNG DEVICES ,SO PLS TEST AND LEAVE A COMMENT FOR THE SAME IF OR NOT IT WORKS ON ANY NON SAMSUNG DEVICES.\nALSO FEEL FREE TO ASK ANY QUERIES THROUGH YOUR COMMENTS.\n","torrent":{"xt":"urn:btih:f94fb7a05e2d8e0d5771ea7b4bd57cb45fb17d2a","amp;dn":"S+Health+%28works+on+all+samsung+devices+running+official+android+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f94fb7a05e2d8e0d5771ea7b4bd57cb45fb17d2a","infoHashBuffer":{"type":"Buffer","data":[249,79,183,160,94,45,142,13,87,113,234,123,75,213,124,180,95,177,125,42]},"announce":[],"urlList":[]}}