{"title":"Ruth Brown - Miss Rhythm (Greatest Hits And More)","uid":4879829,"size":692239586,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f97a350035c16daaae8354f74d0abc276f18e758&amp;dn=Ruth+Brown+-+Miss+Rhythm+%28Greatest+Hits+And+More%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sowingmyseed","files":41,"time":1241322500,"description":"Track List:\nDisc 1\n1. So Long\n2. Hey Pretty Baby\n3. I'll Get Along Somehow\n4. I'll Comeback Someday\n5. Sentimental Journey\n6. R. B. Blues\n7. Teardrops From My Eyes\n8. Standing On The Corner\n9. I'll Wait For You\n10. I Know\n11. Don't Cry\n12. The Shrine of St. Cecilia\n13. It's All For You\n14. Shine On\n15. Be Anything\n16. 5-10-15 Hours\n17. Have A Good Time\n18. Daddy Daddy\n19. Mama He Treats Your Daughter Mean\n20. Wild Wild Young Men\n\nDisc 2\n1. Ever Since My Baby's Been Gone\n2. Love Contest\n3. Oh What A Dream\n4. Old Man River\n5. Somebody Touched Me\n6. Mambo Baby\n7. I Can See Everybody's Baby\n8. As Long As I'm Moving\n9. It's Love Baby\n10. I Gotta Have You\n11. Love Has Joined Us Together\n12. I Wanna Do More\n13. Lucky Lips\n14. One More Time\n15. This Little Girl's Gone Rockin'\n16. Why Me\n17. I Can't Hear A Word You Say\n18. I Don't Know\n19. Takin' Care of Business\n20. Don't Deceive Me\n\n\nThey called Atlantic Records &quot;the house that Ruth built&quot; during the 1950s, and they weren't referring to the Sultan of Swat. Ruth Brown's regal hitmaking reign from 1949 to the close of the '50s helped tremendously to establish the New York label's predominance in the R&amp;B field. Later, the business all but forgot her -- she was forced to toil as domestic help for a time -- but she returned to the top, her status as a postwar R&amp;B pioneer (and tireless advocate for the rights and royalties of her peers) recognized worldwide.\n\nYoung Ruth Weston was inspired initially by jazz chanteuses Sarah Vaughan, Billie Holiday, and Dinah Washington. She ran away from her Portsmouth home in 1945 to hit the road with trumpeter Jimmy Brown, whom she soon married. A month with bandleader Lucky Millinder's orchestra in 1947 ended abruptly in Washington, D.C., when she was canned for delivering a round of drinks to members of the band. Cab Calloway's sister Blanche gave Ruth a gig at her Crystal Caverns nightclub and assumed a managerial role in the young singer's life. DJ Willis Conover dug Brown's act and recommended her to Ahmet Ertegun and Herb Abramson, bosses of a fledgling imprint named Atlantic. Unfortunately, Brown's debut session for the firm was delayed by a nine-month hospital stay caused by a serious auto accident en route to New York that badly injured her leg. When she finally made it to her first date in May 1949, she made up for lost time by waxing the torch ballad &quot;So Long&quot; (backed by guitarist Eddie Condon's band), which proved to be her first hit.\n\nBrown's seductive vocal delivery shone incandescently on her Atlantic smashes &quot;Teardrops in My Eyes&quot; (an R&amp;B chart-topper for 11 weeks in 1950), &quot;I'll Wait for You&quot; and &quot;I Know&quot; in 1951, 1952's &quot;5-10-15 Hours&quot; (another number one rocker), the seminal &quot;(Mama) He Treats Your Daughter Mean&quot; in 1953, and a tender Chuck Willis-penned &quot;Oh What a Dream,&quot; and the timely &quot;Mambo Baby&quot; the next year. Along the way, Frankie Laine tagged her &quot;Miss Rhythm&quot; during an engagement in Philly. Brown belted a series of her hits on the groundbreaking TV program Showtime at the Apollo in 1955, exhibiting delicious comic timing while trading sly one-liners with MC Willie Bryant (ironically, ex-husband Jimmy Brown was a member of the show's house band).\n\nAfter an even two-dozen R&amp;B chart appearances for Atlantic that ended in 1960 with &quot;Don't Deceive Me&quot; (many of them featuring hell-raising tenor sax solos by Willis &quot;Gator&quot; Jackson, who many mistakenly believed to be Brown's husband), Brown faded from view. After raising her two sons and working a nine-to-five job, Brown began to rebuild her musical career in the mid-'70s. Her comedic sense served her well during a TV sitcom stint co-starring with MacLean Stevenson in Hello, Larry, in a meaty role in director John Waters' 1985 sock-hop satire film Hairspray, and her 1989 Broadway starring turn in Black and Blue (which won her a Tony Award).\n\nThere were more records for Fantasy in the '80s and '90s (notably 1991's jumping Fine and Mellow), and a lengthy tenure as host of National Public Radio's Harlem Hit Parade and BluesStage. Brown's nine-year ordeal to recoup her share of royalties from all those Atlantic platters led to the formation of the nonprofit Rhythm &amp; Blues Foundation, an organization dedicated to helping others in the same frustrating situation. In 1993 Brown was inducted into the Rock and Roll Hall of Fame and 1995 saw the release of her autobiography, Miss Rhythm. Brown suffered a heart attack and stroke following surgery in October 2006 and never fully recovered, passing on November 17, 2006.","torrent":{"xt":"urn:btih:f97a350035c16daaae8354f74d0abc276f18e758","amp;dn":"Ruth+Brown+-+Miss+Rhythm+%28Greatest+Hits+And+More%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f97a350035c16daaae8354f74d0abc276f18e758","infoHashBuffer":{"type":"Buffer","data":[249,122,53,0,53,193,109,170,174,131,84,247,77,10,188,39,111,24,231,88]},"announce":[],"urlList":[]}}