{"title":"Gregory Benford - Far Futures","uid":11604445,"size":260687673,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fb69269a1c14c160f024c971689c875aa9043ec0&amp;dn=Gregory+Benford+-+Far+Futures&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":1,"time":1417391092,"description":"Gregory Benford -  Far Futures (1995)\n\nGregory Benford, one the great SF writers of our day, has assumed the mantle of editor to produce an ambitous hard SF anthology: Far Futures. Many of the fields's greatest works concern vast perspectives, expanding our visions of ourselves by foreseeing the immense panorama of time. This anthology collects five orignal novellas that take the very long view, all set at least ten thousand years in the future. The authors take a rigorously scientific view of such grand panoramas, confronting the largest issues of cosmology, astronomy, evolution, and biology.\n\nGenesis by Poul Anderson is set a billion years ahead, when humanity has become extinct. Earth is threatened by the slowly warming sun. Vast machine intelligences decide to recreate humans.\n\nIn At the Eschaton by Charles Sheffield, a man tries to rescue his dying wife from oblivion by hurling himself forward, in both space and time, to the very end of the universe itself.\n\nJoe Haldeman's For White Hill confronts humanity with hostile aliens who remorselessly grind down every defense against them. A lone artist struggles to find a place in this distant, wondrous future, where humanity seems doomed.\n\nThe last moments of a universe beseiged occupy Greg Bear's Judgment Engine. Can something human matter at the very end of creation, as contorted matter ceases to have meaning and time itself stutters to an eerie halt?\n\nDonald Kingsbury contributes Historical Crisis, a starting work on the prediction of the human future that challenges the foundations of psychohistory, as developed in Isaac Asimov's famous Foundation Trilogy.\n\nFar Futures is required reading for the core audience of hard SF devotees. It may be the best book they read all year","torrent":{"xt":"urn:btih:fb69269a1c14c160f024c971689c875aa9043ec0","amp;dn":"Gregory+Benford+-+Far+Futures","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb69269a1c14c160f024c971689c875aa9043ec0","infoHashBuffer":{"type":"Buffer","data":[251,105,38,154,28,20,193,96,240,36,201,113,104,156,135,90,169,4,62,192]},"announce":[],"urlList":[]}}