{"title":"PERSON OF INTEREST.S03E01-S03E10. Eng srt -Lindoff","uid":9262039,"size":9826135177,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:fc5690c5f8eb06609d6d0f3d3225f331d17c7326&amp;dn=PERSON+OF+INTEREST.S03E01-S03E10.+Eng+srt+-Lindoff&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Holmlinde","files":22,"time":1385637085,"description":"&quot;Person of Interest&quot; -- You are being watched. The government has a secret system, a machine that spies on you every hour of every day. I know because I built it. I designed the Machine to detect acts of terror but it sees everything. Violent crimes involving ordinary people. People like you. Crimes the government considered &quot;irrelevant.&quot; They wouldn't act so I decided I would. But I needed a partner. Someone with the skills to intervene. Hunted by the authorities, we work in secret. You'll never find us. But victim or perpetrator, if your number is up, we'll find you.\n\n Person of Interest follows former CIA paramilitary operative, John Reese (Jim Caviezel), who is presumed dead and teams up with reclusive billionaire Finch (Michael Emerson) to prevent violent crimes in New York City by initiating their own type of justice. With the special training that Reese has had in Covert Operations and Finch's genius software inventing mind, the two are a perfect match for the job that they have to complete. With the help of surveillance equipment, the work &quot;outside the law&quot; and get the right criminal behind bars. \n\n When Reese's skills are noticed by Carter (Taraji P. Henson), a NYPD detective, and Lionel Fusco (Kevin Chapman), a police officer who Reese uses to his advantage, they investigate the crimes together and find that the right person, information, and at the right time, is able to change everything. Creators J.J. Abrams and Bryan Burk (Lost) have done it a great service to unveil this action packed thriller to the networks. \n\n Won the 2012 People's Choice Awards for Favorite New TV Drama\n\n Jim Caviezel............. as Reese \n Michael Emerson....... as Finch \n Taraji P. Henson........ as Detective Carter \n Kevin Chapman......... as Detective Fusco \n","torrent":{"xt":"urn:btih:fc5690c5f8eb06609d6d0f3d3225f331d17c7326","amp;dn":"PERSON+OF+INTEREST.S03E01-S03E10.+Eng+srt+-Lindoff","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc5690c5f8eb06609d6d0f3d3225f331d17c7326","infoHashBuffer":{"type":"Buffer","data":[252,86,144,197,248,235,6,96,157,109,15,61,50,37,243,49,209,124,115,38]},"announce":[],"urlList":[]}}