{"title":"Composite Materials Technology - Neural Network Applications","uid":14532565,"size":9939594,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fc5ba2cfa4dcd25723b077c669ba081003a69f1b&amp;dn=Composite+Materials+Technology+-+Neural+Network+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1462458890,"description":"Composite Materials Technology - Neural Network Applications - S.M. Sapuan and I.M. Mujtaba (CRC, 2010).pdf\r\n\r\nISBN 978-1-4200-9332-2\r\n\r\nArtificial neural networks (ANN) can provide new insight into the study of composite materials and can normally be combined with other artificial intelligence tools such as expert system, genetic algorithm, and fuzzy logic. Because research on this field is very new, there is only a limited amount of published literature on the subject.\r\nCompiling information from diverse sources, Composite Materials Technology: Neural Network Applications fills the void in knowledge of these important networks, covering composite mechanics, materials characterization, product design, and other important aspects of polymer matrix composites.\r\nLight weight, corrosion resistance, good stiffness and strength properties, and part consolidation are just some of the reasons that composites are useful in areas including civil engineering and structure, chemical processing, management, agriculture, space study, and manufacturing. ANN has already been used to carry out design prediction, mechanical property prediction, and selection processes in the evolution of composites, but although it has already been used with great success in various branches of scientific and technological research, it is still in the nascent stage of its development.\r\nFeaturing contributions from leading researchers throughout the world, this book is divided into four parts, starting with an introduction to neural networks and a review of existing literature on the subject. The text then covers structural health monitoring and damage detection in composites, addresses mechanical properties, and discusses design, analysis, and materials selection. Training, testing, and validation of experimental data were carried out to optimize the results presented in the book.\r\nThis book will be an important aid to researchers as they work on the future implementation of ANN in industries such as aerospace, automotive, marine, sporting goods, furniture, and electronics and communication","torrent":{"xt":"urn:btih:fc5ba2cfa4dcd25723b077c669ba081003a69f1b","amp;dn":"Composite+Materials+Technology+-+Neural+Network+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc5ba2cfa4dcd25723b077c669ba081003a69f1b","infoHashBuffer":{"type":"Buffer","data":[252,91,162,207,164,220,210,87,35,176,119,198,105,186,8,16,3,166,159,27]},"announce":[],"urlList":[]}}