{"title":"Who Controls the Internet - Illusions of a Borderless World","uid":4860121,"size":2005541,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fc9e7aef65b9f22a2c01d1979348f862670958c6&amp;dn=Who+Controls+the+Internet+-+Illusions+of+a+Borderless+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Malkavius","files":1,"time":1240235064,"description":"Is the Internet truly &quot;flattening&quot; the modern world? Will national boundaries crumble beneath the ever-increasing volume of Internet traffic? \n\nGoldsmith and Wu, both professors of law (Goldsmith at Harvard, Wu at Columbia), think not, and they present an impressive array of evidence in their favor. \n\nThe authors argue national governments will continue to maintain their sovereignty in the age of the Internet, largely because of economics: e-businesses-even giants such as Yahoo, Google and eBay-need governmental support in order to function. \n\nWhen Yahoo, an American company, was tried in French court for facilitating the auctioning of Nazi paraphernalia in violation of French law, the company was eventually forced to comply with local laws or risk losing the ability to operate in France. \n\nAs eBay grew into an Internet powerhouse, its &quot;feedback&quot; system could not keep up with cunning con artists, so it hired hundreds of fraud prevention specialists (known as &quot;eBay cops&quot;). \n\nGoldsmith and Wu begin with an overview of the Internet's early days, replete with anecdotes and key historical chapters that will be unknown to many readers, but their book quickly introduces its main contention: that existing international law has the power to control the Internet, a conclusion web pundits, cyberlaw specialists and courts across the globe will inevitably challenge. Wu's and Goldsmith's account of the power struggle between the Utopian roots of the Internet and the hegemony of national governments is a timely chronicle of a history still very much in the works.","torrent":{"xt":"urn:btih:fc9e7aef65b9f22a2c01d1979348f862670958c6","amp;dn":"Who+Controls+the+Internet+-+Illusions+of+a+Borderless+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc9e7aef65b9f22a2c01d1979348f862670958c6","infoHashBuffer":{"type":"Buffer","data":[252,158,122,239,101,185,242,42,44,1,209,151,147,72,248,98,103,9,88,198]},"announce":[],"urlList":[]}}