{"title":"Evolution, The Human Story [PDF]~StormRG~","uid":9631195,"size":40846040,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fec68173ff92f7440dcfd7e34661d7913566322e&amp;dn=Evolution%2C+The+Human+Story+%5BPDF%5D%7EStormRG%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"0xmovva","files":-1,"time":1392788592,"description":"Hardcover: 256 pages\nPublisher: DK ADULT (August 15, 2011)\nLanguage: English\nISBN-13: 978-0756686734\nASIN: 0756686733\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\n\nHow did we develop from simple animals inhabiting small pockets of forest in Africa to the dominant species on Earth? Traveling back almost eight million years to our earliest primate relatives, Evolution: The Human Story charts the development of our species from tree-dwelling primates to modern humans.\n\nInvestigating each of our ancestors in detail and in context, from the anatomy of their bones to the environment they lived in, Evolution: The Human Story profiles every human relative and ancestor discovered to date, and illustrates them in lifelike form.\n\nAmazingly realistic CGI and model reconstructions by the renowned Dutch paleoartists, the Kennis brothers, bring us face-to-face and eye-to-eye with some of our distant ancestors, portraying them as never before.\n\nDrawing on cutting-edge research and the latest theories to reveal new and surprising elements, shining a light on previously inaccessible and unimagined detail, Evolution: The Human Story takes on a depth and fascination that is hard to resist.","torrent":{"xt":"urn:btih:fec68173ff92f7440dcfd7e34661d7913566322e","amp;dn":"Evolution%2C+The+Human+Story+%5BPDF%5D%7EStormRG%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fec68173ff92f7440dcfd7e34661d7913566322e","infoHashBuffer":{"type":"Buffer","data":[254,198,129,115,255,146,247,68,13,207,215,227,70,97,215,145,53,102,50,46]},"announce":[],"urlList":[]}}