{"title":"Just a Pilgrim [Graphic Novel] + Garden of Eden","uid":8565722,"size":230590778,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:fef691c3db1977bb9ad3b9c6fc9f52f9d1109bc1&amp;dn=Just+a+Pilgrim+%5BGraphic+Novel%5D+%2B+Garden+of+Eden&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RobbieDee","files":-1,"time":1371023423,"description":"- Contains Just a Pilgrim, and Just a Pilgrim - Garden of Eden! Published by Black Bull and Dynamite Entertainment.\n\n**I dont own or take credit for any of the content contained in this torrent, all credit goes to the creator of the comic.**\n\n\nJust a Pilgrim description:\n\nAnother work by Garth Ennis and Carlos Ezquerra, set in a postapocalyptic world where a sunerruption (Refered to as 'The Burn') cooked the oceans into gigantic deserts, and killed most of the planets population.\n\nThe series is set some years after 'The Burn' and narrated by the diary of a child named 'Billy'. It follows a small group of surviors who are travelling the desert once called the Atlantic Basin, on their search for water. It chronicles their meeting with a lone extremely religious wanderer who calls himself 'Pilgrim' as well as a group of pirates, led by a man with no eyes, two hooks for hands and two peg legs.\n\n\nJust a Pilgrim - Garden of Eden description:\n\nGarth Ennis the creator of Preacher and writer of Fury returns to Black Bull with his latest Just A Pilgrim series Garden Of Eden. With his intense faith in God to drive him, the mysterious Pilgrim has walked over ten thousand miles across the post- apocalyptic wasteland that remains of the Earth. It's now 12-years after &quot;The Burn,&quot; when the sun enlarged, drying all the world's oceans, sending human civilization into ruin. In his travels, he comes upon a gigantic trench which reaches miles into the ocean floor, where he encounters hellish human vermin which attack and a new group of human survivors looking for a hero.\n\n\n","torrent":{"xt":"urn:btih:fef691c3db1977bb9ad3b9c6fc9f52f9d1109bc1","amp;dn":"Just+a+Pilgrim+%5BGraphic+Novel%5D+%2B+Garden+of+Eden","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fef691c3db1977bb9ad3b9c6fc9f52f9d1109bc1","infoHashBuffer":{"type":"Buffer","data":[254,246,145,195,219,25,119,187,154,211,185,198,252,159,82,249,209,16,155,193]},"announce":[],"urlList":[]}}