{"title":"How to Become The World's No 1 Hacker","uid":7493080,"size":21753207,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ffba5db702f7b6f676a0060cb38a577ddbf3694e&amp;dn=How+to+Become+The+World%27s+No+1+Hacker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NepsterJay","files":1,"time":1343802312,"description":"Computer hacking will never die-just multiply! Daily, we hear and see in the news about another cyber attack where hackers have stolen millions of dollars, identities or even shutting down website and companies. The reason why hacking will never die, is because we have IT-Managers, who are not hackers, trying to protect our networks. Every 6 seconds a personal computer is hacked into. Many consumers rely on the concept that the applications that came installed on their brand new computers, are kryptonite and impenetrable by hackers. They believe and trust that the &quot;Geek Squad&quot;, Norton and other anti-hacker applications can protect them. However, this is entirely false!!! We have all heard the adage, &quot;In order to catch a thief, it takes a thief&quot;, well, &quot;in order to catch a hacker it takes a hacker.&quot; Gregory Evans, world renowned security expert, will show you step by step what tools hackers use to get into your network. Evans will then take those same tools and show you step by step how to hack into your own network. This Guide Covers: - Installing Spyware on Computers 7 Cell Phones - Cracking Wireless Networks - Hacking into a Computer or Network - Hacking Web Servers - Tapping VOIP Telephones - Password Cracking - Hacking Voicemail - How to Make Money as a Certified Ethical hacker - AND MUCH, MUCH MORE!!!","torrent":{"xt":"urn:btih:ffba5db702f7b6f676a0060cb38a577ddbf3694e","amp;dn":"How+to+Become+The+World%27s+No+1+Hacker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffba5db702f7b6f676a0060cb38a577ddbf3694e","infoHashBuffer":{"type":"Buffer","data":[255,186,93,183,2,247,182,246,118,160,6,12,179,138,87,125,219,243,105,78]},"announce":[],"urlList":[]}}